{"mathematicians":[
	{
		"mathematicianID": "0",
		"name": "Thales of Miletus",
		"lived": "Greek domain (624 - 546 BC)",
		"image": "/images/thales.png",
		"text": "Thales was the Chief of the \"Seven Sages\" of ancient Greece, and has been called the \"Father of Science,\" the \"Founder of Abstract Geometry,\" and the \"First Philosopher.\" Thales is believed to have studied mathematics under Egyptians, who in turn were aware of much older mathematics from Mesopotamia. Thales may have invented the notion of compass-and-straightedge construction. Several fundamental theorems about triangles are attributed to Thales, including the law of similar triangles (which Thales used famously to calculate the height of the Great Pyramid) and \"Thales' Theorem\" itself: the fact that any angle inscribed in a semicircle is a right angle. (The other \"theorems\" were probably more like well-known axioms, but Thales proved Thales' Theorem using two of his other theorems; it is said that Thales then sacrificed an ox to celebrate what might have been the first mathematical proof in Greece.) Thales noted that, given a line segment of length x, a segment of length x/k can be constructed by first constructing a segment of length kx. Thales was also an astronomer; he invented the 365-day calendar, introduced the use of Ursa Minor for finding North, invented the gnomonic map projection (the first of many methods known today to map (part of) the surface of a sphere to a plane), and is the first person believed to have correctly predicted a solar eclipse. His theories of physics would seem quaint today, but he seems to have been the first to describe magnetism and static electricity. Aristotle said, \"To Thales the primary question was not what do we know, but how do we know it.\" Thales was also a politician, ethicist, and military strategist. It is said he once leased all available olive presses after predicting a good olive season; he did this not for the wealth itself, but as a demonstration of the use of intelligence in business. Thales' writings have not survived and are known only second-hand. Since his famous theorems of geometry were probably already known in ancient Babylon, his importance derives from imparting the notions of mathematical proof and the scientific method to ancient Greeks. Thales' student and successor was Anaximander, who is often called the \"First Scientist\" instead of Thales: his theories were more firmly based on experimentation and logic, while Thales still relied on some animistic interpretations. Anaximander is famous for astronomy, cartography and sundials, and also enunciated a theory of evolution, that land species somehow developed from primordial fish! Anaximander's most famous student, in turn, was Pythagoras. The methods of Thales and Pythagoras led to the schools of Plato and Euclid, an intellectual blossoming unequaled until Europe's Renaissance. "
	},
	{
		"mathematicianID": "1",
		"name": "Pythagoras of Samos",
		"lived": "Greek domain (578 - 505 BC)",
		"image": "/images/pitagora.png",
		"text": "Pythagoras, who is sometimes called the \"First Philosopher,\" studied under Anaximander, Egyptians, Babylonians, and the mystic Pherekydes (from whom Pythagoras acquired a belief in reincarnation); he became the most influential of early Greek mathematicians. He is credited with being first to use axioms and deductive proofs, so his influence on Plato and Euclid may be enormous; he is generally credited with much of Books I and II of Euclid's Elements. He and his students (the \"Pythagoreans\") were ascetic mystics for whom mathematics was partly a spiritual tool. (Some occultists treat Pythagoras as a wizard and founding mystic philosopher.) Pythagoras was very interested in astronomy and seems to have been the first man to realize that the Earth was a globe similar to the other planets. He and his followers began to study the question of planetary motions, which would not be resolved for more than two millenia. He believed thinking was located in the brain rather than heart. The words philosophy and mathematics are said to have been coined by Pythagoras.  Many results of the Pythagoreans were due to his students; none of their writings survive; and what is known is reported second-hand, and possibly exaggerated, by Plato and others. Some ideas attributed to him were probably first enunciated by successors like Parmenides of Elea (ca 515-440 BC). Archaeologists now believe that he was not first to invent the diatonic scale. Pythagoras' students included Hippasus of Metapontum, the famous anatomist and physician Alcmaeon, Milo of Croton, and Croton's daughter Theano (who may have been Pythagoras's wife). The term Pythagorean was also adopted by many disciples who lived later; these disciples include Philolaus of Croton, the natural philosopher Empedocles, and several other famous Greeks. Pythagoras' successor was apparently Theano herself: the Pythagoreans were one of the few ancient schools to practice gender equality. Pythagoras discovered that harmonious intervals in music are based on simple rational numbers. This led to a fascination with integers and mystic numerology; he is sometimes called the \"Father of Numbers\" and once said \"Number rules the universe.\" (About the mathematical basis of music, Leibniz later wrote, \"Music is the pleasure the human soul experiences from counting without being aware that it is counting.\" Other mathematicians who investigated the arithmetic of music included Huygens, Euler and Simon Stevin.) Given any numbers a and b the Pythagoreans were aware of the three distinct means: (a+b)/2 (arithmetic mean), √(ab) (geometric mean), and 2ab/(a+b) (harmonic mean). The Pythagorean Theorem was known long before Pythagoras, but he was often credited (before discovery of an ancient Chinese text) with the first proof. He may have discovered the simple parametric form of primitive Pythagorean triplets (xx-yy, 2xy, xx+yy), although the first explicit mention of this may be in Euclid's Elements. Other discoveries of the Pythagorean school include the construction of the regular pentagon, concepts of perfect and amicable numbers, polygonal numbers, golden ratio (attributed to Theano), three of the five regular solids (attributed to Pythagoras himself), and irrational numbers (attributed to Hippasus). It is said that the discovery of irrational numbers upset the Pythagoreans so much they tossed Hippasus into the ocean! (Another version has Hippasus banished for revealing the secret for constructing the sphere which circumscribes a dodecahedron.)"
	},
	{
		"mathematicianID": "2",
		"name": "Hippocrates of Chios",
		"lived": "Greek domain (470 - 410 BC)",
		"image": "/images/hippocrates.png",
		"text": "Hippocrates (no known relation to Hippocrates of Cos, the famous physician) wrote his own Elements more than a century before Euclid. Only fragments survive but it apparently used axiomatic-based proofs similar to Euclid's and contains many of the same theorems. Hippocrates is said to have invented the reductio ad absurdem proof method. Hippocrates is most famous for his work on the three ancient geometric quandaries: his work on cube-doubling (the Delian Problem) laid the groundwork for successful efforts by Archytas and others; and some claim Hippocrates was first to trisect the general angle. His circle quadrature was of course ultimately unsuccessful but he did prove ingenious theorems about \"lunes\" (crescent-shaped circle fragments). For example, the area of any right triangle is equal to the sum of the areas of the two lunes formed when semi-circles are drawn on each of the three edges of the triangle. Hippocrates also did work in algebra and rudimentary analysis. (Doubling the cube and angle trisection are often called \"impossible,\" but they are impossible only when restricted to collapsing compass and unmarkable straightedge. There are ingenious solutions available with other tools. Construction of the regular heptagon is another such task, with solutions published by Thabit, Alhazen, Vieta, Conway."
	},
	{
		"mathematicianID": "3",
		"name": "Aristotle of Stagira",
		"lived": "Macedonia (384 - 322 BC)",
		"image": "/images/aristotle.png",
		"text": "Aristotle is considered the greatest scientist of the ancient world, and the most influential philosopher and logician ever. His science was a standard curriculum for almost 2000 years. Although the physical sciences couldn't advance until the discoveries by great men like Newton and Lavoisier, Aristotle's work in the biological sciences was superb, and served as paradigm until modern times. Aristotle was personal tutor to the young Alexander the Great. Aristotle's writings on definitions, axioms and proofs may have influenced Euclid. He was also the first mathematician to write on the subject of infinity. His writings include geometric theorems, some with proofs different from Euclid's or missing from Euclid altogether; one of these (which is seen only in Aristotle's work prior to Apollonius) is that a circle is the locus of points whose distances from two given points are in constant ratio."
	},
	{
		"mathematicianID": "4",
		"name": "Euclid of Alexandria",
		"lived": "Greece/Egypt (322 - 275 BC)",
		"image": "/images/euclid.png",
		"text": "Euclid of Alexandria (not to be confused with Socrates' student, Euclid of Megara, who lived a century earlier), directed the school of mathematics at the great university of Alexandria. Little else is known for certain about his life, but several very important mathematical achievements are credited to him. He was the first to prove that there are infinitely many prime numbers; he stated and proved the Unique Factorization Theorem; and he devised Euclid's algorithm for computing gcd. He introduced the Mersenne primes and observed that Mp(Mp + 1)/2 is always perfect (in the sense of Pythagoras) if Mp is Mersenne. (The converse, that any even perfect number has such a corresponding Mersenne prime, was tackled by Alhazen and proven by Euler.) His books contain many famous theorems, though much of the Elements was due to predecessors like Pythagoras (most of Books I and II), Hippocrates (Book III), Theodorus, Eudoxus (Book V), Archytas (perhaps Book VIII) and Theaetetus. Book I starts with an elegant proof that rigid-compass constructions can be implemented with a collapsing compass. (Given A, B, C, find CF = AB by first constructing equilateral triangle ACD; then use the compass to find E on AD with AE = AB; and finally find F on DC with DF = DE.) Although notions of trigonometry were not in use, Euclid's theorems include some closely related to the Laws of Sines and Cosines. Among several books attributed to Euclid are The Division of the Scale (a mathematical discussion of music), The Optics, The Cartoptrics (a treatise on the theory of mirrors), a book on spherical geometry, a book on logic fallacies, and his comprehensive math textbook The Elements. Several of his masterpieces have been lost, including works on conic sections and other advanced geometric topics. Apparently Desargues' Homology Theorem (a pair of triangles is coaxial if and only if it is copolar) was proved in one of these lost works; this is the fundamental theorem which initiated the study of projective geometry. The Elements introduced the notions of axiom and theorem; was used as a textbook for 2000 years; and in fact is still the basis for high school geometry, making Euclid the leading mathematics teacher of all time. Some think his best inspiration was recognizing that the Parallel Postulate must be an axiom rather than a theorem. There are many famous quotations about Euclid and his books. Abraham Lincoln abandoned his law studies when he didn't know what \"demonstrate\" meant and \"went home to my father's house [to read Euclid], and stayed there till I could give any proposition in the six books of Euclid at sight. I then found out what demonstrate means, and went back to my law studies.\""
	},
	{
		"mathematicianID": "5",
		"name": "Archimedes of Syracuse",
		"lived": "Greek domain (287 - 212 BC)",
		"image": "/images/archimedes.png",
		"text": "Archimedes is universally acknowledged to be the greatest of ancient mathematicians. He studied at Euclid's school (probably after Euclid's death), but his work far surpassed, and even leapfrogged, the works of Euclid. (Some of Euclid's more difficult theorems are easy analytic consequences of Archimedes' Lemma of Centroids.) His achievements are particularly impressive given the lack of good mathematical notation in his day. His proofs are noted not only for brilliance but for unequaled clarity. Archimedes made advances in number theory, algebra, and analysis, but is most renowned for his many theorems of plane and solid geometry. He was first to prove Heron's formula for the area of a triangle. His excellent approximation to √3 indicates that he'd partially anticipated the method of continued fractions. He developed a recursive method of representing large integers, and was first to note the law of exponents. He found a method to trisect an arbitrary angle (using a markable straightedge — the construction is impossible using strictly Platonic rules). One of his most remarkable and famous geometric results was determining the area of a parabolic section, for which he offered two independent proofs, one using his Principle of the Lever, the other using a geometric series. Some of Archimedes' work survives only because Thabit ibn Qurra translated the otherwise-lost Book of Lemmas; it contains the angle-trisection method and several ingenious theorems about inscribed circles. (Thabit shows how to construct a regular heptagon; it may not be clear whether this came from Archimedes, or was fashioned by Thabit by studying Archimedes' angle-trisection method.) Other discoveries known only second-hand include the Archimedean semiregular solids reported by Pappus, and the Broken-Chord Theorem reported by Alberuni. Archimedes and Newton might be the two best geometers ever, but although each produced ingenious geometric proofs, often they used non-rigorous calculus to discover results, and then devised rigorous geometric proofs for publication. He used integral calculus to determine the centers of mass of hemisphere and cylindrical wedge, and the volume of two cylinders' intersection. Although Archimedes didn't develop differentiation (integration's inverse), Michel Chasles credits him (along with Kepler, Cavalieri, and Fermat, who all lived more than 18 centuries later) as one of the four who developed calculus before Newton and Leibniz. He was one of the greatest mechanists ever: he laid a mathematical foundation for the principles of leverage; discovered the first law of hydrostatics; and invented the compound pulley, the hydraulic screwpump (called Archimedes' screw), a miniature planetarium, and war machines (catapult and ship-burning mirrors). (Some of these inventions may predate Archimedes. On the other hand, some scholars attribute the Antikythera mechanism to Archimedes or his inspiration.) His books include Floating Bodies, Spirals, The Sand Reckoner, Measurement of the Circle, Sphere and Cylinder, Plane Equilibriums, Conoids and Spheroids, Quadrature of Parabola, various now-lost works cited by Pappus or others, possibly The Book of Lemmas, and (discovered only recently, and often called his most important work) The Method. He developed the Stomachion puzzle (and solved a difficult enumeration problem involving it); other famous gems include The Cattle-Problem. The Book of Lemmas contains various geometric gems (\"the Salinon,\" \"the Shoemaker's Knife\", etc.) and is credited to Archimedes by Thabit ibn Qurra but the attribution is disputed."
	},
	{
		"mathematicianID": "6",
		"name": "Eratosthenes of Cyrene",
		"lived": "Greek domain (276 - 194 BC)",
		"image": "/images/eratosten.png",
		"text": "Eratosthenes was one of the greatest polymaths; he is called the Father of Geography, was Chief Librarian at Alexandria, was a poet, music theorist, astronomer (calculating the Earth's diameter, distance to the Sun, etc.), mechanical engineer (anticipating laws of elasticity, etc.), and was an outstanding mathematician. He is famous for his prime number Sieve, but more impressive was his work on the cube-doubling problem which he related to the design of siege weapons (catapults) where a cube-root calculation is needed. Eratosthenes had the nickname Beta; he was a master of several fields, but was only second-best of his time. His better was also his good friend: Archimedes of Syracuse dedicated The Method to Eratosthenes."
	},
	{
		"mathematicianID": "7",
		"name": "Ptolemaeus",
		"lived": "Egypt (90 - 168)",
		"image": "/images/ptolemy.png",
		"text": "Ptolemy, the Librarian of Alexandria, was one of the most famous of ancient Greek scientists. Among his mathematical results, most famous may be Ptolemy's Theorem (AC•BD = AB•CD + BC•AD if and only if ABCD is a cyclic quadrilateral). This theorem has many useful corollaries; it was frequently applied in Copernicus' work. Ptolemy also wrote on trigonometry, optics, geography, map projections, and astrology; but is most famous for his astronomy, where he perfected the geocentric model of planetary motions. Ptolemy wrote that the fixed point in a model of planetary motion was arbitrary, but rejected the Earth spinning on its axis since he thought this would lead to powerful winds."
	},
	{
		"mathematicianID": "8",
		"name": "Hypatia of Alexandria",
		"lived": "Egypt (350 - 415)",
		"image": "/images/hypatia.png",
		"text": "Born nearly 17 centuries ago, Hypatia of Alexandria was a brazen, highly intelligent woman who excelled in the fields of science, math and philosophy, which at the time (and for hundreds upon hundreds of years further) were seen squarely as the domain of men. Hypatia’s foremost teacher was her father, Theon Alexandricus, a mathematician and philosopher, who she would later go on to contribute to several mathematical works with. Hypatia herself was a teacher, as well as being the inventor of the hydrometer. Though she forged ahead in a time when women were all but ignored in the realm of mathematics, this bright Greek woman eventually met with a tragic death when her chariot was attacked and she was brutally murdered by a gang of Christians. Though her life was cut short, while she was alive, through her accomplishments, Hypatia was able lay the groundwork for future female pioneers of mathematics."
	},
	{
		"mathematicianID": "9",
		"name": "Aryabhata",
		"lived": "India (476 - 550)",
		"image": "/images/aryabhata.png",
		"text": "Indian mathematicians excelled for thousands of years, and eventually even developed advanced techniques like Taylor series before Europeans did, but they are denied credit because of Western ascendancy. Among the Hindu mathematicians, Aryabhata (called Arjehir by Arabs) may be most famous. While Europe was in its early \"Dark Age,\" Aryabhata advanced arithmetic, algebra, elementary analysis, and especially plane and spherical trigonometry, using the decimal system. Aryabhata is sometimes called the \"Father of Algebra\" instead of al-Khowârizmi (who himself cites the work of Aryabhata). His most famous accomplishment in mathematics was the Aryabhata Algorithm (connected to continued fractions) for solving Diophantine equations. Aryabhata made several important discoveries in astronomy, the nature of moonlight, and concept of sidereal year; his estimate of the Earth's circumference was more accurate than any achieved in ancient Greece. He was among the very few ancient scholars who realized the Earth rotated daily on an axis; claims that he also espoused heliocentric orbits are controversial, but may be confirmed by the writings of al-Biruni. Aryabhata is said to have introduced the constant e. He used π ≈ 3.1416; it is unclear whether he discovered this independently or borrowed it from Liu Hui of China. Although it was first discovered by Nicomachus three centuries earlier, Aryabhata is famous for the identity Σ (k3) = (Σ k)2 Some of Aryabhata's achievements, an excellent approximation to the sine function, are known only from the writings of Bhaskara I, who wrote: \"Aryabhata is the master who, after reaching the furthest shores and plumbing the inmost depths of the sea of ultimate knowledge of mathematics, kinematics and spherics, handed over the three sciences to the learned world.\""
	},
	{
		"mathematicianID": "10",
		"name": "Brahmagupta",
		"lived": "India (589 - 668)",
		"image": "/images/brahmagupta.png",
		"text": "No one person gets unique credit for the invention of the decimal system but Brahmagupta's textbook Brahmasphutasiddhanta was very influential, and is sometimes considered the first textbook \"to treat zero as a number in its own right.\" It also treated negative numbers. (Others claim these were first seen 800 years earlier in Chang Tshang's Chinese text and were implicit in what survives of earlier Hindu works, but Brahmagupta's text discussed them lucidly.) Along with Diophantus, Brahmagupta was also among the first to express equations with symbols rather than words. Brahmagupta Bhillamalacarya (`The Teacher from Bhillamala') made great advances in arithmetic, algebra, numeric analysis, and geometry. Several theorems bear his name, including the formula for the area of a cyclic quadrilateral:  16 A2 = (a+b+c-d)(a+b-c+d)(a-b+c+d)(-a+b+c+d)  Another famous Brahmagupta theorem dealing with such quadrilaterals can be phrased \"In a circle, if the chords AB and CD are perpendicular and intersect at E, then the line from E which bisects AC will be perpendicular to BD.\" He also began the study of rational quadrilaterals which Kummer would eventually complete. Proving Brahmagupta's theorems are good challenges even today. In addition to his famous writings on practical mathematics and his ingenious theorems of geometry, Brahmagupta solved the general quadratic equation, and worked on number theory problems. He was first to find a general solution to the simplest Diophantine form. His work on Pell's equations has been called \"brilliant\" and \"marvelous.\" He proved the Brahmagupta-Fibonacci Identity (the set of sums of two squares is closed under multiplication). He applied mathematics to astronomy, predicting eclipses, etc."
	},
	{
		"mathematicianID": "11",
		"name": "Al-Khowârizmi",
		"lived": "Iraq (780 - 850)",
		"image": "/images/alkhwarizmi.png",
		"text": "Al-Khowârizmi (aka Mahomet ibn Moses) was a Persian who worked as a mathematician, astronomer and geographer early in the Golden Age of Islamic science. He introduced the Hindu decimal system to the Islamic world and Europe; invented the horary quadrant; improved the sundial; developed trigonometry tables; and improved on Ptolemy's astronomy and geography. He wrote the book Al-Jabr, which demonstrated simple algebra and geometry, and several other influential books. Unlike Diophantus' work, which dealt in specific examples, Al-Khowârizmi was the first algebra text to present general methods; he is often called the \"Father of Algebra.\" (Diophantus did, however, use superior \"syncopated\" notation.) The word algorithm is borrowed from Al-Khowârizmi's name, and algebra is taken from the name of his book. He also coined the word cipher, which became English zero (although this was just a translation from the Sanskrit word for zero introduced by Aryabhata). He was an essential pioneer for Islamic science, and for the many Arab and Persian mathematicians who followed; and hence also for Europe's eventual Renaissance which was heavily dependent on Islamic teachings. Al-Khowârizmi's texts on algebra and decimal arithmetic are considered to be among the most influential writings ever."
	},
	{
		"mathematicianID": "12",
		"name": "Leonardo (Fibonacci)",
		"lived": "Italy (1170 - 1245)",
		"image": "/images/leonardo.png",
		"text": "Leonardo (known today as Fibonacci) introduced the decimal system and other new methods of arithmetic to Europe, and relayed the mathematics of the Hindus, Persians, and Arabs. Others, especially Gherard of Cremona, had translated Islamic mathematics, the works of al-Khowârizmi, into Latin, but Leonardo was the influential teacher. He also re-introduced older Greek ideas like Mersenne numbers and Diophantine equations. Leonardo's writings cover a very broad range including new theorems of geometry, methods to construct and convert Egyptian fractions (which were still in wide use), irrational numbers, the Chinese Remainder Theorem, theorems about Pythagorean triplets, and the series 1, 1, 2, 3, 5, 8, 13, .... which is now linked with the name Fibonacci. In addition to his great historic importance and fame (he was a favorite of Emperor Frederick II), Leonardo `Fibonacci' is called \"the greatest number theorist between Diophantus and Fermat\" and \"the most talented mathematician of the Middle Ages.\" Leonardo is most famous for his book Liber Abaci, but his Liber Quadratorum provides the best demonstration of his skill. He defined congruums and proved theorems about them, including a theorem establishing the conditions for three square numbers to be in consecutive arithmetic series; this has been called the finest work in number theory prior to Fermat (although a similar statement was made about one of Bhaskara II's theorems). Although often overlooked, this work includes a proof of the n = 4 case of Fermat's Last Theorem. (Leonardo's proof of FLT4 is widely ignored or considered incomplete. Another of Leonardo's noteworthy achievements was proving that the roots of a certain cubic equation could not have any of the constructible forms Euclid had outlined in Book 10 of his Elements. He also wrote on, but didn't prove, Wilson's Theorem. Leonardo provided Europe with the decimal system, algebra and the 'lattice' method of multiplication, all far superior to the methods then in use. He introduced notation like 3/5; his clever extension of this for quantities like 5 yards, 2 feet, and 3 inches is more efficient than today's notation. It seems hard to believe but before the decimal system, mathematicians had no notation for zero. Referring to this system, Gauss was later to exclaim \"To what heights would science now be raised if Archimedes had made that discovery!\""
	},
	{
		"mathematicianID": "13",
		"name": "Leonardo da Vinci",
		"lived": "Italy (1452 - 1519)",
		"image": "/images/davinci.png",
		"text": "Leonardo da Vinci is most renowned for his paintings, Mona Lisa and The Last Supper are among the most discussed and admired paintings ever, but he did much other work and was probably the most talented, versatile and prolific polymath ever to live; his writings exceed 13,000 folios. He developed new techniques, and principles of perspective geometry, for drawing, painting and sculpture; he was also an expert architect and engineer; and surely the most prolific inventor of all time. Although most of his paper designs were never built, Leonardo's inventions include reflecting and refracting telescope, adding machine, parabolic compass, improved anemometer, parachute, helicopter, flying ornithopter, several war machines (multi-barreled gun, steam-driven cannon, tank, giant crossbow, finned mortar shells, portable bridge), pumps, an accurate spring-operated clock, bobbin winder, robots, scuba gear, an elaborate musical instrument he called the 'viola organista,' and more. (Some of his designs, including the viola organista and a large single-span bridge, were finally built five centuries later.) He developed the mechanical theory of the arch; made advances in anatomy, botany, and other fields of science; he was first to conceive of plate tectonics. He was also a poet and musician. He had little formal training in mathematics until he was in his mid-40's, when he and Luca Pacioli (the other great Italian mathematician of that era) began tutoring each other. Despite this slow start, he did make novel achievements in mathematics: he was first to note the simple classification of symmetry groups on the plane, achieved interesting bisections and mensurations, and developed an approximate solution to the circle-squaring problem. He was first to discover the 60-vertex shape now called \"buckyball.\""
	},
	{
		"mathematicianID": "14",
		"name": "Nicolaus Copernicus",
		"lived": "Poland (1472 - 1543)",
		"image": "/images/kopernikus.png",
		"text": "The European Renaissance developed in 15th-century Italy, with the blossoming of great art, and as scholars read books by great Islamic scientists like Alhazen. The earliest of these great Italian polymaths were largely not noted for mathematics, and Leonardo da Vinci began serious math study only very late in life, so the best candidates for mathematical greatness in the Italian Renaissance were foreigners. Along with Regiomontanus from Bavaria, there was an even more famous man from Poland. Nicolaus Copernicus (Mikolaj Kopernik) was a polymath: he studied law and medicine; published poetry; contemplated astronomy; worked professionally as a church scholar and diplomat; and was also a painter. He studied Islamic works on astronomy and geometry at the University of Bologna, and eventually wrote a book of great impact. Although his only famous theorem of mathematics (that certain trochoids are straight lines) may have been derived from Oresme's work, or copied from Nasir al-Tusi, it was mathematical thought that led Copernicus to the conclusion that the Earth rotates around the Sun. Despite opposition from the Roman church, this discovery led, via Galileo, Kepler and Newton, to the Scientific Revolution. Until the Protestant Reformation, which began about the time of Copernicus' discovery, European scientists were reluctant to challenge the Catholic Church and its belief in geocentrism. Copernicus' book was published only posthumously. It remains controversial whether earlier Islamic or Hindu mathematicians (or even Archimedes with his The Sand Reckoner) believed in heliocentrism, but were also inhibited by religious orthodoxy."
	},
	{
		"mathematicianID": "15",
		"name": "Girolamo Cardano",
		"lived": "Italy (1501 - 1576)",
		"image": "/images/cardano.png",
		"text": "Girolamo Cardano (or Jerome Cardan) was a highly respected physician and was first to describe typhoid fever. He was also an accomplished gambler and chess player and wrote an early book on probability. He was also a remarkable inventor: the combination lock, an advanced gimbal, a ciphering tool, and the Cardan shaft with universal joints are all his inventions and are in use to this day. (The U-joint is sometimes called the Cardan joint.) He also helped develop the camera obscura. Cardano made contributions to physics: he noted that projectile trajectories are parabolas, and may have been first to note the impossibility of perpetual motion machines. He did work in philosophy, geology, hydrodynamics, music; he wrote books on medicine and an encyclopedia of natural science. But Cardano is most remembered for his achievements in mathematics. He was first to publish general solutions to cubic and quartic equations, and first to publish the use of complex numbers in calculations. (Cardano's Italian colleagues deserve much credit: Ferrari first solved the quartic, he or Tartaglia the cubic; and Bombelli first treated the complex numbers as numbers in their own right. Cardano may have been the last great mathematician unwilling to deal with negative numbers: his treatment of cubic equations had to deal with ax3 - bx + c = 0 and ax3 - bx = c as two different cases.) Cardano introduced binomial coefficients and the Binomial Theorem, and introduced and solved the geometric hypocyloid problem, as well as other geometric theorems (the theorem underlying the 2:1 spur wheel which converts circular to reciprocal rectilinear motion). Cardano is credited with Cardano's Ring Puzzle, still manufactured today and related to the Tower of Hanoi puzzle. (This puzzle may predate Cardano, and may even have been known in ancient China.) Da Vinci and Galileo may have been more influential than Cardano, but of the three great generalists in the century before Kepler, it seems clear that Cardano was the most accomplished mathematician."
	},
	{
		"mathematicianID": "16",
		"name": "René Descartes",
		"lived": "France (1596-1650)",
		"image": "/images/dekart.png",
		"text": "Descartes' early career was that of soldier-adventurer and he finished as tutor to royalty, but in between he achieved fame as the preeminent intellectual of his day. He is considered the inventor of both analytic geometry and symbolic algebraic notation and is therefore called the \"Father of Modern Mathematics.\" His use of equations to partially solve the geometric Problem of Pappus revolutionized mathematics. Because of his famous philosophical writings (\"Cogito ergo sum\") he is considered, along with Aristotle, to be one of the most influential thinkers in history. His famous mathematical theorems include the Rule of Signs (for determining the signs of polynomial roots), the elegant formula relating the radii of Soddy kissing circles, his theorem on total angular defect (an early form of the Gauss-Bonnet result so key to much mathematics), and an improved solution to the Delian problem (cube-doubling). While studying lens refraction, he invented the Ovals of Descartes. He improved mathematical notation (the use of superscripts to denote exponents). He also discovered Euler's Polyhedral Theorem, F+V = E+2. Descartes was very influential in physics and biology as well, developing laws of motion which included a \"vortex\" theory of gravitation; but most of his scientific work outside mathematics was eventually found to be incorrect. Descartes has an extremely high reputation and would be ranked even higher by many list makers, but whatever his historical importance his mathematical skill was not in the top rank. Some of his work was borrowed from others. He had only insulting things to say about Pascal and Fermat, each of whom was much more brilliant at mathematics than Descartes. (Some even suspect that Descartes arranged the destruction of Pascal's lost Essay on Conics.) And Descartes made numerous errors in his development of physics, perhaps even delaying science, with Huygens writing \"in all of [Descartes'] physics, I find almost nothing to which I can subscribe as being correct.\" Even the historical importance of his mathematics may be somewhat exaggerated since others, Fermat, Wallis and Cavalieri, were making similar discoveries independently."
	},
	{
		"mathematicianID": "17",
		"name": "Pierre de Fermat",
		"lived": "France (1601 - 1665)",
		"image": "/images/fermat.png",
		"text": "Pierre de Fermat was the most brilliant mathematician of his era and, along with Descartes, one of the most influential. Although mathematics was just his hobby (Fermat was a government lawyer), Fermat practically founded Number Theory, and also played key roles in the discoveries of Analytic Geometry and Calculus. Lagrange considered Fermat, rather than Newton or Leibniz, to be the inventor of calculus. Fermat was first to study certain interesting curves, the \"Witch of Agnesi\". He was also an excellent geometer (discovering a triangle's Fermat point), and (in collaboration with Blaise Pascal) discovered probability theory. Fellow geniuses are the best judges of genius, and Blaise Pascal had this to say of Fermat: \"For my part, I confess that [Fermat's researches about numbers] are far beyond me, and I am competent only to admire them.\" E.T. Bell wrote \"it can be argued that Fermat was at least Newton's equal as a pure mathematician.\" Fermat's most famous discoveries in number theory include the ubiquitously-used Fermat's Little Theorem; the n = 4 case of his conjectured Fermat's Last Theorem (he may have proved the n = 3 case as well); and Fermat's Christmas Theorem (that any prime (4n+1) can be represented as the sum of two squares in exactly one way) which may be considered the most difficult theorem of arithmetic which had been proved up to that date. Fermat proved the Christmas Theorem with difficulty using \"infinite descent,\" but details are unrecorded, so the theorem is often named the Fermat-Euler Prime Number Theorem, with the first published proof being by Euler more than a century after Fermat's claim. Another famous conjecture by Fermat is that every natural number is the sum of three triangle numbers, or more generally the sum of k k-gonal numbers. As with his \"Last Theorem\" he claimed to have a proof but didn't write it up. (This theorem was eventually proved by Lagrange for k=4, the very young Gauss for k=3, and Cauchy for general k. Diophantus claimed the k=4 case but any proof has been lost.) Fermat's conjectures were impressive even if unproven, and that this great mathematician is often underrated. (Recall that his so-called \"Last Theorem\" was actually just a private scribble.) Fermat developed a system of analytic geometry which both preceded and surpassed that of Descartes; he developed methods of differential and integral calculus which Newton acknowledged as an inspiration. Solving   df(x)/dx = 0   to find extrema of f(x) is perhaps the most useful idea in applied mathematics; this technique originated with Fermat. Fermat was also the first European to find the integration formula for the general polynomial; he used his calculus to find centers of gravity, etc. Fermat's contemporaneous rival René Descartes is more famous than Fermat, and Descartes' writings were more influential. Whatever one thinks of Descartes as a philosopher, however, it seems clear that Fermat was the better mathematician. Fermat and Descartes did work in physics and independently discovered the (trigonometric) law of refraction, but Fermat gave the correct explanation, and used it remarkably to anticipate the Principle of Least Action later enunciated by Maupertuis (though Maupertuis himself, like Descartes, had an incorrect explanation of refraction). Fermat and Descartes independently discovered analytic geometry, but it was Fermat who extended it to more than two dimensions, and followed up by developing elementary calculus."
	},
	{
		"mathematicianID": "18",
		"name": "Blaise Pascal",
		"lived": "France (1623 - 1662)",
		"image": "/images/pascal.png",
		"text": "Pascal was an outstanding genius who studied geometry as a child. At the age of sixteen he stated and proved Pascal's Theorem, a fact relating any six points on any conic section. The Theorem is sometimes called the \"Cat's Cradle\" or the \"Mystic Hexagram.\" Pascal followed up this result by showing that each of Apollonius' famous theorems about conic sections was a corollary of the Mystic Hexagram; along with Gérard Desargues (1591-1661), he was a key pioneer of projective geometry. He also made important early contributions to calculus; indeed it was his writings that inspired Leibniz. Returning to geometry late in life, Pascal advanced the theory of the cycloid. In addition to his work in geometry and calculus, he founded probability theory, and made contributions to axiomatic theory. His name is associated with the Pascal's Triangle of combinatorics and Pascal's Wager in theology. Like most of the greatest mathematicians, Pascal was interested in physics and mechanics, studying fluids, explaining vacuum, and inventing the syringe and hydraulic press. At the age of eighteen he designed and built the world's first automatic adding machine. (Although he continued to refine this invention, it was never a commercial success.) He suffered poor health throughout his life, abandoned mathematics for religion at about age 23, wrote the philosophical treatise Pensées (\"We arrive at truth, not by reason only, but also by the heart\"), and died at an early age. Many think that had he devoted more years to mathematics, Pascal would have been one of the greatest mathematicians ever."
	},
	{
		"mathematicianID": "19",
		"name": "Isaac Newton",
		"lived": "England (1642 - 1727)",
		"image": "/images/newton.png",
		"text": "Newton was an industrious lad who built marvelous toys (a model windmill powered by a mouse on treadmill). At about age 22, on leave from University, this genius began revolutionary advances in mathematics, optics, dynamics, thermodynamics, acoustics and celestial mechanics. He is famous for his Three Laws of Motion (inertia, force, reciprocal action) but, as Newton himself acknowledged, these Laws weren't fully novel: Hipparchus, Ibn al-Haytham, Descartes, Galileo and Huygens had all developed much basic mechanics already; and Newton credits the First Law to Aristotle. However Newton was apparently the first person to conclude that the ordinary gravity we observe on Earth is the very same force that keeps the planets in orbit. His Law of Universal Gravitation was revolutionary and due to Newton alone. (Christiaan Huygens, the other great mechanist of the era, had independently deduced that Kepler's laws imply inverse-square gravitation, but he considered the action at a distance in Newton's theory to be \"absurd.\") Newton published the Cooling Law of thermodynamics. He also made contributions to chemistry, and was the important early advocate of the atomic theory. His writings also made important contributions to the general scientific method. His other intellectual interests included theology, and mysticism. He studied ancient Greek writers like Pythagoras, Democritus, Lucretius, Plato; and claimed that the ancients knew much, including the law of gravitation. Newton's greatness is indicated by the huge range of his physics: even without his Laws of Motion, Gravitation and Cooling, he'd be famous just for his revolutionary work in optics, where he explained diffraction, observed that white light is a mixture of all the rainbow's colors, noted that purple is created by combining red and blue light and, starting from that observation, was first to conceive of a color hue \"wheel.\" Newton almost anticipated Einstein's mass-energy equivalence, writing \"Gross Bodies and Light are convertible into one another... [Nature] seems delighted with Transmutations.\" Newton's earliest fame came when he designed the first reflecting telescope: by avoiding chromatic aberration, these were the best telescopes of that era. He also designed the first reflecting microscope, and the sextant. Although others also developed the techniques independently, Newton is regarded as the \"Father of Calculus\" (which he called \"fluxions\"); he shares credit with Leibniz for the Fundamental Theorem of Calculus (that integration and differentiation are each other's inverse operation). He applied calculus for several purposes: finding areas, tangents, the lengths of curves and the maxima and minima of functions. Although Descartes is renowned as the inventor of analytic geometry, he and followers like Wallis were reluctant even to use negative coordinates, so one historian declares Newton to be \"the first to work boldly with algebraic equations.\" In addition to several other important advances in analytic geometry, his mathematical works include the Binomial Theorem, his eponymous interpolation method, the idea of polar coordinates, and power series for exponential and trigonometric functions. (His equation   ex = ∑ xk / k!   has been called the \"most important series in mathematics.\") He contributed to algebra and the theory of equations; he was first to state Bézout's Theorem; he generalized Descartes' rule of signs. (The generalized rule of signs was incomplete and finally resolved two centuries later by Sturm and Sylvester.) He developed a series for the arcsin function. He developed facts about cubic equations (just as the \"shadows of a cone\" yield all quadratic curves, Newton found a curve whose \"shadows\" yield all cubic curves). He proved, using a purely geometric argument of awesome ingenuity, that same-mass spheres (or hollowed spheres) of any radius have equal gravitational attraction: this fact is key to celestial motions. (He also proved that objects inside a hollowed sphere experience zero net attraction.) He discovered Puiseux series almost two centuries before they were re-invented by Puiseux. (Like some of the greatest ancient mathematicians, Newton took the time to compute an approximation to π; his was better than Vieta's, though still not as accurate as al-Kashi's.)"
	},
	{
		"mathematicianID": "20",
		"name": "Wilhelm von Leibniz",
		"lived": "Germany (1646 - 1716)",
		"image": "/images/leibniz.png",
		"text": "Leibniz was one of the most brilliant and prolific intellectuals ever; and his influence in mathematics (especially his co-invention of the infinitesimal calculus) was immense. His childhood IQ has been estimated as second-highest in all of history, behind only Goethe's. Descriptions which have been applied to Leibniz include \"one of the two greatest universal geniuses\" (da Vinci was the other); \"the most important logician between Aristotle and Boole;\" and the \"Father of Applied Science.\" Leibniz described himself as \"the most teachable of mortals.\" Mathematics was just a self-taught sideline for Leibniz, who was a philosopher, lawyer, historian, diplomat and renowned inventor. He predicted the Earth's molten core, introduced the notion of subconscious mind, and built the first calculator that could do multiplication. Leibniz also had political influence: he consulted to both the Holy Roman and Russian Emperors; another of his patrons was Sophia Wittelsbach (Electress of Hanover), who was only distantly in line for the British throne, but was made Heir Presumptive. (Sophia died before Queen Anne, but her son was crowned King George I of England.) Leibniz pioneered the common discourse of mathematics, including its continuous, discrete, and symbolic aspects. (His ideas on symbolic logic weren't pursued and it was left to Boole to reinvent this almost two centuries later.) Mathematical innovations attributed to Leibniz include the notations ∫f(x)dx, df(x)/dx, and even the use of a•b (instead of a X b) for multiplication; the concepts of matrix determinant and Gaussian elimination; the theory of geometric envelopes; and the binary number system. He worked in number theory, conjecturing Wilson's Theorem. He invented more mathematical terms than anyone, including function, analysis situ, variable, abscissa, parameter and coordinate. He also coined the word transcendental, proving that sin() was not an algebraic function. His works seem to anticipate cybernetics and information theory; and Mandelbrot acknowledged Leibniz' anticipation of self-similarity. Like Newton, Leibniz discovered The Fundamental Theorem of Calculus; his contribution to calculus was much more influential than Newton's, and his superior notation is used to this day. As Leibniz himself pointed out, since the concept of mathematical analysis was already known to ancient Greeks, the revolutionary invention was the notation (\"calculus\"), because with \"symbols [which] express the exact nature of a thing briefly ... the labor of thought is wonderfully diminished.\" Leibniz' thoughts on mathematical physics had some influence. He was one of the first to articulate the law of energy conservation; and developed laws of motion that gave different insights from those of Newton. His cosmology was opposed to that of Newton but, anticipating theories of Mach and Einstein, is more in accord with modern physics. Mathematical physicists influenced by Leibniz include not only Mach, but perhaps Hamilton and Poincaré themselves. Although others found it independently (including perhaps Madhava three centuries earlier), Leibniz discovered and proved a striking identity for π: π/4 = 1 - 1/3 + 1/5 - 1/7 + 1/9 - ..."
	},
	{
		"mathematicianID": "21",
		"name": "Leonhard Euler",
		"lived": "Switzerland (1707 - 1783)",
		"image": "/images/ojler.png",
		"text": "Euler may be the most influential mathematician who ever lived (though some would make him second to Euclid). His colleagues called him Analysis Incarnate. Laplace, famous for denying credit to fellow mathematicians, once said Read Euler, he is our master in everything. His notations and methods in many areas are in use to this day. Euler was the most prolific mathematician in history and is often judged to be the best algorist of all time.  Just as Archimedes extended Euclid's geometry to marvelous heights, so Euler took marvelous advantage of the analysis of Newton and Leibniz. He also gave the world modern trigonometry, pioneered (along with Lagrange) the calculus of variations, generalized and proved the Newton-Giraud formulae and made important contributions to algebra, his study of hypergeometric series. He was also supreme at discrete mathematics, inventing graph theory. He also invented the concept of generating functions, for example, letting p(n) denote the number of partitions of n, Euler found the lovely equation: Σn p(n) xn = 1 / Πk (1 - xk) The denominator of the right side here expands to a series whose exponents all have the (3m2+m)/2 pentagonal number form. Euler found an ingenious proof of this. Euler was a very major figure in number theory. He proved that the sum of the reciprocals of primes less than x is approx. (ln ln x), invented the totient function and used it to generalize Fermat's Little Theorem, found both the largest then-known prime and the largest then-known perfect number, proved e to be irrational, discovered (though without complete proof) a broad class of transcendental numbers, proved that all even perfect numbers must have the Mersenne number form that Euclid had discovered 2000 years earlier, and much more. Euler was also first to prove several interesting theorems of geometry, including facts about the 9-point Feuerbach circle, relationships among a triangle's altitudes, medians, and circumscribing and inscribing circles, the famous Intersecting Chords Theorem and an expression for a tetrahedron's volume in terms of its edge lengths. Euler was first to explore topology, proving theorems about the Euler characteristic, and the famous Euler's Polyhedral Theorem, F+V = E+2 (although it may have been discovered by Descartes and first proved rigorously by Jordan). Although noted as the first great pure mathematician, Euler's pump and turbine equations revolutionized the design of pumps, he also made important contributions to music theory, acoustics, optics, celestial motions, fluid dynamics, and mechanics. He extended Newton's Laws of Motion to rotating rigid bodies and developed the Euler-Bernoulli beam equation. On a lighter note, Euler constructed a particularly magical magic square. Euler combined his brilliance with phenomenal concentration. He developed the first method to estimate the Moon's orbit (the three-body problem which had stumped Newton), and he settled an arithmetic dispute involving 50 terms in a long convergent series. Both these feats were accomplished when he was totally blind. (About this he said Now I will have less distraction). François Arago said that Euler calculated without apparent effort, as men breathe, or as eagles sustain themselves in the wind. Four of the most important constant symbols in mathematics (π, e, i = √-1, and γ = 0.57721566...) were all introduced or popularized by Euler, along with operators like Σ. He did important work with Riemann's zeta function  ζ(s) = ∑ k-s  (although it was not then known by that name). He anticipated the concept of analytic continuation by showing ζ(-1) = 1+2+3+4+... = -1/12. As a young student of the Bernoulli family, Euler discovered the striking identity  ζ(2) = π2/6  This catapulted Euler to instant fame, since the left-side infinite sum (1 + 1/4 + 1/9 + 1/16 + ...) was a famous problem of the time. Among many other famous and important identities, Euler proved the Pentagonal Number Theorem alluded to above (a beautiful result which has inspired a variety of discoveries), and the Euler Product Formula   ζ(s) = ∏(1-p-s)-1  where the right-side product is taken over all primes p. His most famous identity (which Richard Feynman called an almost astounding ... jewel) unifies the trigonometric and exponential functions   ei x = cos x + i sin x. (It is almost wondrous how the particular instance ei π+1 = 0 combines the most important constants and operators together). Some of Euler's greatest formulae can be combined into curious-looking formulae for π:  π2  =  - log2(-1)  =  6 ∏p∈Prime(1-p-2)-1/2)."
	},
	{
		"mathematicianID": "22",
		"name": "Jean d'Alembert",
		"lived": "France (1717 - 1783)",
		"image": "/images/dalamber.png",
		"text": "During the century after Newton, the Laws of Motion needed to be clarified and augmented with mathematical techniques. Jean-Baptiste le Rond d'Alembert, named after the Parisian church where he was abandoned as a baby, played a very key role in that development. His D'Alembert's Principle clarified Newton's Third Law and allowed problems in dynamics to be expressed with simple partial differential equations; his Method of Characteristics then reduced those equations to ordinary differential equations; to solve the resultant linear systems, he effectively invented the method of eigenvalues; he also anticipated the Cauchy-Riemann Equations. These are the same techniques in use for many problems in physics to this day. D'Alembert was also a forerunner in functions of a complex variable, and the notions of infinitesimals and limits. With his treatises on dynamics, elastic collisions, hydrodynamics, cause of winds, vibrating strings, celestial motions, refraction, etc., the young Jean le Rond easily surpassed the efforts of his older rival, Daniel Bernoulli. He may have been first to speak of time as a \"fourth dimension.\" (Rivalry with the Swiss mathematicians led to d'Alembert's sometimes being unfairly ridiculed, although it does seem true that d'Alembert had very incorrect notions of probability.) D'Alembert was first to prove that every polynomial has a complex root; this is now called the Fundamental Theorem of Algebra. (In France this Theorem is called the D'Alembert-Gauss Theorem. Although Gauss was first to provide a fully rigorous proof, d'Alembert's proof preceded, and was more nearly complete than, the attempted proof by Euler-Lagrange.) He also did creative work in geometry (anticipating Monge's Three Circle Theorem), and was principal creator of the major encyclopedia of his day. D'Alembert wrote \"The imagination in a mathematician who creates makes no less difference than in a poet who invents.\""
	},
	{
		"mathematicianID": "23",
		"name": "Carl Friedrich Gauss",
		"lived": "Germany (1777 - 1855)",
		"image": "/images/cfgaus.png",
		"text": " Johann Carl Friedrich Gauss, the Prince of Mathematics, exhibited his calculative powers when he corrected his father's arithmetic before the age of three. His revolutionary nature was demonstrated at age twelve, when he began questioning the axioms of Euclid. His genius was confirmed at the age of nineteen when he proved that the regular n-gon was constructible if and only if it is the product of distinct prime Fermat numbers. Also at age 19, he proved Fermat's conjecture that every number is the sum of three triangle numbers. He further determined the number of distinct ways such a sum could be formed. At age 24 he published Disquisitiones Arithmeticae, probably the greatest book of pure mathematics ever. Although he published fewer papers than some other great mathematicians, Gauss may be the greatest theorem prover ever. Several important theorems and lemmas bear his name. He extended Euclid's Fundamental Theorem of Arithmetic (prime factorization is unique) to the Gaussian complex integers and he was first to produce a rigorous proof of the Fundamental Theorem of Algebra that an n-th degree polynomial has n complex roots. Gauss himself used Fundamental Theorem to refer to Euler's Law of Quadratic Reciprocity and provided eight distinct proofs for it over the years. Gauss proved the n=3 case of Fermat's Last Theorem for Eisenstein integers (the triangular lattice-points on the complex plane). Though more general, Gauss' proof was simpler than the real integer proof and this simplification method revolutionized algebra. Other work by Gauss led to fundamental theorems in statistics, vector analysis, function theory, and generalizations of the Fundamental Theorem of Calculus.   Gauss built the theory of complex numbers into its modern form, including the notion of monogenic functions which are now ubiquitous in mathematical physics. Constructing the regular 17-gon as a teenager was actually an exercise in complex-number algebra, not geometry. Gauss developed the arithmetic of congruences and became the premier number theoretician of all time. Other contributions of Gauss include hypergeometric series, foundations of statistics, and differential geometry. He proved a surprising fundamental theorem about the curvature of manifolds. He also did important work in geometry, providing an improved solution to Apollonius' famous problem of tangent circles, stating and proving the Fundamental Theorem of Normal Axonometry, and solving astronomical problems related to comet orbits and navigation by the stars. Ceres, the first asteroid, was discovered when Gauss was a young man, but only a few observations were made before it disappeared into the Sun's brightness. Could its orbit be predicted well enough to rediscover it on re-emergence? Laplace, one of the most respected mathematicians of the time, declared it impossible. Gauss became famous when he used an 8th-degree polynomial equation to successfully predict Ceres' orbit. Gauss also did important work in several areas of physics, developed an important modification to Mercator's map projection, invented the heliotrope, and co-invented the telegraph."
	},
	{
		"mathematicianID": "24",
		"name": "Augustin-Louis Cauchy",
		"lived": "France (1789 - 1857)",
		"image": "/images/kosi.png",
		"text": "Cauchy was extraordinarily prodigious, prolific and inventive. Home-schooled, he awed famous mathematicians at an early age. In contrast to Gauss and Newton, he was almost over-eager to publish; in his day his fame surpassed that of Gauss and has continued to grow. Cauchy did significant work in analysis, algebra, number theory and discrete topology. His most important contributions included convergence criteria for infinite series, the \"theory of substitutions\" (permutation group theory), and especially his insistence on rigorous proofs. Cauchy's research also included differential equations, determinants, and probability. He invented the calculus of residues, rediscovered Bolzano's Theorem, and much more. Although he was one of the first great mathematicians to focus on abstract mathematics (another was Euler), he also made important contributions to mathematical physics, the theory of elasticity. Cauchy's theorem of solid geometry is important in rigidity theory; the Cauchy-Schwarz Inequality has very wide application (as the basis for Heisenberg's Uncertainty Principle); several important lemmas of analysis are due to Cauchy; the famous Burnside's Counting Theorem was first discovered by Cauchy; etc. He was first to prove Taylor's Theorem rigorously, and first to prove Fermat's conjecture that every positive integer can be expressed as the sum of k k-gonal numbers for any k. (Gauss had proved the case k = 3.) One of the duties of a great mathematician is to nurture his successors, but Cauchy selfishly dropped the ball on both of the two greatest young mathematicians of his day, mislaying key manuscripts of both Abel and Galois. Cauchy is credited with group theory, yet it was Galois who invented this first, abstracting it far more than Cauchy did, some of this in a work which Cauchy \"mislaid.\" (For this historical miscontribution perhaps Cauchy should be demoted.)"
	},
	{
		"mathematicianID": "25",
		"name": "Niels Henrik Abel",
		"lived": "Norway (1802 - 1829)",
		"image": "/images/abel.png",
		"text": "At an early age, Niels Abel studied the works of the greatest mathematicians, found flaws in their proofs, and resolved to reprove some of these theorems rigorously. He was the first to fully prove the general case of Newton's Binomial Theorem, one of the most widely applied theorems in mathematics. Several important theorems of analysis are named after Abel, including the (deceptively simple) Abel's Theorem of Convergence (published posthumously). Along with Galois, Abel is considered one of the two founders of group theory. Abel also made contributions in algebraic geometry and the theory of equations. Inversion (replacing y = f(x) with x = f-1(y)) is a key idea in mathematics (consider Newton's Fundamental Theorem of Calculus); Abel developed this insight. Legendre had spent much of his life studying elliptic integrals, but Abel inverted these to get elliptic functions, and was first to observe (but in a manuscript mislaid by Cauchy) that they were doubly periodic. Elliptic functions quickly became a productive field of mathematics, and led to more general complex-variable functions, which were important to the development of both abstract and applied mathematics. Finding the roots of polynomials is a key mathematical problem: the general solution of the quadratic equation was known by ancients; the discovery of general methods for solving polynomials of degree three and four is usually treated as the major math achievement of the 16th century; so for over two centuries an algebraic solution for the general 5th-degree polynomial (quintic) was a Holy Grail sought by most of the greatest mathematicians. Abel proved that most quintics did not have such solutions. This discovery, at the age of only nineteen, would have quickly awed the world, but Abel was impoverished, had few contacts, and spoke no German. When Gauss received Abel's manuscript he discarded it unread, assuming the unfamiliar author was just another crackpot trying to square the circle or some such. His genius was too great for him to be ignored long, but, still impoverished, Abel died of tuberculosis at the age of twenty-six. His fame lives on and even the lower-case word 'abelian' is applied to several concepts. Liouville said Abel was the greatest genius he ever met. Hermite said \"Abel has left mathematicians enough to keep them busy for 500 years.\""
	},
	{
		"mathematicianID": "26",
		"name": "George Boole",
		"lived": "England (1815 - 1864)",
		"image": "/images/bul.png",
		"text": "George Boole was a precocious child who impressed by teaching himself classical languages, but was too poor to attend college and became an elementary school teacher at age 16. He gradually developed his math skills; as a young man he published a paper on the calculus of variations, and soon became one of the most respected mathematicians in England despite having no formal training. He was noted for work in symbolic logic, algebra and analysis, and also was apparently the first to discover invariant theory. When he followed up Augustus de Morgan's earlier work in symbolic logic, de Morgan insisted that Boole was the true master of that field, and begged his friend to finally study mathematics at university. Boole couldn't afford to, and had to be appointed Professor instead! Although very few recognized its importance at the time, it is Boole's work in Boolean algebra and symbolic logic for which he is now remembered; this work inspired computer scientists like Claude Shannon. Boole's book An Investigation of the Laws of Thought prompted Bertrand Russell to label him the \"discoverer of pure mathematics.\" Boole once said \"No matter how correct a mathematical theorem may appear to be, one ought never to be satisfied that there was not something imperfect about it until it also gives the impression of being beautiful.\""
	},
	{
		"mathematicianID": "27",
		"name": "Georg Riemann",
		"lived": "Germany (1826 - 1866)",
		"image": "/images/riman.png",
		"text": "Georg Friedrich Bernhard Riemann was a phenomenal genius whose work was exceptionally deep, creative and rigorous; he made revolutionary contributions in many areas of pure mathematics, and also inspired the development of physics. He had poor physical health and died at an early age, yet is still considered to be among the most productive mathematicians ever. He made revolutionary advances in complex analysis, which he connected to both topology and number theory. He applied topology to analysis, and analysis to number theory, making revolutionary contributions to all three fields. He introduced the Riemann integral which clarified analysis. He developed the theory of manifolds, a term which he invented. Manifolds underpin topology. By imposing metrics on manifolds Riemann invented differential geometry and took non-Euclidean geometry far beyond his predecessors. Riemann's other masterpieces include tensor analysis, the theory of functions, and a key relationship between some differential equation solutions and hypergeometric series. His generalized notions of distance and curvature described new possibilities for the geometry of space itself. Several important theorems and concepts are named after Riemann, the Riemann-Roch Theorem, a key connection among topology, complex analysis and algebraic geometry. He was so prolific and original that some of his work went unnoticed (for example, Weierstrass became famous for showing a nowhere-differentiable continuous function; later it was found that Riemann had casually mentioned one in a lecture years earlier). Like his mathematical peers (Gauss, Archimedes, Newton), Riemann was intensely interested in physics. His theory unifying electricity, magnetism and light was supplanted by Maxwell's theory; however modern physics, beginning with Einstein's relativity, relies on Riemann's curvature tensor and other notions of the geometry of space. Riemann's teacher was Carl Gauss, who helped steer the young genius towards pure mathematics. Gauss selected \"On the hypotheses that Lie at the Foundations of Geometry\" as Riemann's first lecture; with this famous lecture Riemann went far beyond Gauss' initial effort in differential geometry, extended it to multiple dimensions, and introduced the new and important theory of differential manifolds. Five years later, to celebrate his election to the Berlin Academy, Riemann presented a lecture \"On the Number of Prime Numbers Less Than a Given Quantity,\" for which \"Number\" he presented and partially proved an exact formula, albeit weirdly complicated. Numerous papers have been written on the distribution of primes, but Riemann's contribution is incomparable, despite that his Berlin Academy lecture was his only paper ever on the topic, and number theory was far from his specialty. In the lecture he posed the Hypothesis of Riemann's zeta function, needed for the missing step in his proof. This Hypothesis is considered the most important and famous unsolved problem in mathematics. (Asked what he would first do, if he were magically awakened after centuries, David Hilbert replied \"I would ask whether anyone had proved the Riemann Hypothesis.\") ζ(.) was defined for convergent cases in Euler's mini-bio, which Riemann extended via analytic continuation for all cases. The Riemann Hypothesis \"simply\" states that in all solutions of ζ(s = a+bi) = 0, either s has real part a=1/2 or imaginary part b=0. Despite his great creativity (Gauss praised Riemann's \"gloriously fertile originality;\" another biographer called him \"one of the most profound and imaginative mathematicians of all time [and] a great philosopher\"), Riemann once said: \"If only I had the theorems! Then I should find the proofs easily enough.\""
	},
	{
		"mathematicianID": "28",
		"name": "Jean Gaston Darboux",
		"lived": "France (1842 -1917)",
		"image": "/images/darbu.png",
		"text": "Darboux did outstanding work in geometry, differential geometry, analysis, function theory, mathematical physics, and other fields, his ability \"based on a rare combination of geometrical fancy and analytical power.\" He devised the Darboux integral, equivalent to Riemann's integral but simpler; developed a novel mapping between (hyper-)sphere and (hyper-)plane; proved an important Envelope Theorem in the calculus of variations; developed the field of infinitesimal geometry; and more. Several important theorems are named after him including a generalization of Taylor series, the foundational theorem of symplectic geometry, and the fact that \"the image of an interval is also an interval.\" He wrote the definitive textbook on differential geometry; he was an excellent teacher, inspiring Borel, Cartan and others."
	},
	{
		"mathematicianID": "29",
		"name": "Oliver Heaviside",
		"lived": "England (1850 - 1925)",
		"image": "/images/hevisajd.png",
		"text": "Heaviside dropped out of high school to teach himself telegraphy and electromagnetism, becoming first a telegraph operator but eventually perhaps the greatest electrical engineer ever. He developed transmission line theory, invented the coaxial cable, predicted Cherenkov radiation, described the use of the ionosphere in radio transmission, and much more. Some of his insights anticipated parts of special relativity, and he was first to speculate about gravitational waves. For his revolutionary discoveries in electromagnetism and mathematics, Heaviside became the first winner of the Faraday Medal. As an applied mathematician, Heaviside developed operational calculus (an important shortcut for solving differential equations); developed vector analysis independently of Grassmann; and demonstrated the usage of complex numbers for electro-magnetic equations. Four of the famous Maxwell's Equations are in fact due to Oliver Heaviside, Maxwell having presented a more cumbersome version."
	},
	{
		"mathematicianID": "30",
		"name": "Jules Henri Poincaré",
		"lived": "France (1854 - 1912)",
		"image": "/images/poinkare.png",
		"text": "Poincaré founded the theory of algebraic (combinatorial) topology, and is sometimes called the \"Father of Topology\" (a title also used for Euler and Brouwer). He also did brilliant work in several other areas of mathematics; he was one of the most creative mathematicians ever, and the greatest mathematician of the Constructivist (\"intuitionist\") style. He published hundreds of papers on a variety of topics and might have become the most prolific mathematician ever, but he died at the height of his powers. Poincaré was clumsy and absent-minded; like Galois, he was almost denied admission to French University, passing only because at age 17 he was already far too famous to flunk. In addition to his topology, Poincaré laid the foundations of homology; he discovered automorphic functions (a unifying foundation for the trigonometric and elliptic functions), and essentially founded the theory of periodic orbits; he made major advances in the theory of differential equations. He is credited with partial solution of Hilbert's 22nd Problem. Several important results carry his name, for example the famous Poincaré Recurrence Theorem, which almost seems to contradict the Second Law of Thermodynamics. Poincaré is especially noted for effectively discovering chaos theory, and for posing Poincaré's Conjecture; that conjecture was one of the most famous unsolved problems in mathematics for an entire century, and can be explained without equations to a layman. The Conjecture is that all \"simply-connected\" closed manifolds are topologically equivalent to \"spheres\"; it is directly relevant to the possible topology of our universe. Recently Grigori Perelman proved Poincaré's conjecture, and is eligible for the first Million Dollar math prize in history. As were most of the greatest mathematicians, Poincaré was intensely interested in physics. He made revolutionary advances in fluid dynamics and celestial motions; he anticipated Minkowski space and much of Einstein's Special Theory of Relativity (including the famous equation E = mc2). Poincaré also found time to become a famous popular writer of philosophy, writing, \"Mathematics is the art of giving the same name to different things;\" and \"A [worthy] mathematician experiences in his work the same impression as an artist; his pleasure is as great and of the same nature;\" and \"If nature were not beautiful, it would not be worth knowing, and if nature were not worth knowing, life would not be worth living.\" With his fame, Poincaré helped the world recognize the importance of the new physical theories of Einstein and Planck."
	},
	{
		"mathematicianID": "31",
		"name": "Godfrey Harold Hardy",
		"lived": "England (1877 - 1947)",
		"image": "/images/hardi.png",
		"text": "Hardy was an extremely prolific research mathematician who did important work in analysis (especially the theory of integration), number theory, global analysis, and analytic number theory. He proved several important theorems about numbers, for example that Riemann's zeta function has infinitely many zeros with real part 1/2. He was also an excellent teacher and wrote several excellent textbooks, as well as a famous treatise on the mathematical mind. He abhorred applied mathematics, treating mathematics as a creative art; yet his work has found application in population genetics, cryptography, thermodynamics and particle physics. Hardy is especially famous (and important) for his encouragement of and collaboration with Ramanujan. Hardy provided rigorous proofs for several of Ramanujan's conjectures, including Ramanujan's \"Master Theorem\" of analysis. Among other results of this collaboration was the Hardy-Ramanujan Formula for partition enumeration, which Hardy later used as a model to develop the Hardy-Littlewood Circle Method; Hardy then used this method to prove stronger versions of the Hilbert-Waring Theorem, and in prime number theory; the method has continued to be a very productive tool in analytic number theory. Hardy was also a mentor to Norbert Wiener, another famous prodigy. Hardy once wrote \"A mathematician, like a painter or poet, is a maker of patterns. If his patterns are more permanent than theirs, it is because they are made with ideas.\" He also wrote \"Beauty is the first test; there is no permanent place in the world for ugly mathematics.\""
	},
	{
		"mathematicianID": "32",
		"name": "Srinivasa Ramanujan",
		"lived": "India (1887 - 1920)",
		"image": "/images/ramanujan.png",
		"text": "Like Abel, Ramanujan was a self-taught prodigy who lived in a country distant from his mathematical peers, and suffered from poverty. Childhood dysentery and vitamin deficiencies probably led to his early death. Yet he produced 4000 theorems or conjectures in number theory, algebra, and combinatorics. While some of these were old theorems or just curiosities, many were brilliant new theorems with very difficult proofs. For example, he found a beautiful identity connecting Poisson summation to the Möbius function. He also found a brilliant generalization of Lagrange's Four Square Theorem and much more. Ramanujan might be almost unknown today, except that his letter caught the eye of Godfrey Hardy, who saw remarkable, almost inexplicable formulae which must be true, because if they were not true, no one would have had the imagination to invent them. Ramanujan's specialties included infinite series, elliptic functions, continued fractions, partition enumeration, definite integrals, modular equations, the divisor function, gamma functions, mock theta functions, hypergeometric series, and highly composite numbers. Ramanujan's Master Theorem has wide application in analysis, and has been applied to the evaluation of Feynman diagrams. Much of his best work was done in collaboration with Hardy, for example a proof that almost all numbers n have about log log n prime factors (a result which developed into probabilistic number theory). Much of his methodology, including unusual ideas about divergent series, was his own invention. As a young man he made the absurd claim that 1+2+3+4+... = -1/12. Later it was noticed that this claim translates to a true statement about the Riemann zeta function, with which Ramanujan was unfamiliar. Ramanujan's innate ability for algebraic manipulations equaled or surpassed that of Euler and Jacobi. Ramanujan's most famous work was with the partition enumeration function p(), Hardy guessing that some of these discoveries would have been delayed at least a century without Ramanujan. Together, Hardy and Ramanujan developed an analytic approximation to p(), although Hardy was initially awed by Ramanujan's intuitive certainty about the existence of such a formula, and even the form it would have. Rademacher and Selberg later discovered an exact expression to replace the Hardy-Ramanujan approximation. When Ramanujan's notebooks were studied it was found he had anticipated their technique, but had deferred to his friend and mentor."
	},
	{
		"mathematicianID": "33",
		"name": "Paul Maurice Dirac",
		"lived": "England, USA (1902 - 1984)",
		"image": "/images/dirak.png",
		"text": "Paul Adrien Maurice Dirac had a severe father and was bizarrely taciturn (perhaps autistic), but became one of the greatest mathematical physicists ever. He developed Fermi-Dirac statistics, applied quantum theory to field theory, predicted the existence of magnetic monopoles, and was first to note that some quantum equations lead to inexplicable infinities. His most important contribution was to combine relativity and quantum mechanics by developing, with pure thought, the Dirac Equation. From this equation, Dirac deduced the existence of anti-electrons, a prediction considered so bizarre it was ignored -- until anti-electrons were discovered in a cloud chamber four years later. For this work he was awarded the Nobel Prize in Physics at age 31, making him one of the youngest Laureates ever. Dirac's mathematical formulations, including his Equation and the Dirac-von Neumann axioms, underpin all of modern particle physics. After his great discovery, Dirac continued to do important work, some of which underlies modern string theory. He was also adept at more practical physics; although he declined an invitation to work on the Manhattan Project, he did contribute a fundamental result in centrifuge theory to that Project. The Dirac Equation was one of the most important scientific discoveries of the 20th century and Dirac was certainly a superb mathematical genius. Like many of the other greatest mathematical physicists (Kepler, Einstein, Weyl), Dirac thought the true equations of physics must have beauty, writing \"... it is more important to have beauty in one's equations than to have them fit experiment ... [any discrepancy may] get cleared up with further development of the theory.\""
	},
	{
		"mathematicianID": "34",
		"name": "Alan Mathison Turing",
		"lived": "England (1912 - 1954)",
		"image": "/images/turing.png",
		"text": "Turing developed a new foundation for mathematics based on computation; he invented the abstract Turing machine, designed a \"universal\" version of such a machine, proved the famous Halting Theorem (related to Gödel's Incompleteness Theorem), and developed the concept of machine intelligence (including his famous Turing Test proposal). He also introduced the notions of definable number and oracle (important in modern computer science), and was an early pioneer in the study of neural networks. For this work he is called the Father of Computer Science and Artificial Intelligence. Turing also worked in group theory, numerical analysis, and complex analysis; he developed an important theorem about Riemann's zeta function; he had novel insights in quantum physics. During World War II he turned his talents to cryptology; his creative algorithms were considered possibly \"indispensable\" to the decryption of German Naval Enigma coding, which in turn is judged to have certainly shortened the War by at least two years. Although his clever code-breaking algorithms were his most spectacular contributions at Bletchley Park, he was also a key designer of the Bletchley \"Bombe\" computer. After the war he helped design other physical computers, as well as theoretical designs; and helped inspire von Neumann's later work. He (and earlier, von Neumann) wrote about the Quantum Zeno Effect which is sometimes called the Turing Paradox. He also studied the mathematics of biology, especially the Turing Patterns of morphogenesis which anticipated the discovery of BZ reactions. Turing's life ended tragically: charged with immorality and forced to undergo chemical castration, he apparently took his own life."
	},
	{
		"mathematicianID": "35",
		"name": "John Forbes Nash",
		"lived": "USA (1928 - 2015)",
		"image": "/images/nes.png",
		"text": "Nash was a lonely, tormented schizophrenic whose life was portrayed in the film Beautiful Mind. He achieved early fame with his work in game theory; this eventually led to the Nobel Prize in Economics. Earlier studies in game theory focused on the simplest cases (two-person zero-sum, or cooperative), but Nash demonstrated \"Nash equilibria\" for n-person or non-zero-sum non-cooperative games. He also excelled at several other fields of mathematics, especially topology, algebraic geometry, partial differential equations, elliptic functions, and the theory of manifolds (including singularity theory, the concept of real algebraic manifolds and isotropic embeddings). Nash proved theorems of great importance which had defeated all earlier attempts. His most famous theorems were the Nash Embedding Theorems, that any Riemannian manifold of dimension k can be embedded isometrically into some n-dimensional Euclidean space. Other important work was in partial differential equations where he proved that strong regularity constraints apply to solutions of the equations of heat and fluid flow."
	},
	{
		"mathematicianID": "36",
		"name": "Terence Chi-Shen Tao",
		"lived": "Australia, USA (1975 - )",
		"image": "/images/tao.png",
		"text": "Tao was a phenomenal child prodigy who has become perhaps the greatest living mathematician. He has made important contributions to partial differential equations, combinatorics, harmonic analysis, number theory, group theory, model theory, nonstandard analysis, random matrices, the geometry of 3-manifolds, functional analysis, ergodic theory, etc. and areas of applied math including quantum mechanics, general relativity, and image processing. He has been called the first since David Hilbert to be expert across the entire spectrum of mathematics. Among his earliest important discoveries were results about the multi-dimensional Kakeya needle problem, which led to advances in Fourier analysis and fractals. In addition to his numerous research papers he has written many highly regarded textbooks. One of his prize citations commends his \"sheer technical power, his other-worldly ingenuity for hitting upon new ideas, and a startlingly natural point of view. Much of Tao's work has been done in collaboration: with Van Vu he proved the circular law of random matrices; with Ben Green he proved the Dirac-Motzkin conjecture and solved the \"orchard-planting problem.\" Especially famous is the Green-Tao Theorem that there are arbitrarily long arithmetic series among the prime numbers (or indeed among any sufficiently dense subset of the primes). This confirmed an old conjecture by Lagrange, and was especially remarkable because the proof fused methods from number theory, ergodic theory, harmonic analysis, discrete geometry, and combinatorics."
	}
]}