{"mathematicians":[
	{
		"mathematicianID": "0",
		"name": "Thales of Miletus",
		"lived": "Greek domain (624 - 546 BC)",
		"image": "/images/thales.png",
		"text": "Thales was the Chief of the \"Seven Sages\" of ancient Greece and has been called the \"Father of Science\", the \"Founder of Abstract Geometry\" and the \"First Philosopher\". Thales is believed to have studied mathematics under Egyptians, who in turn were aware of much older mathematics from Mesopotamia. Thales may have invented the notion of compass-and-straightedge construction. Several fundamental theorems about triangles are attributed to Thales, including the law of similar triangles (which Thales used famously to calculate the height of the Great Pyramid) and \"Thales' Theorem\" itself: the fact that any angle inscribed in a semicircle is a right angle. The other \"theorems\" were probably more like well-known axioms, but Thales proved Thales' Theorem using two of his other theorems. It is said that Thales then sacrificed an ox to celebrate what might have been the first mathematical proof in Greece. Thales noted that, given a line segment of length x, a segment of length x/k can be constructed by first constructing a segment of length kx. Thales was also an astronomer. He invented the 365-day calendar, introduced the use of Ursa Minor for finding North, invented the gnomonic map projection, the first of many methods known today to map (part of) the surface of a sphere to a plane and he is the first person believed to have correctly predicted a solar eclipse. His theories of physics would seem quaint today, but he seems to have been the first to describe magnetism and static electricity. Aristotle said: \"To Thales the primary question was not what do we know, but how do we know it\". Thales was also a politician, ethicist, and military strategist. It is said he once leased all available olive presses after predicting a good olive season. He did this not for the wealth itself, but as a demonstration of the use of intelligence in business. Thales' writings have not survived and are known only second-hand. Since his famous theorems of geometry were probably already known in ancient Babylon, his importance derives from imparting the notions of mathematical proof and the scientific method to ancient Greeks. Thales' student and successor was Anaximander, who is often called the \"First Scientist\" instead of Thales. His theories were more firmly based on experimentation and logic, while Thales still relied on some animistic interpretations. Anaximander is famous for astronomy, cartography and sundials and also enunciated a theory of evolution, that land species somehow developed from primordial fish. Anaximander's most famous student, in turn, was Pythagoras. The methods of Thales and Pythagoras led to the schools of Plato and Euclid, an intellectual blossoming unequaled until Europe's Renaissance. "
	},
	{
		"mathematicianID": "1",
		"name": "Pythagoras of Samos",
		"lived": "Greek domain (578 - 505 BC)",
		"image": "/images/pitagora.png",
		"text": "Pythagoras, who is sometimes called the \"First Philosopher\", studied under Anaximander, Egyptians, Babylonians, and the mystic Pherekydes (from whom Pythagoras acquired a belief in reincarnation). He became the most influential of early Greek mathematicians. He is credited with being first to use axioms and deductive proofs, so his influence on Plato and Euclid may be enormous. Pythagoras is generally credited with much of Books I and II of Euclid's Elements. He and his students (the \"Pythagoreans\") were ascetic mystics for whom mathematics was partly a spiritual tool. Some occultists treat Pythagoras as a wizard and founding mystic philosopher. Pythagoras was very interested in astronomy and seems to have been the first man to realize that the Earth was a globe similar to the other planets. He and his followers began to study the question of planetary motions, which would not be resolved for more than two millenia. He believed thinking was located in the brain rather than heart. The words philosophy and mathematics are said to have been coined by Pythagoras.  Many results of the Pythagoreans were due to his students, none of their writings survive and what is known is reported second-hand and possibly exaggerated, by Plato and others. Some ideas attributed to him were probably first enunciated by successors like Parmenides of Elea (ca 515 - 440 BC). Archaeologists now believe that he was not first to invent the diatonic scale. Pythagoras' students included Hippasus of Metapontum, the famous anatomist and physician Alcmaeon, Milo of Croton, and Croton's daughter Theano (who may have been Pythagoras's wife). The term Pythagorean was also adopted by many disciples who lived later. These disciples include Philolaus of Croton, the natural philosopher Empedocles and several other famous Greeks. Pythagoras' successor was apparently Theano herself. The Pythagoreans were one of the few ancient schools to practice gender equality. Pythagoras discovered that harmonious intervals in music are based on simple rational numbers. This led to a fascination with integers and mystic numerology. He is sometimes called the \"Father of Numbers\" and once said \"Number rules the universe\". About the mathematical basis of music, Leibniz later wrote \"Music is the pleasure the human soul experiences from counting without being aware that it is counting\". Other mathematicians who investigated the arithmetic of music included Huygens, Euler and Simon Stevin. Given any numbers a and b the Pythagoreans were aware of the three distinct means: (a+b)/2 (arithmetic mean), √(ab) (geometric mean), and 2ab/(a+b) (harmonic mean). The Pythagorean Theorem was known long before Pythagoras, but he was often credited (before discovery of an ancient Chinese text) with the first proof. He may have discovered the simple parametric form of primitive Pythagorean triplets (xx-yy, 2xy, xx+yy), although the first explicit mention of this may be in Euclid's Elements. Other discoveries of the Pythagorean school include the construction of the regular pentagon, concepts of perfect and amicable numbers, polygonal numbers, golden ratio (attributed to Theano), three of the five regular solids (attributed to Pythagoras himself) and irrational numbers (attributed to Hippasus). It is said that the discovery of irrational numbers upset the Pythagoreans so much they tossed Hippasus into the ocean. Another version has Hippasus banished for revealing the secret for constructing the sphere which circumscribes a dodecahedron."
	},
	{
		"mathematicianID": "2",
		"name": "Hippocrates of Chios",
		"lived": "Greek domain (470 - 410 BC)",
		"image": "/images/hippocrates.png",
		"text": "Hippocrates (no known relation to Hippocrates of Cos, the famous physician) wrote his own Elements more than a century before Euclid. Only fragments survive but it apparently used axiomatic-based proofs similar to Euclid's and contains many of the same theorems. Hippocrates is said to have invented the reductio ad absurdem proof method. Hippocrates is most famous for his work on the three ancient geometric quandaries: his work on cube-doubling (the Delian Problem) laid the groundwork for successful efforts by Archytas and others and some claim Hippocrates was first to trisect the general angle. His circle quadrature was of course ultimately unsuccessful but he did prove ingenious theorems about \"lunes\" (crescent-shaped circle fragments). For example, the area of any right triangle is equal to the sum of the areas of the two lunes formed when semi-circles are drawn on each of the three edges of the triangle. Hippocrates also did work in algebra and rudimentary analysis. Doubling the cube and angle trisection are often called \"impossible\", but they are impossible only when restricted to collapsing compass and unmarkable straightedge. There are ingenious solutions available with other tools. Construction of the regular heptagon is another such task, with solutions published by Thabit, Alhazen, Vieta, Conway."
	},
	{
		"mathematicianID": "3",
		"name": "Aristotle of Stagira",
		"lived": "Macedonia (384 - 322 BC)",
		"image": "/images/aristotle.png",
		"text": "Aristotle is considered the greatest scientist of the ancient world and the most influential philosopher and logician ever. His science was a standard curriculum for almost 2000 years. Although the physical sciences couldn't advance until the discoveries by great men like Newton and Lavoisier, Aristotle's work in the biological sciences was superb and served as paradigm until modern times. Aristotle was personal tutor to the young Alexander the Great. Aristotle's writings on definitions, axioms and proofs may have influenced Euclid. He was also the first mathematician to write on the subject of infinity. His writings include geometric theorems, some with proofs different from Euclid's or missing from Euclid altogether. One of these (which is seen only in Aristotle's work prior to Apollonius) is that a circle is the locus of points whose distances from two given points are in constant ratio."
	},
	{
		"mathematicianID": "4",
		"name": "Euclid of Alexandria",
		"lived": "Greece/Egypt (322 - 275 BC)",
		"image": "/images/euclid.png",
		"text": "Euclid of Alexandria (not to be confused with Socrates' student, Euclid of Megara, who lived a century earlier), directed the school of mathematics at the great university of Alexandria. Little else is known for certain about his life, but several very important mathematical achievements are credited to him. He was the first to prove that there are infinitely many prime numbers. He stated and proved the Unique Factorization Theorem and he devised Euclid's algorithm for computing gcd. Euclid introduced the Mersenne primes and observed that Mp(Mp + 1)/2 is always perfect (in the sense of Pythagoras) if Mp is Mersenne. The converse, that any even perfect number has such a corresponding Mersenne prime, was tackled by Alhazen and proven by Euler. His books contain many famous theorems, though much of the Elements was due to predecessors like Pythagoras (most of Books I and II), Hippocrates (Book III), Theodorus, Eudoxus (Book V), Archytas (perhaps Book VIII) and Theaetetus. Book I starts with an elegant proof that rigid-compass constructions can be implemented with a collapsing compass. (Given A, B, C, find CF = AB by first constructing equilateral triangle ACD, then use the compass to find E on AD with AE = AB and finally find F on DC with DF = DE.) Although notions of trigonometry were not in use, Euclid's theorems include some closely related to the Laws of Sines and Cosines. Among several books attributed to Euclid are The Division of the Scale (a mathematical discussion of music), The Optics, The Catoptrics (a treatise on the theory of mirrors), a book on spherical geometry, a book on logic fallacies and his comprehensive math textbook The Elements. Several of his masterpieces have been lost, including works on conic sections and other advanced geometric topics. Apparently Desargues' Homology Theorem (a pair of triangles is coaxial if and only if it is copolar) was proved in one of these lost works. This is the fundamental theorem which initiated the study of projective geometry. The Elements introduced the notions of axiom and theorem, was used as a textbook for 2000 years and in fact is still the basis for high school geometry, making Euclid the leading mathematics teacher of all time. Some think his best inspiration was recognizing that the Parallel Postulate must be an axiom rather than a theorem. There are many famous quotations about Euclid and his books. Abraham Lincoln abandoned his law studies when he didn't know what \"demonstrate\" meant and \"went home to my father's house to read Euclid and stayed there till I could give any proposition in the six books of Euclid at sight. I then found out what demonstrate means, and went back to my law studies.\""
	},
	{
		"mathematicianID": "5",
		"name": "Archimedes of Syracuse",
		"lived": "Greek domain (287 - 212 BC)",
		"image": "/images/archimedes.png",
		"text": "Archimedes is universally acknowledged to be the greatest of ancient mathematicians. He studied at Euclid's school (probably after Euclid's death), but his work far surpassed and even leapfrogged, the works of Euclid. Some of Euclid's more difficult theorems are easy analytic consequences of Archimedes' Lemma of Centroids. His achievements are particularly impressive given the lack of good mathematical notation in his day. His proofs are noted not only for brilliance but for unequaled clarity. Archimedes made advances in number theory, algebra and analysis, but is most renowned for his many theorems of plane and solid geometry. He was first to prove Heron's formula for the area of a triangle. His excellent approximation to √3 indicates that he'd partially anticipated the method of continued fractions. He developed a recursive method of representing large integers and was first to note the law of exponents. He found a method to trisect an arbitrary angle (using a markable straightedge - the construction is impossible using strictly Platonic rules). One of his most remarkable and famous geometric results was determining the area of a parabolic section, for which he offered two independent proofs, one using his Principle of the Lever, the other using a geometric series. Some of Archimedes' work survives only because Thabit ibn Qurra translated the otherwise - lost Book of Lemmas. It contains the angle-trisection method and several ingenious theorems about inscribed circles. Thabit shows how to construct a regular heptagon. It may not be clear whether this came from Archimedes or was fashioned by Thabit by studying Archimedes' angle-trisection method. Other discoveries known only second-hand include the Archimedean semiregular solids reported by Pappus and the Broken-Chord Theorem reported by Alberuni. Archimedes and Newton might be the two best geometers ever, but although each produced ingenious geometric proofs, often they used non-rigorous calculus to discover results and then devised rigorous geometric proofs for publication. He used integral calculus to determine the centers of mass of hemisphere and cylindrical wedge and the volume of two cylinders' intersection. Although Archimedes didn't develop differentiation (integration's inverse), Michel Chasles credits him (along with Kepler, Cavalieri and Fermat, who all lived more than 18 centuries later) as one of the four who developed calculus before Newton and Leibniz. He was one of the greatest mechanists ever, laid a mathematical foundation for the principles of leverage, discovered the first law of hydrostatics and invented the compound pulley, the hydraulic screwpump (called Archimedes' screw), a miniature planetarium and war machines (catapult and ship-burning mirrors). Some of these inventions may predate Archimedes. On the other hand, some scholars attribute the Antikythera mechanism to Archimedes or his inspiration. His books include Floating Bodies, Spirals, The Sand Reckoner, Measurement of the Circle, Sphere and Cylinder, Plane Equilibriums, Conoids and Spheroids, Quadrature of Parabola, various now-lost works cited by Pappus or others, possibly The Book of Lemmas, and (discovered only recently, and often called his most important work) The Method. He developed the Stomachion puzzle (and solved a difficult enumeration problem involving it), other famous gems include The Cattle-Problem. The Book of Lemmas contains various geometric gems (\"the Salinon,\" \"the Shoemaker's Knife\", etc.) and is credited to Archimedes by Thabit ibn Qurra but the attribution is disputed."
	},
	{
		"mathematicianID": "6",
		"name": "Eratosthenes of Cyrene",
		"lived": "Greek domain (276 - 194 BC)",
		"image": "/images/eratosten.png",
		"text": "Eratosthenes was one of the greatest polymaths. He is called the Father of Geography, was Chief Librarian at Alexandria, was a poet, music theorist, astronomer (calculating the Earth's diameter, distance to the Sun), mechanical engineer (anticipating laws of elasticity) and was an outstanding mathematician. He is famous for his prime number Sieve, but more impressive was his work on the cube-doubling problem which he related to the design of siege weapons (catapults) where a cube-root calculation is needed. Eratosthenes had the nickname Beta. He was a master of several fields, but was only second-best of his time. His better was also his good friend, Archimedes of Syracuse dedicated The Method to Eratosthenes."
	},
	{
		"mathematicianID": "7",
		"name": "Ptolemaeus",
		"lived": "Egypt (90 - 168)",
		"image": "/images/ptolemy.png",
		"text": "Ptolemy, the Librarian of Alexandria, was one of the most famous of ancient Greek scientists. Among his mathematical results, most famous may be Ptolemy's Theorem (AC•BD = AB•CD + BC•AD if and only if ABCD is a cyclic quadrilateral). This theorem has many useful corollaries, it was frequently applied in Copernicus' work. Ptolemy also wrote on trigonometry, optics, geography, map projections, and astrology, but is most famous for his astronomy, where he perfected the geocentric model of planetary motions. Ptolemy wrote that the fixed point in a model of planetary motion was arbitrary, but rejected the Earth spinning on its axis since he thought this would lead to powerful winds."
	},
	{
		"mathematicianID": "8",
		"name": "Hypatia of Alexandria",
		"lived": "Egypt (350 - 415)",
		"image": "/images/hypatia.png",
		"text": "Born nearly 17 centuries ago, Hypatia of Alexandria was a brazen, highly intelligent woman who excelled in the fields of science, math and philosophy, which at the time (and for hundreds upon hundreds of years further) were seen squarely as the domain of men. Hypatia’s foremost teacher was her father, Theon Alexandricus, a mathematician and philosopher, who she would later go on to contribute to several mathematical works with. Hypatia herself was a teacher, as well as being the inventor of the hydrometer. Though she forged ahead in a time when women were all but ignored in the realm of mathematics, this bright Greek woman eventually met with a tragic death when her chariot was attacked and she was brutally murdered by a gang of Christians. Though her life was cut short, while she was alive, through her accomplishments, Hypatia was able lay the groundwork for future female pioneers of mathematics."
	},
	{
		"mathematicianID": "9",
		"name": "Aryabhata",
		"lived": "India (476 - 550)",
		"image": "/images/aryabhata.png",
		"text": "Indian mathematicians excelled for thousands of years and eventually even developed advanced techniques like Taylor series before Europeans did, but they are denied credit because of Western ascendancy. Among the Hindu mathematicians, Aryabhata (called Arjehir by Arabs) may be most famous. While Europe was in its early \"Dark Age\", Aryabhata advanced arithmetic, algebra, elementary analysis and especially plane and spherical trigonometry, using the decimal system. Aryabhata is sometimes called the \"Father of Algebra\" instead of al-Khowârizmi (who himself cites the work of Aryabhata). His most famous accomplishment in mathematics was the Aryabhata Algorithm (connected to continued fractions) for solving Diophantine equations. Aryabhata made several important discoveries in astronomy, the nature of moonlight and concept of sidereal year. His estimate of the Earth's circumference was more accurate than any achieved in ancient Greece. He was among the very few ancient scholars who realized the Earth rotated daily on an axis, claims that he also espoused heliocentric orbits are controversial, but may be confirmed by the writings of al-Biruni. Aryabhata is said to have introduced the constant e. He used π ≈ 3.1416. It is unclear whether he discovered this independently or borrowed it from Liu Hui of China. Although it was first discovered by Nicomachus three centuries earlier, Aryabhata is famous for the identity Σ (k3) = (Σ k)2. Some of Aryabhata's achievements, an excellent approximation to the sine function, are known only from the writings of Bhaskara I, who wrote: \"Aryabhata is the master who, after reaching the furthest shores and plumbing the inmost depths of the sea of ultimate knowledge of mathematics, kinematics and spherics, handed over the three sciences to the learned world\"."
	},
	{
		"mathematicianID": "10",
		"name": "Brahmagupta",
		"lived": "India (589 - 668)",
		"image": "/images/brahmagupta.png",
		"text": "No one person gets unique credit for the invention of the decimal system, but Brahmagupta's textbook Brahmasphutasiddhanta was very influential and is sometimes considered the first textbook \"to treat zero as a number in its own right\". It also treated negative numbers. Others claim these were first seen 800 years earlier in Chang Tshang's Chinese text and were implicit in what survives of earlier Hindu works, but Brahmagupta's text discussed them lucidly. Along with Diophantus, Brahmagupta was also among the first to express equations with symbols rather than words. Brahmagupta Bhillamalacarya (The Teacher from Bhillamala) made great advances in arithmetic, algebra, numeric analysis and geometry. Several theorems bear his name, including the formula for the area of a cyclic quadrilateral:  16 A2 = (a+b+c-d)(a+b-c+d)(a-b+c+d)(-a+b+c+d). Another famous Brahmagupta theorem dealing with such quadrilaterals can be phrased: \"In a circle, if the chords AB and CD are perpendicular and intersect at E, then the line from E which bisects AC will be perpendicular to BD\". He also began the study of rational quadrilaterals which Kummer would eventually complete. Proving Brahmagupta's theorems are good challenges even today. In addition to his famous writings on practical mathematics and his ingenious theorems of geometry, Brahmagupta solved the general quadratic equation and worked on number theory problems. He was first to find a general solution to the simplest Diophantine form. His work on Pell's equations has been called \"brilliant\" and \"marvelous\". Brahmagupta proved the Brahmagupta-Fibonacci Identity (the set of sums of two squares is closed under multiplication). He applied mathematics to astronomy, predicting eclipses, etc."
	},
	{
		"mathematicianID": "11",
		"name": "Al-Khowârizmi",
		"lived": "Iraq (780 - 850)",
		"image": "/images/alkhwarizmi.png",
		"text": "Al-Khowârizmi (aka Mahomet ibn Moses) was a Persian who worked as a mathematician, astronomer and geographer early in the Golden Age of Islamic science. He introduced the Hindu decimal system to the Islamic world and Europe, invented the horary quadrant, improved the sundial, developed trigonometry tables and improved on Ptolemy's astronomy and geography. He wrote the book Al-Jabr, which demonstrated algebra and geometry and several other influential books. Unlike Diophantus' work, which dealt in specific examples, Al-Khowârizmi was the first algebra text to present general methods. He is often called the Father of Algebra. (Diophantus used, however, superior syncopated notation). The word algorithm is borrowed from Al-Khowârizmi's name and algebra is taken from the name of his book. He also coined the word cipher, which became English zero (although this was just a translation from the Sanskrit word for zero introduced by Aryabhata). He was an essential pioneer for Islamic science and for the many mathematicians from Arabia and Persia who followed and hence also for Europe's eventual Renaissance which was heavily dependent on Islamic teachings. Al-Khowârizmi's texts on algebra and decimal arithmetic are considered to be among the most influential writings ever."
	},
	{
		"mathematicianID": "12",
		"name": "Leonardo (Fibonacci)",
		"lived": "Italy (1170 - 1245)",
		"image": "/images/leonardo.png",
		"text": "Leonardo (known today as Fibonacci) introduced the decimal system and other new methods of arithmetic to Europe and relayed the mathematics of the Hindus, Persians and Arabs. Others, especially Gherard of Cremona, had translated Islamic mathematics, the works of al-Khowârizmi, into Latin, but Leonardo was the influential teacher. He also re-introduced older Greek ideas like Mersenne numbers and Diophantine equations. Leonardo's writings cover a very broad range including new theorems of geometry, methods to construct and convert Egyptian fractions (which were still in wide use), irrational numbers, the Chinese Remainder Theorem, theorems about Pythagorean triplets and the series 1, 1, 2, 3, 5, 8, 13, .... which is now linked with the name Fibonacci. In addition to his great historic importance and fame (he was a favorite of Emperor Frederick II), Leonardo Fibonacci is called \"the greatest number theorist between Diophantus and Fermat\" and \"the most talented mathematician of the Middle Ages\". Leonardo is most famous for his book Liber Abaci, but his Liber Quadratorum provides the best demonstration of his skill. He defined congruums and proved theorems about them, including a theorem establishing the conditions for three square numbers to be in consecutive arithmetic series. This has been called the finest work in number theory prior to Fermat (although a similar statement was made about one of Bhaskara II's theorems). Although often overlooked, this work includes a proof of the n = 4 case of Fermat's Last Theorem. Leonardo's proof of FLT4 is widely ignored or considered incomplete. Another of Leonardo's noteworthy achievements was proving that the roots of a certain cubic equation could not have any of the constructible forms Euclid had outlined in Book 10 of his Elements. He also wrote on, but didn't prove, Wilson's Theorem. Leonardo provided Europe with the decimal system, algebra and the 'lattice' method of multiplication, all far superior to the methods then in use. He introduced notation like 3/5. His clever extension of this for quantities like 5 yards, 2 feet, and 3 inches is more efficient than today's notation. It seems hard to believe but before the decimal system, mathematicians had no notation for zero. Referring to this system, Gauss was later to exclaim \"To what heights would science now be raised if Archimedes had made that discovery\"."
	},
	{
		"mathematicianID": "13",
		"name": "Leonardo da Vinci",
		"lived": "Italy (1452 - 1519)",
		"image": "/images/davinci.png",
		"text": "Leonardo da Vinci is most renowned for his paintings, Mona Lisa and The Last Supper are among the most discussed and admired paintings ever, but he did much other work and was probably the most talented, versatile and prolific polymath ever to live. His writings exceed 13 000 folios. He developed new techniques and principles of perspective geometry for drawing, painting and sculpture. He was also an expert architect and engineer and surely the most prolific inventor of all time. Although most of his paper designs were never built, Leonardo's inventions include reflecting and refracting telescope, adding machine, parabolic compass, improved anemometer, parachute, helicopter, flying ornithopter, several war machines (multi-barreled gun, steam-driven cannon, tank, giant crossbow, finned mortar shells, portable bridge), pumps, an accurate spring-operated clock, bobbin winder, robots, scuba gear, an elaborate musical instrument he called the 'viola organista' and more. Some of his designs, including the viola organista and a large single-span bridge, were finally built five centuries later. Da Vinci developed the mechanical theory of the arch, made advances in anatomy, botany, and other fields of science. He was first to conceive of plate tectonics. Also, da Vinci was a poet and musician. He had little formal training in mathematics until he was in his mid-40's, when he and Luca Pacioli (the other great Italian mathematician of that era) began tutoring each other. Despite this slow start, he did make novel achievements in mathematics. He was first to note the simple classification of symmetry groups on the plane, achieved interesting bisections and mensurations and developed an approximate solution to the circle-squaring problem. He was first to discover the 60-vertex shape now called \"buckyball\"."
	},
	{
		"mathematicianID": "14",
		"name": "Nicolaus Copernicus",
		"lived": "Poland (1472 - 1543)",
		"image": "/images/kopernikus.png",
		"text": "The European Renaissance developed in 15th-century Italy, with the blossoming of great art and as scholars read books by great Islamic scientists like Alhazen. The earliest of these great Italian polymaths were largely not noted for mathematics and Leonardo da Vinci began serious math study only very late in life, so the best candidates for mathematical greatness in the Italian Renaissance were foreigners. Along with Regiomontanus from Bavaria, there was an even more famous man from Poland. Nicolaus Copernicus (Mikolaj Kopernik) was a polymath. He studied law and medicine, published poetry, contemplated astronomy worked professionally as a church scholar and diplomat and was also a painter. He studied Islamic works on astronomy and geometry at the University of Bologna and eventually wrote a book of great impact. Although his only famous theorem of mathematics (that certain trochoids are straight lines) may have been derived from Oresme's work or copied from Nasir al-Tusi, it was mathematical thought that led Copernicus to the conclusion that the Earth rotates around the Sun. Despite opposition from the Roman church, this discovery led, via Galileo, Kepler and Newton, to the Scientific Revolution. Until the Protestant Reformation, which began about the time of Copernicus' discovery, European scientists were reluctant to challenge the Catholic Church and its belief in geocentrism. Copernicus' book was published only posthumously. It remains controversial whether earlier Islamic or Hindu mathematicians (or even Archimedes with his The Sand Reckoner) believed in heliocentrism, but were also inhibited by religious orthodoxy."
	},
	{
		"mathematicianID": "15",
		"name": "Girolamo Cardano",
		"lived": "Italy (1501 - 1576)",
		"image": "/images/cardano.png",
		"text": "Girolamo Cardano (or Jerome Cardan) was a highly respected physician and was first to describe typhoid fever. He was also an accomplished gambler and chess player and wrote an early book on probability. He was also a remarkable inventor. The combination lock, an advanced gimbal, a ciphering tool and the Cardan shaft with universal joints are all his inventions and are in use to this day. The U-joint is sometimes called the Cardan joint. He also helped develop the camera obscura. Cardano made contributions to physics, he noted that projectile trajectories are parabolas, and may have been first to note the impossibility of perpetual motion machines. He did work in philosophy, geology, hydrodynamics, music, wrote books on medicine and an encyclopedia of natural science. But Cardano is most remembered for his achievements in mathematics. He was first to publish general solutions to cubic and quartic equations and first to publish the use of complex numbers in calculations. Cardano's Italian colleagues deserve much credit. Ferrari first solved the quartic, he or Tartaglia the cubic and Bombelli first treated the complex numbers as numbers in their own right. Cardano may have been the last great mathematician unwilling to deal with negative numbers. His treatment of cubic equations had to deal with ax3 - bx + c = 0 and ax3 - bx = c as two different cases. Cardano introduced binomial coefficients and the Binomial Theorem and introduced and solved the geometric hypocyloid problem, as well as other geometric theorems (the theorem underlying the 2:1 spur wheel which converts circular to reciprocal rectilinear motion). Cardano is credited with Cardano's Ring Puzzle, still manufactured today and related to the Tower of Hanoi puzzle. (This puzzle may predate Cardano, and may even have been known in ancient China). Da Vinci and Galileo may have been more influential than Cardano, but of the three great generalists in the century before Kepler, it seems clear that Cardano was the most accomplished mathematician."
	},
	{
		"mathematicianID": "16",
		"name": "Rafael Bombelli",
		"lived": "Italy (1526 - 1572)",
		"image": "/images/bombeli.png",
		"text": "Bombelli was a talented engineer who wrote an algebra textbook sometimes considered one of the foremost achievements of the 16th century. Although incorporating work by Cardano, Diophantus and possibly Omar al-Khayyám, the textbook was highly original and extremely influential. Leibniz and Huygens were among many who praised his work. Although noted for his new ideas of arithmetic, Bombelli based much of his work on geometric ideas and even pursued complex-number arithmetic to an angle-trisection method. In his textbook he introduced new symbolic notations, gave a new square-root procedure based on continued fractions, allowed negative and complex numbers and gave the rules for manipulating these new kinds of numbers. Bombelli is often called the Inventor of Complex Numbers."
	},
	{
		"mathematicianID": "17",
		"name": "François Viète",
		"lived": "France (1540 - 1603)",
		"image": "/images/viete.png",
		"text": "François Viète (or Franciscus Vieta) was a French nobleman and lawyer who was a favorite of King Henry IV and eventually became a royal privy councillor. In one notable accomplishment he broke the Spanish diplomatic code, allowing the French government to read Spain's messages and publish a secret Spanish letter. This apparently led to the end of the Huguenot Wars of Religion. More importantly, Vieta was certainly the best French mathematician prior to Descartes and Fermat. He laid the groundwork for modern mathematics. His works were the primary teaching for both Descartes and Fermat. Isaac Newton also studied Vieta. In his role as a young tutor Vieta used decimal numbers before they were popularized by Simon Stevin and may have guessed that planetary orbits were ellipses before Kepler. Vieta did work in geometry, reconstructing and publishing proofs for Apollonius' lost theorems, including all ten cases of the general Problem of Apollonius. Vieta also used his new algebraic techniques to construct a regular heptagon. He discovered several trigonometric identities including a generalization of Ptolemy's Formula, the latter (then called prosthaphaeresis) providing a calculation shortcut similar to logarithms in that multiplication is reduced to addition (or exponentiation reduced to multiplication). Vieta also used trigonometry to find real solutions to cubic equations for which the Italian methods had required complex-number arithmetic. He also used trigonometry to solve a particular 45th-degree equation that had been posed as a challenge. Such trigonometric formulae revolutionized calculations and may even have helped stimulate the development and use of logarithms by Napier and Kepler. He developed the first infinite-product formula for π. In addition to his geometry and trigonometry, he also found results in number theory, but Vieta is most famous for his systematic use of decimal notation and variable letters, for which he is sometimes called the \"Father of Modern Algebra\". Vieta used A,E,I,O,U for unknowns and consonants for parameters. It was Descartes who first used X,Y,Z for unknowns and A,B,C for parameters. In his works, Vieta emphasized the relationships between algebraic expressions and geometric constructions. One key insight he had is that addends must be homogeneous (i.e. \"apples shouldn't be added to oranges\"), a seemingly trivial idea but which can aid intuition even today."
	},
	{
		"mathematicianID": "18",
		"name": "Simon Stevin",
		"lived": "Holland (1549 - 1620)",
		"image": "/images/stevin.png",
		"text": "Stevin was one of the greatest practical scientists of the Late Middle Ages. He worked with Holland's dykes and windmills. As a military engineer he developed fortifications and systems of flooding and invented a carriage with sails that traveled faster than with horses and used it to entertain his patron, the Prince of Orange. He discovered several laws of mechanics including those for energy conservation and hydrostatic pressure. He lived slightly before Galileo who is now much more famous, but Stevin discovered the equal rate of falling bodies before Galileo did and correctly explained the influence of the moon on tides (which Galileo later got wrong). He was first to write on the concept of unstable equilibrium. He invented improved accounting methods and (though also invented at about the same time by Chinese mathematician Zhu Zaiyu and anticipated by Galileo's father, Vincenzo Galilei) the equal-temperament music scale. He also did work in descriptive geometry, trigonometry, optics, geography and astronomy. In mathematics, Stevin is best known for the notion of real numbers (previously integers, rationals and irrationals were treated separately, negative numbers and even zero and one were often not considered numbers). He introduced (a clumsy form of) decimal fractions to Europe, suggested a decimal metric system, which was finally adopted 200 years later and invented other basic notation like the symbol √. Stevin proved several theorems about perspective geometry, an important result in mechanics and special cases of the Intermediate Value Theorem later attributed to Bolzano and Cauchy. Stevin's books, written in Dutch rather than Latin, were widely read and hugely influential. He was a very key figure in the development of modern European mathematics."
	},
	{
		"mathematicianID": "19",
		"name": "John Napier",
		"lived": "Scotland (1550 - 1617)",
		"image": "/images/napier.png",
		"text": "Napier was a Scottish Laird who was a noted theologian and thought by many to be a magician (his nickname was Marvellous Merchiston). Today, however, he is best known for his work with logarithms, a word he invented. Several others, including Archimedes, had anticipated the use of logarithms. He published the first large table of logarithms and also helped popularize usage of the decimal point and lattice multiplication. He invented Napier's Bones, a crude hand calculator which could be used for division and root extraction, as well as multiplication. He also had inventions outside mathematics, especially several different kinds of war machine. Napier's noted textbooks also contain an exposition of spherical trigonometry. Although he was certainly very clever and had novel mathematical insights not mentioned in this summary, Napier proved no deep theorem. Nevertheless, his revolutionary methods of arithmetic had immense historical importance. His tables were used by Johannes Kepler himself and led to the Scientific Revolution."
	},
	{
		"mathematicianID": "20",
		"name": "Galileo Galilei",
		"lived": "Italy (1564 - 1642)",
		"image": "/images/galileo.png",
		"text": "Galileo discovered the laws of inertia including rudimentary forms of all three of Newton's laws of motion, falling bodies including parabolic trajectories and the pendulum. He also introduced the notion of relativity which later physicists found so fruitful. Although he admired Galileo greatly, Einstein's famous result was somewhat misnamed. It depended on the absoluteness, not relativity, of the speed of light. Galileo discovered important priciples of dynamics and may have been first to note that a larger body has less relative cohesive strength than a smaller body. He was a great inventor. In addition to being first to conceive of the pendulum clock, he developed a new type of pump and the best telescope, thermometer, hydrostatic balance and cannon sector of his day. As a famous astronomer, Galileo pointed out that Jupiter's Moons, which he discovered, provide a natural clock and allow a universal time to be determined by telescope anywhere on Earth. This was of little use in ocean navigation since a ship's rocking prevents the required delicate observations. His astronomical discoveries also included sunspots and lunar craters. His discovery that Venus, like the Moon, had phases was the critical fact which forced acceptance of Copernican heliocentrism. Galileo's contributions outside physics and astronomy were also enormous. He invented the compound microscope and made early discoveries with it. He also made very important contributions to the early development of biology; but perhaps Galileo's most important contribution was to postulate universal laws of mechanics, in contrast to Aristotelian and religious notions of separate laws for heaven and earth. Galileo is often called the \"Father of Modern Science\" because of his emphasis on experimentation. He understood that results needed to be repeated and averaged (he minimized mean absolute-error for his curve-fitting criterion, two centuries before Gauss and Legendre introduced the mean squared-error criterion). For his experimental methods and discoveries, his laws of motion, and for (eventually) helping to spread Copernicus' heliocentrism, Galileo may have been the most influential scientist ever. Despite his extreme importance to mathematical physics, Galileo doesn't usually appear on lists of greatest mathematicians. However, Galileo did do work in pure mathematics. He derived certain centroids and the parabolic shape of trajectories using a rudimentary calculus before Cavalieri did and named (may have been first to discover) the cycloid curve. Moreover, Galileo was one of the first to write about infinite equinumerosity (the \"Hilbert's Hotel Paradox\"). Galileo once wrote \"Mathematics is the language in which God has written the universe\"."
	},
	{
		"mathematicianID": "21",
		"name": "Johannes Kepler",
		"lived": "Germany (1571 - 1630)",
		"image": "/images/kepler.png",
		"text": "Kepler was interested in astronomy from an early age, studied to become a Lutheran minister, became a professor of mathematics instead. Then Tycho Brahe's understudy and on Brahe's death, was appointed Imperial Mathematician at the age of twenty-nine. His observations of the planets with Brahe, along with his study of Apollonius' 1800-year old work, led to Kepler's three Laws of Planetary Motion, which in turn led directly to Newton's Laws of Motion. Beyond his discovery of these Laws (one of the most important achievements in all of science), Kepler is also sometimes called the \"Founder of Modern Optics\". He furthered the theory of the camera obscura and was first to study the operation of the human eye, telescopes built from two convex lenses and atmospheric refraction. Kepler developed a rudimentary notion of universal gravitation and applied it to explain tides correctly. However he seems not to have noticed that his empirical laws implied inverse-square gravitation. Galileo dismissed Kepler's tides and elliptical orbits and later published his own incorrect explanation of tides. According to Kepler's Laws, the planets move at variable speed along ellipses. Even Copernicus thought the orbits could be described with only circles. The Earth-bound observer is himself describing such an orbit and in almost the same plane as the planets. Thus discovering the Laws would be a difficult challenge even for someone armed with computers and modern mathematics. The very famous Kepler Equation relating a planet's eccentric and anomaly is just one tool Kepler needed to develop. Kepler understood the importance of his remarkable discovery, even if contemporaries like Galileo did not, writing: \"I give myself up to divine ecstasy ... My book is written. It will be read either by my contemporaries or by posterity — I care not which. It may well wait a hundred years for a reader, as God has waited 6 000 years for someone to understand His work\". Kepler also once wrote \"Mathematics is the archetype of the beautiful\". Besides the trigonometric results needed to discover his Laws, Kepler made other contributions to mathematics. He generalized Alhazen's Billiard Problem, developing the notion of curvature. He was first to notice that the set of Platonic regular solids was incomplete if concave solids are admitted and first to prove that there were only 13 Archimedean solids. He proved theorems of solid geometry later discovered on the famous palimpsest of Archimedes. He rediscovered the Fibonacci series, applied it to botany and noted that the ratio of Fibonacci numbers converges to the Golden Mean. He was a key early pioneer in calculus and embraced the concept of continuity, which others avoided due to Zeno's paradoxes. His work was a direct inspiration for Cavalieri and others. He developed the theory of logarithms and improved on Napier's tables. He developed mensuration methods and anticipated Fermat's theorem (df(x)/dx = 0 at function extrema). Kepler once had an opportunity to buy wine, which merchants measured using a shortcut. With the famous Kepler's Wine Barrel Problem, he used his rudimentary calculus to deduce which barrel shape would be the best bargain. Kepler reasoned that the structure of snowflakes was evidence for the then-novel atomic theory of matter. He noted that the obvious packing of cannonballs gave maximum density (this became known as Kepler's Conjecture, optimality was proved among regular packings by Gauss, but it wasn't until 1998 that the possibility of denser irregular packings was disproven). In addition to his physics and mathematics, Kepler wrote a science fiction novel and was an astrologer and mystic. He had ideas similar to Pythagoras about numbers ruling the cosmos (writing that the purpose of studying the world \"should be to discover the rational order and harmony which has been imposed on it by God and which He revealed to us in the language of mathematics\"). Kepler's mystic beliefs even led to his own mother being imprisoned for witchcraft."
	},
	{
		"mathematicianID": "22",
		"name": "René Descartes",
		"lived": "France (1596 - 1650)",
		"image": "/images/dekart.png",
		"text": "Descartes' early career was that of soldier-adventurer and he finished as tutor to royalty, but in between he achieved fame as the preeminent intellectual of his day. He is considered the inventor of both analytic geometry and symbolic algebraic notation and is therefore called the \"Father of Modern Mathematics\". His use of equations to partially solve the geometric Problem of Pappus revolutionized mathematics. Because of his famous philosophical writings \"Cogito ergo sum\" he is considered, along with Aristotle, to be one of the most influential thinkers in history. His famous mathematical theorems include the Rule of Signs (for determining the signs of polynomial roots), the elegant formula relating the radii of Soddy kissing circles, his theorem on total angular defect (an early form of the Gauss-Bonnet result so key to much mathematics) and an improved solution to the Delian problem (cube-doubling). While studying lens refraction, he invented the Ovals of Descartes. He improved mathematical notation (the use of superscripts to denote exponents). He also discovered Euler's Polyhedral Theorem, F+V = E+2. Descartes was very influential in physics and biology as well, developing laws of motion which included a \"vortex\" theory of gravitation, but most of his scientific work outside mathematics was eventually found to be incorrect. Descartes has an extremely high reputation and would be ranked even higher by many list makers, but whatever his historical importance his mathematical skill was not in the top rank. Some of his work was borrowed from others. He had only insulting things to say about Pascal and Fermat, each of whom was much more brilliant at mathematics than Descartes. Some even suspect that Descartes arranged the destruction of Pascal's lost Essay on Conics. Descartes made numerous errors in his development of physics, perhaps even delaying science, with Huygens writing \"in all of Descartes' physics, I find almost nothing to which I can subscribe as being correct\". Even the historical importance of his mathematics may be somewhat exaggerated since others, Fermat, Wallis and Cavalieri, were making similar discoveries independently."
	},
	{
		"mathematicianID": "23",
		"name": "Cavalieri",
		"lived": "Italy (1598 - 1647)",
		"image": "/images/cavalieri.png",
		"text": "Francesco Bonaventura de Cavalieri worked in analysis, geometry and trigonometry (discovering a formula for the area of a spherical triangle), but is most famous for publishing works on his \"principle of indivisibles\" (calculus). These were very influential and inspired further development by Huygens, Wallis and Barrow. His calculus was partly anticipated by Galileo, Kepler and Luca Valerio and developed independently, though left unpublished, by Fermat. Cavalieri also worked in theology, astronomy, mechanics and optics. He was an inventor and published logarithm tables. He wrote several books, the first one developing the properties of mirrors shaped as conic sections. His name is especially remembered for Cavalieri's Principle of Solid Geometry. Galileo said of Cavalieri, \"Few, if any, since Archimedes, have delved as far and as deep into the science of geometry\"."
	},
	{
		"mathematicianID": "24",
		"name": "Pierre de Fermat",
		"lived": "France (1601 - 1665)",
		"image": "/images/fermat.png",
		"text": "Pierre de Fermat was the most brilliant mathematician of his era and along with Descartes one of the most influential. Although mathematics was just his hobby (Fermat was a government lawyer), Fermat practically founded Number Theory and also played key roles in the discoveries of Analytic Geometry and Calculus. Lagrange considered Fermat, rather than Newton or Leibniz, to be the inventor of calculus. Fermat was first to study certain interesting curves, the \"Witch of Agnesi\". He was also an excellent geometer (discovering a triangle's Fermat point), and discovered probability theory in collaboration with Blaise Pascal. Fellow geniuses are the best judges of genius, and Blaise Pascal had this to say of Fermat: \"For my part, I confess that Fermat's researches about numbers are far beyond me and I am competent only to admire them\". E.T. Bell wrote: \"It can be argued that Fermat was at least Newton's equal as a pure mathematician\". Fermat's most famous discoveries in number theory include the ubiquitously-used Fermat's Little Theorem, the n = 4 case of his conjectured Fermat's Last Theorem (he may have proved the n = 3 case as well) and Fermat's Christmas Theorem that any prime (4n+1) can be represented as the sum of two squares in exactly one way, which may be considered the most difficult theorem of arithmetic which had been proved up to that date. Fermat proved the Christmas Theorem with difficulty using \"infinite descent\", but details are unrecorded, so the theorem is often named the Fermat-Euler Prime Number Theorem, with the first published proof being by Euler more than a century after Fermat's claim. Another famous conjecture by Fermat is that every natural number is the sum of three triangle numbers or more generally the sum of k k-gonal numbers. As with his \"Last Theorem\" he claimed to have a proof but didn't write it up. This theorem was eventually proved by Lagrange for k=4, the very young Gauss for k=3, and Cauchy for general k. Diophantus claimed the k=4 case but any proof has been lost. Fermat's conjectures were impressive even if unproven and that this great mathematician is often underrated. Recall that his so-called \"Last Theorem\" was actually just a private scribble. Fermat developed a system of analytic geometry which both preceded and surpassed that of Descartes. He developed methods of differential and integral calculus which Newton acknowledged as an inspiration. Solving   df(x)/dx = 0   to find extrema of f(x) is perhaps the most useful idea in applied mathematics, this technique originated with Fermat. Fermat was also the first European to find the integration formula for the general polynomial, he used his calculus to find centers of gravity. Fermat's contemporaneous rival René Descartes is more famous than Fermat and Descartes' writings were more influential. Whatever one thinks of Descartes as a philosopher, however, it seems clear that Fermat was the better mathematician. Fermat and Descartes did work in physics and independently discovered the (trigonometric) law of refraction, but Fermat gave the correct explanation and used it remarkably to anticipate the Principle of Least Action later enunciated by Maupertuis (though Maupertuis himself, like Descartes, had an incorrect explanation of refraction). Fermat and Descartes independently discovered analytic geometry, but it was Fermat who extended it to more than two dimensions and followed up by developing elementary calculus."
	},
	{
		"mathematicianID": "25",
		"name": "Evangelista Torricelli",
		"lived": "Italy (1608 - 1647)",
		"image": "/images/toriceli.png",
		"text": "Torricelli was a disciple of Galileo and succeeded him as grand-ducal mathematician of Tuscany. He was first to understand that a barometer measures atmospheric weight and used this insight to invent the mercury barometer and to create a sustained vacuum (then thought impossible). He was a skilled craftsman who built the best telescopes and microscopes of his day. As mathematical physicist, he extended Galileo's results, was first to explain winds correctly and discovered several key principles including Torricelli's Law (water drains through a small hole with rate proportional to the square root of water depth). In mathematics, he applied Cavalieri's methods to solve difficult mensuration problems, he also wrote on possible pitfalls in applying the new calculus. He discovered Gabriel's Horn with infinite surface area but finite volume. This \"paradoxical\" result provoked much discussion at the time. He also solved a problem due to Fermat by locating the isogonic center of a triangle. Torricelli was a significant influence on the early scientific revolution. Had he lived longer or published more, he would surely have become one of the greatest mathematicians of his era."
	},
	{
		"mathematicianID": "26",
		"name": "John Brehaut Wallis",
		"lived": "England (1616 - 1703)",
		"image": "/images/wallis.png",
		"text": "Wallis began his life as a savant at arithmetic (it is said he once calculated the square root of a 53-digit number to help him sleep and remembered the result in the morning), a medical student (he may have contributed to the concept of blood circulation) and theologian, but went on to become perhaps the most brilliant and influential English mathematician before Newton. He made major advances in analytic geometry, but also contributions to algebra, geometry and trigonometry. Unlike his contemporary, Huygens who took inspiration from Euclid's rigorous geometry, Wallis embraced the new analytic methods of Descartes and Fermat. He is especially famous for using negative and fractional exponents (though Oresme had introduced fractional exponents three centuries earlier), taking the areas of curves, and treating inelastic collisions (he and Huygens were first to develop the law of momentum conservation). He was the first European to solve Pell's Equation. Like Vieta, Wallis was a code-breaker, helping the Commonwealth side (though he later petitioned against the beheading of King Charles I). He was the first great mathematician to consider complex numbers legitimate and first to use the symbol ∞. Wallis coined several terms including continued fraction, induction, interpolation, mantissa and hypergeometric series."
	},
	{
		"mathematicianID": "27",
		"name": "Blaise Pascal",
		"lived": "France (1623 - 1662)",
		"image": "/images/pascal.png",
		"text": "Pascal was an outstanding genius who studied geometry as a child. At the age of sixteen he stated and proved Pascal's Theorem, a fact relating any six points on any conic section. The Theorem is sometimes called the \"Cat's Cradle\" or the \"Mystic Hexagram\". Pascal followed up this result by showing that each of Apollonius' famous theorems about conic sections was a corollary of the Mystic Hexagram, along with Gérard Desargues (1591-1661), he was a key pioneer of projective geometry. He also made important early contributions to calculus, indeed it was his writings that inspired Leibniz. Returning to geometry late in life, Pascal advanced the theory of the cycloid. In addition to his work in geometry and calculus, he founded probability theory and made contributions to axiomatic theory. His name is associated with the Pascal's Triangle of combinatorics and Pascal's Wager in theology. Like most of the greatest mathematicians, Pascal was interested in physics and mechanics, studying fluids, explaining vacuum and inventing the syringe and hydraulic press. At the age of eighteen he designed and built the world's first automatic adding machine. Although he continued to refine this invention, it was never a commercial success. He suffered poor health throughout his life, abandoned mathematics for religion at about age 23, wrote the philosophical treatise Pensées \"We arrive at truth, not by reason only, but also by the heart\" and died at an early age. Many think that had he devoted more years to mathematics, Pascal would have been one of the greatest mathematicians ever."
	},
	{
		"mathematicianID": "28",
		"name": "Christiaan Huygens",
		"lived": "Holland (1629 - 1695)",
		"image": "/images/hajgens.png",
		"text": "Christiaan Huygens (or Hugens, Huyghens) was second only to Newton as the greatest mechanist of his era. Although an excellent mathematician, he is much more famous for his physical theories and inventions. He developed laws of motion before Newton, including the inverse-square law of gravitation, centripetal force and treatment of solid bodies rather than point approximations. He and Wallis were first to state the law of momentum conservation correctly. He advanced the wave \"undulatory\" theory of light, a key concept being Huygen's Principle, that each point on a wave front acts as a new source of radiation. His optical discoveries include explanations for polarization and phenomena like haloes. Because of Newton's high reputation and corpuscular theory of light, Huygens' superior wave theory was largely ignored until the 19th-century work of Young, Fresnel and Maxwell. Later, Planck, Einstein and Bohr, partly anticipated by Hamilton, developed the modern notion of wave-particle duality. Huygens is famous for his inventions of clocks and lenses. He invented the escapement and other mechanisms, leading to the first reliable pendulum clock. He built the first balance spring watch, which he presented to his patron, King Louis XIV of France. Huygens was first to give the correct \"equation of time\" relating sundial time to absolute time. He invented superior lens grinding techniques, the achromatic eye-piece and the best telescope of his day. He was himself a famous astronomer, he discovered Titan and was first to properly describe Saturn's rings and the Orion Nebula. He also designed, but never built, an internal combustion engine. He promoted the use of an equal-tempered 31-tone music scale to avoid the tuning errors in Stevin's 12-tone scale, a 31-tone organ was in use in Holland as late as the 20th century. Huygens was an excellent card player, billiard player, horse rider and wrote a book speculating about extra-terrestrial life. As a mathematician, Huygens did brilliant work in analysis. His calculus, along with that of Wallis, is considered the best prior to Newton and Leibniz. He also did brilliant work in geometry, proving theorems about conic sections, the cycloid and the catenary. He was first to show that the cycloid solves the tautochrone problem, he used this fact to design pendulum clocks that would be more accurate than ordinary pendulum clocks. Huygens was first to find the flaw in Saint-Vincent's then-famous circle-squaring method and solved some related quadrature problems. He introduced the concepts of evolute and involute. His friendships with Descartes, Pascal, Mersenne and others helped inspire his mathematics. Huygens in turn was inspirational to the next generation. At Pascal's urging, Huygens published the first real textbook on probability theory, he also became the first practicing actuary. Huygens had tremendous creativity, historical importance and depth and breadth of genius, both in physics and mathematics. He also was important for serving as tutor to the otherwise self-taught Gottfried Leibniz (who'd \"wasted his youth\" without learning any math). Before agreeing to tutor him, Huygens tested the 25-year old Leibniz by asking him to sum the reciprocals of the triangle numbers."
	},
	{
		"mathematicianID": "29",
		"name": "Isaac Newton",
		"lived": "England (1642 - 1727)",
		"image": "/images/newton.png",
		"text": "Newton was an industrious lad who built marvelous toys (a model windmill powered by a mouse on treadmill). At about age 22, on leave from University, this genius began revolutionary advances in mathematics, optics, dynamics, thermodynamics, acoustics and celestial mechanics. He is famous for his Three Laws of Motion (inertia, force and reciprocal action) but, as Newton himself acknowledged, these Laws weren't fully novel. Hipparchus, Ibn al-Haytham, Descartes, Galileo and Huygens had all developed much basic mechanics already and Newton credits the First Law to Aristotle. However, Newton was apparently the first person to conclude that the ordinary gravity we observe on Earth is the very same force that keeps the planets in orbit. His Law of Universal Gravitation was revolutionary and due to Newton alone. Christiaan Huygens, the other great mechanist of the era, had independently deduced that Kepler's laws imply inverse-square gravitation, but he considered the action at a distance in Newton's theory to be \"absurd\". Newton published the Cooling Law of thermodynamics. He also made contributions to chemistry and was the important early advocate of the atomic theory. His writings also made important contributions to the general scientific method. His other intellectual interests included theology and mysticism. He studied ancient Greek writers like Pythagoras, Democritus, Lucretius, Plato and claimed that the ancients knew much, including the law of gravitation. Newton's greatness is indicated by the huge range of his physics. Even without his Laws of Motion, Gravitation and Cooling, he'd be famous just for his revolutionary work in optics, where he explained diffraction, observed that white light is a mixture of all the rainbow's colors, noted that purple is created by combining red and blue light and, starting from that observation, was first to conceive of a color hue \"wheel\". Newton almost anticipated Einstein's mass-energy equivalence, writing \"Gross Bodies and Light are convertible into one another... (Nature) seems delighted with Transmutations.\" Newton's earliest fame came when he designed the first reflecting telescope. By avoiding chromatic aberration, these were the best telescopes of that era. He also designed the first reflecting microscope and the sextant. Although others also developed the techniques independently, Newton is regarded as the \"Father of Calculus\" (which he called \"fluxions\"). He shares credit with Leibniz for the Fundamental Theorem of Calculus (that integration and differentiation are each other's inverse operation). He applied calculus for several purposes: finding areas, tangents, the lengths of curves and the maxima and minima of functions. Although Descartes is renowned as the inventor of analytic geometry, he and followers like Wallis were reluctant even to use negative coordinates, so one historian declares Newton to be \"the first to work boldly with algebraic equations\". In addition to several other important advances in analytic geometry, his mathematical works include the Binomial Theorem, his eponymous interpolation method, the idea of polar coordinates and power series for exponential and trigonometric functions. His equation   ex = ∑ xk / k!   has been called the \"most important series in mathematics\". Newton contributed to algebra and the theory of equations, was first to state Bézout's Theorem and he generalized Descartes' rule of signs. The generalized rule of signs was incomplete and finally resolved two centuries later by Sturm and Sylvester. He developed a series for the arcsin function and facts about cubic equations (just as the \"shadows of a cone\" yield all quadratic curves, Newton found a curve whose \"shadows\" yield all cubic curves). He proved, using a purely geometric argument of awesome ingenuity, that same-mass spheres (or hollowed spheres) of any radius have equal gravitational attraction. This fact is key to celestial motions. He also proved that objects inside a hollowed sphere experience zero net attraction. He discovered Puiseux series almost two centuries before they were re-invented by Puiseux. Like some of the greatest ancient mathematicians, Newton took the time to compute an approximation to π. His was better than Vieta's, though still not as accurate as al-Kashi's."
	},
	{
		"mathematicianID": "30",
		"name": "Wilhelm von Leibniz",
		"lived": "Germany (1646 - 1716)",
		"image": "/images/leibniz2.png",
		"text": "Leibniz was one of the most brilliant and prolific intellectuals ever and his influence in mathematics (especially his co-invention of the infinitesimal calculus) was immense. His childhood IQ has been estimated as second-highest in all of history, behind only Goethe's. Descriptions which have been applied to Leibniz include \"one of the two greatest universal geniuses\" (da Vinci was the other), \"the most important logician between Aristotle and Boole\" and the \"Father of Applied Science\". Leibniz described himself as \"the most teachable of mortals\". Mathematics was just a self-taught sideline for Leibniz, who was a philosopher, lawyer, historian, diplomat and renowned inventor. He predicted the Earth's molten core, introduced the notion of subconscious mind and built the first calculator that could do multiplication. Leibniz also had political influence, he consulted to both the Holy Roman and Russian Emperors. Another of his patrons was Sophia Wittelsbach (Electress of Hanover), who was only distantly in line for the British throne, but was made Heir Presumptive. Sophia died before Queen Anne, but her son was crowned King George I of England. Leibniz pioneered the common discourse of mathematics, including its continuous, discrete and symbolic aspects. His ideas on symbolic logic weren't pursued and it was left to Boole to reinvent this almost two centuries later. Mathematical innovations attributed to Leibniz include the notations ∫f(x)dx, df(x)/dx and even the use of a•b (instead of a X b) for multiplication, the concepts of matrix determinant and Gaussian elimination, the theory of geometric envelopes and the binary number system. He worked in number theory, conjecturing Wilson's Theorem. He invented more mathematical terms than anyone, including function, analysis situ, variable, abscissa, parameter and coordinate. He also coined the word transcendental, proving that sin() was not an algebraic function. His works seem to anticipate cybernetics and information theory and Mandelbrot acknowledged Leibniz' anticipation of self-similarity. Like Newton, Leibniz discovered The Fundamental Theorem of Calculus, his contribution to calculus was much more influential than Newton's and his superior notation is used to this day. As Leibniz himself pointed out, since the concept of mathematical analysis was already known to ancient Greeks, the revolutionary invention was the notation (\"calculus\"), because with \"symbols (which) express the exact nature of a thing briefly ... the labor of thought is wonderfully diminished\". Leibniz' thoughts on mathematical physics had some influence. He was one of the first to articulate the law of energy conservation and developed laws of motion that gave different insights from those of Newton. His cosmology was opposed to that of Newton but, anticipating theories of Mach and Einstein, is more in accord with modern physics. Mathematical physicists influenced by Leibniz include not only Mach, but perhaps Hamilton and Poincaré themselves. Although others found it independently (including perhaps Madhava three centuries earlier), Leibniz discovered and proved a striking identity for π: π/4 = 1 - 1/3 + 1/5 - 1/7 + 1/9 - ..."
	},
	{
		"mathematicianID": "31",
		"name": "Jacob Bernoulli",
		"lived": "Switzerland (1654 - 1705)",
		"image": "/images/bernuli.png",
		"text": "Jacob Bernoulli studied the works of Wallis and Barrow. He and Leibniz became friends and tutored each other. Jacob developed important methods for integral and differential equations, coining the word integral. He and his brother Johann were the key pioneers in mathematics during the generations between the era of Newton-Leibniz and the rise of Leonhard Euler. Jacob liked to pose and solve physical optimization problems. His \"catenary\" problem (what shape does a clothesline take?) became more famous than the \"tautochrone\" solved by Huygens. Perhaps the most famous of such problems was the brachistochrone, wherein Jacob recognized Newton's \"lion's paw\", and about which Johann Bernoulli wrote: \"You will be petrified with astonishment (that) this same cycloid, the tautochrone of Huygens, is the brachistochrone we are seeking\". Jacob did significant work outside calculus. In fact his most famous work was the Art of Conjecture, a textbook on probability and combinatorics which proves the Law of Large Numbers, the Power Series Equation and introduces the Bernoulli numbers. He is credited with the invention of polar coordinates (though Newton and Alberuni had also discovered them). Jacob also did outstanding work in geometry, for example constructing perpendicular lines which quadrisect a triangle."
	},
	{
		"mathematicianID": "32",
		"name": "Abraham De Moivre",
		"lived": "France (1667 - 1754)",
		"image": "/images/demoivre.png",
		"text": "De Moivre was an important pioneer of analytic geometry and, especially, probability theory. He and Laplace may be regarded as the two most important early developers of probability theory. In probability theory he developed actuarial science, posed interesting problems (about derangements), discovered the normal and Poisson distributions and proposed (but didn't prove) the Central Limit Theorem. He was first to discover a closed-form formula for the Fibonacci numbers and he developed an early version of Stirling's approximation to n!. He discovered De Moivre's Theorem: (cos x + i sin x)n = cos nx + i sin nx. He was a close friend and muse of Isaac Newton, who allegedly told people who asked about Principia: \"Go to Mr. De Moivre, he knows these things better than I do.\""
	},
	{
		"mathematicianID": "33",
		"name": "Brook Taylor",
		"lived": "England (1685 - 1731)",
		"image": "/images/taylor.png",
		"text": "Brook Taylor invented integration by parts, developed what is now called the calculus of finite differences, developed a new method to compute logarithms, made several other key discoveries of analysis and did significant work in mathematical physics. His love of music and painting may have motivated some of his mathematics. He studied vibrating strings and also wrote an important treatise on perspective in drawing which helped develop the fields of both projective and descriptive geometry. His work in projective geometry rediscovered Desargues' Theorem, introduced terms like vanishing point and influenced Lambert. Taylor was one of the few mathematicians of the Bernoulli era who was equal to them in genius, but his work was much less influential. Today he is most remembered for Taylor Series and the associated Taylor's Theorem, but he shouldn't get full credit for this. The method had been anticipated by earlier mathematicians including Gregory, Leibniz, Newton and, even earlier, Madhava and was not fully appreciated until the work of Maclaurin and Lagrange."
	},
	{
		"mathematicianID": "34",
		"name": "Colin Maclaurin",
		"lived": "Scotland (1698 - 1746)",
		"image": "/images/maclaurin.png",
		"text": "Maclaurin received a University degree in divinity at age 14, with a treatise on gravitation. He became one of the most brilliant mathematicians of his era. He wrote extensively on Newton's method of fluxions and the theory of equations, advancing these fields. He worked in optics and other areas of mathematical physics, but is most noted for his work in geometry. Lagrange said Maclaurin's geometry was as beautiful and ingenious as anything by Archimedes. Clairaut, seeing Maclaurin's methods, decided that he too would prove theorems with geometry rather than analysis. Maclaurin did important work on ellipsoids, for his work on tides he shared the Paris Prize with Euler and Daniel Bernoulli. As Scotland's top genius, he was called upon for practical work, including politics. Although Maclaurin's work was quite influential, his influence didn't really match his outstanding brilliance. He failed to adopt Leibnizian calculus with which great progress was being made on the Continent and much of his best work was published posthumously. Many of his famous results duplicated work by others. Maclaurin's Series was just a form of Taylor's series, the Euler-Maclaurin Summation Formula was also discovered by Euler and he discovered the Newton-Cotes Integration Formula after Cotes did. His brilliant results in geometry included the construction of a conic from five points, but Braikenridge made the same discovery and published before Maclaurin did. He discovered the Maclaurin-Cauchy Test for Integral Convergence before Cauchy did. He was first to discover Cramer's Paradox, as Cramer himself acknowledged. Colin Maclaurin found a simpler and more powerful proof of the fact that the cycloid solves the famous brachistochrone problem."
	},
	{
		"mathematicianID": "35",
		"name": "Leonhard Euler",
		"lived": "Switzerland (1707 - 1783)",
		"image": "/images/ojler.png",
		"text": "Euler may be the most influential mathematician who ever lived (though some would make him second to Euclid). His colleagues called him Analysis Incarnate. Laplace, famous for denying credit to fellow mathematicians, once said: \"Read Euler, he is our master in everything\". His notations and methods in many areas are in use to this day. Euler was the most prolific mathematician in history and is often judged to be the best algorist of all time.  Just as Archimedes extended Euclid's geometry to marvelous heights, so Euler took marvelous advantage of the analysis of Newton and Leibniz. He also gave the world modern trigonometry, pioneered (along with Lagrange) the calculus of variations, generalized and proved the Newton-Giraud formulae and made important contributions to algebra, his study of hypergeometric series. He was also supreme at discrete mathematics, inventing graph theory. He also invented the concept of generating functions, for example, letting p(n) denote the number of partitions of n, Euler found the lovely equation: Σn p(n) xn = 1 / Πk (1 - xk). The denominator of the right side here expands to a series whose exponents all have the (3m2+m)/2 pentagonal number form. Euler found an ingenious proof of this. Euler was a very major figure in number theory. He proved that the sum of the reciprocals of primes less than x is approx. (ln ln x), invented the totient function and used it to generalize Fermat's Little Theorem, found both the largest then-known prime and the largest then-known perfect number, proved e to be irrational, discovered (though without complete proof) a broad class of transcendental numbers, proved that all even perfect numbers must have the Mersenne number form that Euclid had discovered 2000 years earlier and much more. Euler was also first to prove several interesting theorems of geometry, including facts about the 9-point Feuerbach circle, relationships among a triangle's altitudes, medians and circumscribing and inscribing circles, the famous Intersecting Chords Theorem and an expression for a tetrahedron's volume in terms of its edge lengths. Euler was first to explore topology, proving theorems about the Euler characteristic, and the famous Euler's Polyhedral Theorem, F+V = E+2 (although it may have been discovered by Descartes and first proved rigorously by Jordan). Although noted as the first great pure mathematician, Euler's pump and turbine equations revolutionized the design of pumps, he also made important contributions to music theory, acoustics, optics, celestial motions, fluid dynamics and mechanics. He extended Newton's Laws of Motion to rotating rigid bodies and developed the Euler-Bernoulli beam equation. On a lighter note, Euler constructed a particularly magical magic square. Euler combined his brilliance with phenomenal concentration. He developed the first method to estimate the Moon's orbit (the three-body problem which had stumped Newton) and he settled an arithmetic dispute involving 50 terms in a long convergent series. Both these feats were accomplished when he was totally blind. About this he said: \"Now I will have less distraction\". François Arago said that Euler calculated without apparent effort, as men breathe, or as eagles sustain themselves in the wind. Four of the most important constant symbols in mathematics (π, e, i = √-1, and γ = 0.57721566...) were all introduced or popularized by Euler, along with operators like Σ. He did important work with Riemann's zeta function  ζ(s) = ∑ k-s  (although it was not then known by that name). He anticipated the concept of analytic continuation by showing ζ(-1) = 1+2+3+4+... = -1/12. As a young student of the Bernoulli family, Euler discovered the striking identity  ζ(2) = π2/6.  This catapulted Euler to instant fame, since the left-side infinite sum (1 + 1/4 + 1/9 + 1/16 + ...) was a famous problem of the time. Among many other famous and important identities, Euler proved the Pentagonal Number Theorem alluded to above (a beautiful result which has inspired a variety of discoveries), and the Euler Product Formula   ζ(s) = ∏(1-p-s)-1  where the right-side product is taken over all primes p. His most famous identity (which Richard Feynman called an almost astounding ... jewel) unifies the trigonometric and exponential functions   eix = cos x + i sin x. It is almost wondrous how the particular instance eiπ+1 = 0 combines the most important constants and operators together. Some of Euler's greatest formulae can be combined into curious-looking formulae for π:  π2  =  - log2(-1)  =  6 ∏p∈Prime(1-p-2)-1/2."
	},
	{
		"mathematicianID": "36",
		"name": "Alexis Claude Clairaut",
		"lived": "France (1713 - 1765)",
		"image": "/images/klero.png",
		"text": "The reputations of Euler and the Bernoullis are so high that it is easy to overlook that others in that epoch made essential contributions to mathematical physics. Euler made errors in his development of physics, in some cases because of a Europeanist rejection of Newton's theories in favor of the contradictory theories of Descartes and Leibniz. The Frenchmen Clairaut and d'Alembert were two other great and influential mathematicians of the mid-18th century. Alexis Clairaut was extremely precocious, delivering a math paper at age 13 and becoming the youngest person ever elected to the Paris Academy of Sciences. He developed the concept of skew curves (the earliest precursor of spatial curvature), he made very significant contributions in differential equations and mathematical physics. Clairaut supported Newton against the Continental schools and helped translate Newton's work into French. The theories of Newton and Descartes gave different predictions for the shape of the Earth (whether the poles were flattened or pointy). Clairaut participated in Maupertuis' expedition to Lappland to measure the polar regions. Measurements at high latitudes showed the poles to be flattened, Newton was right. Clairaut worked on the theories of ellipsoids and the three-body problem, Moon's orbit. That orbit was the major mathematical challenge of the day and there was great difficulty reconciling theory and observation. It was Clairaut who finally resolved this, by approaching the problem with more rigor than others. When Euler finally understood Clairaut's solution he called it \"the most important and profound discovery that has ever been made in mathematics\". Later, when Halley's Comet reappeared as he had predicted, Clairaut was acclaimed as \"the new Thales\"."
	},
	{
		"mathematicianID": "37",
		"name": "Jean d'Alembert",
		"lived": "France (1717 - 1783)",
		"image": "/images/dalamber.png",
		"text": "During the century after Newton, the Laws of Motion needed to be clarified and augmented with mathematical techniques. Jean-Baptiste le Rond d'Alembert, named after the Parisian church where he was abandoned as a baby, played a very key role in that development. His D'Alembert's Principle clarified Newton's Third Law and allowed problems in dynamics to be expressed with simple partial differential equations. His Method of Characteristics then reduced those equations to ordinary differential equations. To solve the resultant linear systems, he effectively invented the method of eigenvalues. He also anticipated the Cauchy-Riemann Equations. These are the same techniques in use for many problems in physics to this day. D'Alembert was also a forerunner in functions of a complex variable and the notions of infinitesimals and limits. With his treatises on dynamics, elastic collisions, hydrodynamics, cause of winds, vibrating strings, celestial motions, refraction, etc., the young Jean le Rond easily surpassed the efforts of his older rival, Daniel Bernoulli. He may have been first to speak of time as a \"fourth dimension\". Rivalry with the Swiss mathematicians led to d'Alembert's sometimes being unfairly ridiculed, although it does seem true that d'Alembert had very incorrect notions of probability. D'Alembert was first to prove that every polynomial has a complex root, this is now called the Fundamental Theorem of Algebra. In France this Theorem is called the D'Alembert-Gauss Theorem. Although Gauss was first to provide a fully rigorous proof, d'Alembert's proof preceded and was more nearly complete than, the attempted proof by Euler-Lagrange. He also did creative work in geometry (anticipating Monge's Three Circle Theorem) and was principal creator of the major encyclopedia of his day. D'Alembert wrote: \"The imagination in a mathematician who creates makes no less difference than in a poet who invents\"."
	},
	{
		"mathematicianID": "38",
		"name": "Joseph-Loui Lagrange",
		"lived": "France (1736 - 1813)",
		"image": "/images/lagrange.png",
		"text": "Joseph-Louis Lagrange (born Giuseppe Lodovico Lagrangia) was a brilliant man who advanced to become a teen-age Professor shortly after first studying mathematics. He excelled in all fields of analysis and number theory and made key contributions to the theories of determinants, continued fractions and many other fields. He developed partial differential equations far beyond those of D. Bernoulli and d'Alembert, developed the calculus of variations far beyond that of the Bernoullis, discovered the Laplace transform before Laplace did and developed terminology and notation (the use of f'(x) and f''(x) for a function's 1st and 2nd derivatives). He proved a fundamental Theorem of Group Theory. He laid the foundations for the theory of polynomial equations which Cauchy, Abel, Galois and Poincaré would later complete. Number theory was almost just a diversion for Lagrange, whose focus was analysis. Nevertheless, he was the master of that field as well, proving difficult and historic theorems including Wilson's Theorem (p divides (p-1)! + 1 when p is prime), Lagrange's Four-Square Theorem (every positive integer is the sum of four squares) and that n•x2 + 1 = y2 has solutions for every positive non-square integer n. Lagrange's many contributions to physics include understanding of vibrations (he found an error in Newton's work and published the definitive treatise on sound), celestial mechanics (including an explanation of why the Moon keeps the same face pointed towards the Earth), the Principle of Least Action (which Hamilton compared to poetry) and the discovery of the Lagrangian points (in Jupiter's orbit). Lagrange's textbooks were noted for clarity and inspired most of the 19th-century mathematicians on this list. Unlike Newton, who used calculus to derive his results but then worked backwards to create geometric proofs for publication, Lagrange relied only on analysis. \"No diagrams will be found in this work\" he wrote in the preface to his masterpiece Mécanique analytique. Lagrange once wrote: \"As long as algebra and geometry have been separated, their progress have been slow and their uses limited, but when these two sciences have been united, they have lent each mutual forces and have marched together towards perfection\". Both W.W.R. Ball and E.T. Bell, renowned mathematical historians, bypass Euler to name Lagrange as \"the Greatest Mathematician of the 18th Century\". Jacobi bypassed Newton and Gauss to call Lagrange \"perhaps the greatest mathematical genius since Archimedes\"."
	},
	{
		"mathematicianID": "39",
		"name": "Pierre-Simon Laplace",
		"lived": "France (1749 - 1827)",
		"image": "/images/laplace.png",
		"text": "Laplace was the preeminent mathematical astronomer and is often called the \"French Newton\". His masterpiece was Mecanique Celeste which redeveloped and improved Newton's work on planetary motions using calculus. While Newton had shown that the two-body gravitation problem led to orbits which were ellipses (or other conic sections), Laplace was more interested in the much more difficult problems involving three or more bodies. Would Jupiter's pull on Saturn eventually propel Saturn into a closer orbit or was Saturn's orbit stable for eternity? Laplace's equations had the optimistic outcome that the solar system was stable. Laplace advanced the nebular hypothesis of solar system origin and was first to conceive of black holes. He also conceived of multiple galaxies, but this was Lambert's idea first. He explained the so-called secular acceleration of the Moon. Today we know Laplace's theories do not fully explain the Moon's path, nor guarantee orbit stability. His other accomplishments in physics include theories about the speed of sound and surface tension. He worked closely with Lavoisier, helping to discover the elemental composition of water and the natures of combustion, respiration and heat itself. Laplace may have been first to note that the laws of mechanics are the same with time's arrow reversed. He was noted for his strong belief in determinism, famously replying to Napoleon's question about God with: \"I have no need of that hypothesis\". Laplace viewed mathematics as just a tool for developing his physical theories. Nevertheless, he made many important mathematical discoveries and inventions (although the Laplace Transform itself was already known to Lagrange). He was the premier expert at differential and difference equations and definite integrals. He developed spherical harmonics, potential theory and the theory of determinants, anticipated Fourier's series and advanced Euler's technique of generating functions. In the fields of probability and statistics he made key advances. He proved the Law of Least Squares and introduced the controversial \"Bayesian\" rule of succession. In the theory of equations, he was first to prove that any polynomial of even degree must have a real quadratic factor."
	},
	{
		"mathematicianID": "40",
		"name": "Adrien Marie Legendre",
		"lived": "France (1752 - 1833)",
		"image": "/images/legendre.png",
		"text": "Legendre was an outstanding mathematician who did important work in plane and solid geometry, spherical trigonometry, celestial mechanics and other areas of physics and especially elliptic integrals and number theory. He found key results in the theories of sums of squares and sums of k-gonal numbers. For example, he showed that all integers except 4k(8m+7) can be expressed as the sum of three squares. He also made key contributions in several areas of analysis and invented the Legendre transform and Legendre polynomials, the notation for partial derivatives is due to him. He invented the Legendre symbol, invented the study of zonal harmonics, proved that π2 was irrational (the irrationality of π had already been proved by Lambert) and wrote important textbooks in several fields. Although he never accepted non-Euclidean geometry and had spent much time trying to prove the Parallel Postulate, his inspiring geometry text remained a standard until the 20th century. As one of France's premier mathematicians, Legendre did other significant work, promoting the careers of Lagrange and Laplace, developing trig tables, geodesic projects, etc. There are several important theorems proposed by Legendre for which he is denied credit, either because his proof was incomplete or was preceded by another's. He proposed the famous theorem about primes in a progression which was proved by Dirichlet, proved and used the Law of Least Squares which Gauss had left unpublished. He proved the N=5 case of Fermat's Last Theorem which is credited to Dirichlet, proposed the famous Prime Number Theorem which was finally proved by Hadamard, improved the Fermat-Cauchy result about sums of k-gonal numbers but this topic wasn't fruitful and developed various techniques commonly credited to Laplace. His two most famous theorems of number theory, the Law of Quadratic Reciprocity and the Three Squares Theorem (a difficult extension of Lagrange's Four Squares Theorem), were each enhanced by Gauss a few years after Legendre's work. Legendre also proved an early version of Bonnet's Theorem. Legendre's work in the theory of equations and elliptic integrals directly inspired the achievements of Galois and Abel (which then obsoleted much of Legendre's own work). Chebyshev's work also built on Legendre's foundations."
	},
	{
		"mathematicianID": "41",
		"name": "Joseph Fourier",
		"lived": "France (1768 - 1830)",
		"image": "/images/furije.png",
		"text": "Jean Baptiste Joseph Fourier had a varied career. Precocious but mischievous orphan, theology student, young professor of mathematics (advancing the theory of equations), then revolutionary activist. Under Napoleon he was a brilliant and important teacher and historian, accompanied the French Emperor to Egypt and did excellent service as district governor of Grenoble. In his spare time at Grenoble he continued the work in mathematics and physics that led to his immortality. After the fall of Napoleon, Fourier exiled himself to England, but returned to France when offered an important academic position and published his revolutionary treatise on the Theory of Heat. Fourier anticipated linear programming, developing the simplex method and Fourier-Motzkin Elimination and did significant work in operator theory. He is also noted for the notion of dimensional analysis, was first to describe the Greenhouse Effect and continued his earlier brilliant work with equations. Fourier's greatest fame rests on his use of trigonometric series (now called Fourier series) in the solution of differential equations. Since \"Fourier\" analysis is in extremely common use among applied mathematicians, he joins the select company of the eponyms of \"Cartesian\" coordinates, \"Gaussian\" curve and \"Boolean\" algebra. Fourier's solution to the heat equation was counterintuitive (heat transfer doesn't seem to involve the oscillations fundamental to trigonometric functions). The brilliance of Fourier's imagination is indicated in that the solution had been rejected by Lagrange himself. Although rigorous Fourier Theorems were finally proved only by Dirichlet, Riemann and Lebesgue, it has been said that it was Fourier's \"very disregard for rigor\" that led to his great achievement, which Lord Kelvin compared to poetry."
	},
	{
		"mathematicianID": "42",
		"name": "Carl Friedrich Gauss",
		"lived": "Germany (1777 - 1855)",
		"image": "/images/cfgaus.png",
		"text": "Johann Carl Friedrich Gauss, the Prince of Mathematics, exhibited his calculative powers when he corrected his father's arithmetic before the age of three. His revolutionary nature was demonstrated at age twelve, when he began questioning the axioms of Euclid. His genius was confirmed at the age of nineteen when he proved that the regular n-gon was constructible if and only if it is the product of distinct prime Fermat numbers. Also at age 19, he proved Fermat's conjecture that every number is the sum of three triangle numbers. He further determined the number of distinct ways such a sum could be formed. At age 24 he published Disquisitiones Arithmeticae, probably the greatest book of pure mathematics ever. Although he published fewer papers than some other great mathematicians, Gauss may be the greatest theorem prover ever. Several important theorems and lemmas bear his name. He extended Euclid's Fundamental Theorem of Arithmetic (prime factorization is unique) to the Gaussian complex integers and he was first to produce a rigorous proof of the Fundamental Theorem of Algebra that an n-th degree polynomial has n complex roots. Gauss himself used Fundamental Theorem to refer to Euler's Law of Quadratic Reciprocity and provided eight distinct proofs for it over the years. Gauss proved the n=3 case of Fermat's Last Theorem for Eisenstein integers (the triangular lattice-points on the complex plane). Though more general, Gauss' proof was simpler than the real integer proof and this simplification method revolutionized algebra. Other work by Gauss led to fundamental theorems in statistics, vector analysis, function theory and generalizations of the Fundamental Theorem of Calculus.   Gauss built the theory of complex numbers into its modern form, including the notion of monogenic functions which are now ubiquitous in mathematical physics. Constructing the regular 17-gon as a teenager was actually an exercise in complex-number algebra, not geometry. Gauss developed the arithmetic of congruences and became the premier number theoretician of all time. Other contributions of Gauss include hypergeometric series, foundations of statistics and differential geometry. He proved a surprising fundamental theorem about the curvature of manifolds. He also did important work in geometry, providing an improved solution to Apollonius' famous problem of tangent circles, stating and proving the Fundamental Theorem of Normal Axonometry and solving astronomical problems related to comet orbits and navigation by the stars. Ceres, the first asteroid, was discovered when Gauss was a young man, but only a few observations were made before it disappeared into the Sun's brightness. Could its orbit be predicted well enough to rediscover it on re-emergence? Laplace, one of the most respected mathematicians of the time, declared it impossible. Gauss became famous when he used an 8th-degree polynomial equation to successfully predict Ceres' orbit. Gauss also did important work in several areas of physics, developed an important modification to Mercator's map projection, invented the heliotrope and co-invented the telegraph."
	},
	{
		"mathematicianID": "43",
		"name": "Siméon Denis Poisson",
		"lived": "France (1781 - 1840)",
		"image": "/images/poason.png",
		"text": "Siméon Poisson was a protégé of Laplace and, like his mentor, is among the greatest applied mathematicians ever. Poisson was an extremely prolific researcher and also an excellent teacher. In addition to important advances in several areas of physics, Poisson made key contributions to Fourier analysis, definite integrals, path integrals, statistics, partial differential equations, calculus of variations and other fields of mathematics. Dozens of discoveries are named after Poisson, for example, the Poisson summation formula which has applications in analysis, number theory, lattice theory, etc. He was first to note the paradoxical properties of the Cauchy distribution. He made improvements to Lagrange's equations of celestial motions, which Lagrange himself found inspirational. Another of Poisson's contributions to mathematical physics was his conclusion that the wave theory of light implies a bright Arago spot at the center of certain shadows. Poisson used this paradoxical result to argue that the wave theory was false, but instead the Arago spot, hitherto hardly noticed, was observed experimentally. Poisson once said: \"Life is good for only two things, discovering mathematics and teaching mathematics\"."
	},
	{
		"mathematicianID": "44",
		"name": "Bernard Bolzano",
		"lived": "Bohemia (1781 - 1848)",
		"image": "/images/bolzano.png",
		"text": "Bolzano was an ordained Catholic priest, a religious philosopher and focused his mathematical attention on fields like metalogic, writing: \"I prized only ... mathematics which was ... philosophy\". Still he made several important mathematical discoveries ahead of his time. His liberal religious philosophy upset the Imperial rulers, he was charged with heresy, placed under house arrest and his writings censored. This censorship meant that many of his great discoveries turned up only posthumously and were first rediscovered by others. He was noted for advocating great rigor and is appreciated for developing the (ε, δ) approach for rigorous proofs in analysis. This work inspired the great Weierstrass. Bolzano gave the first analytic proof of the Fundamental Theorem of Algebra, the first rigorous proof that continuous functions achieve any intermediate value (Bolzano's Theorem, rediscovered by Cauchy), the first proof that a bounded sequence of reals has a convergent subsequence (Bolzano-Weierstrass theorem). He was first to describe a nowhere-differentiable continuous function and anticipated Cantor's discovery of the distinction between denumerable and non-denumerable infinities. If he had focused on mathematics and published more, he might be considered one of the most important mathematicians of his era."
	},
	{
		"mathematicianID": "45",
		"name": "Augustin-Louis Cauchy",
		"lived": "France (1789 - 1857)",
		"image": "/images/kosi.png",
		"text": "Cauchy was extraordinarily prodigious, prolific and inventive. Home-schooled, he awed famous mathematicians at an early age. In contrast to Gauss and Newton, he was almost over-eager to publish. In his day his fame surpassed that of Gauss and has continued to grow. Cauchy did significant work in analysis, algebra, number theory and discrete topology. His most important contributions included convergence criteria for infinite series, the \"theory of substitutions\" (permutation group theory) and especially his insistence on rigorous proofs. Cauchy's research also included differential equations, determinants and probability. He invented the calculus of residues, rediscovered Bolzano's Theorem and much more. Although he was one of the first great mathematicians to focus on abstract mathematics (another was Euler), he also made important contributions to mathematical physics, the theory of elasticity. Cauchy's theorem of solid geometry is important in rigidity theory. The Cauchy-Schwarz Inequality has very wide application (as the basis for Heisenberg's Uncertainty Principle), several important lemmas of analysis are due to Cauchy, the famous Burnside's Counting Theorem was first discovered by Cauchy, etc. He was first to prove Taylor's Theorem rigorously and first to prove Fermat's conjecture that every positive integer can be expressed as the sum of k k-gonal numbers for any k. Gauss had proved the case k = 3. One of the duties of a great mathematician is to nurture his successors, but Cauchy selfishly dropped the ball on both of the two greatest young mathematicians of his day, mislaying key manuscripts of both Abel and Galois. Cauchy is credited with group theory, yet it was Galois who invented this first, abstracting it far more than Cauchy did, some of this in a work which Cauchy \"mislaid\". For this historical miscontribution perhaps Cauchy should be demoted."
	},
	{
		"mathematicianID": "46",
		"name": "Nicolai Lobachevsky",
		"lived": "Russia (1793 - 1856)",
		"image": "/images/lobacevski.png",
		"text": "Nicolai Ivanovitch Lobachevsky is famous for discovering non-Euclidean geometry. He did not regard this new geometry as simply a theoretical curiosity, writing: \"There is no branch of mathematics ... which may not someday be applied to the phenomena of the real world\". He also worked in several branches of analysis and physics, anticipated the modern definition of function and may have been first to explicitly note the distinction between continuous and differentiable curves. He also discovered the important Dandelin-Gräffe method of polynomial roots independently of Dandelin and Gräffe. In his lifetime, Lobachevsky was under-appreciated and over-worked, his duties led him to learn architecture and even some medicine. Although Gauss and János Bolyai (Hungarian mathematician) discovered non-Euclidean geometry independently about the same time as Lobachevsky, it is worth noting that both of them had strong praise for Lobachevsky's genius. His particular significance was in daring to reject a 2100-year old axiom, thus William K. Clifford called Lobachevsky \"the Copernicus of Geometry\"."
	},
	{
		"mathematicianID": "47",
		"name": "Mikhail Ostrogradsky",
		"lived": "Ukraine (1801 - 1862)",
		"image": "/images/ostrogradski.png",
		"text": "Ostrogradsky is considered to be one of the leading mathematicians of Imperial Russia. From 1816 to 1820, he studied under Timofei Osipovsky (1765–1832) and graduated from the University of Kharkiv. When Osipovsky was suspended on religious grounds in 1820, Ostrogradsky refused to be examined and he never received his Ph.D. degree. From 1822 to 1826, he studied at the Sorbonne and at the Collège de France in Paris, France. In 1828, he returned to the Russian Empire and settled in Saint Petersburg, where he was elected a member of the Academy of Sciences. He also became a professor of the Main military engineering School of the Russian Empire. He worked mainly in the mathematical fields of calculus of variations, integration of algebraic functions, number theory, algebra, geometry, probability theory and in the fields of applied mathematics, mathematical physics and classical mechanics. In the latter, his key contributions are in the motion of an elastic body and the development of methods for integration of the equations of dynamics and fluid power, following up on the works of Euler, Joseph Louis Lagrange, Siméon Denis Poisson and Augustin Louis Cauchy. In 1826, Ostrogradsky gave the first general proof of the divergence theorem, which was discovered by Lagrange in 1762."
	},
	{
		"mathematicianID": "48",
		"name": "Niels Henrik Abel",
		"lived": "Norway (1802 - 1829)",
		"image": "/images/abel.png",
		"text": "At an early age, Niels Abel studied the works of the greatest mathematicians, found flaws in their proofs and resolved to reprove some of these theorems rigorously. He was the first to fully prove the general case of Newton's Binomial Theorem, one of the most widely applied theorems in mathematics. Several important theorems of analysis are named after Abel, including the (deceptively simple) Abel's Theorem of Convergence (published posthumously). Along with Galois, Abel is considered one of the two founders of group theory. Abel also made contributions in algebraic geometry and the theory of equations. Inversion (replacing y = f(x) with x = f-1(y)) is a key idea in mathematics (consider Newton's Fundamental Theorem of Calculus). Abel developed this insight. Legendre had spent much of his life studying elliptic integrals, but Abel inverted these to get elliptic functions and was first to observe (but in a manuscript mislaid by Cauchy) that they were doubly periodic. Elliptic functions quickly became a productive field of mathematics and led to more general complex-variable functions, which were important to the development of both abstract and applied mathematics. Finding the roots of polynomials is a key mathematical problem, the general solution of the quadratic equation was known by ancients. The discovery of general methods for solving polynomials of degree three and four is usually treated as the major math achievement of the 16th century, so for over two centuries an algebraic solution for the general 5th-degree polynomial (quintic) was a Holy Grail sought by most of the greatest mathematicians. Abel proved that most quintics did not have such solutions. This discovery, at the age of only nineteen, would have quickly awed the world, but Abel was impoverished, had few contacts and spoke no German. When Gauss received Abel's manuscript he discarded it unread, assuming the unfamiliar author was just another crackpot trying to square the circle or some such. His genius was too great for him to be ignored long, but, still impoverished, Abel died of tuberculosis at the age of twenty-six. His fame lives on and even the lower-case word 'abelian' is applied to several concepts. Liouville said that Abel was the greatest genius he ever met. Hermite said: \"Abel has left mathematicians enough to keep them busy for 500 years\"."
	},
	{
		"mathematicianID": "49",
		"name": "Carl G. J. Jacobi",
		"lived": "Germany (1804 - 1851)",
		"image": "/images/jacobi.png",
		"text": "Jacobi was a prolific mathematician who did decisive work in the algebra and analysis of complex variables and did work in number theory (cubic reciprocity) which excited Carl Gauss. He is sometimes described as the successor to Gauss. As an algorist (manipulator of involved algebraic expressions), he may have been surpassed only by Euler and Ramanujan. He was also a very highly regarded teacher. In mathematical physics, Jacobi perfected Hamilton's principle of stationary action and made other important advances. Jacobi's most significant early achievement was the theory of elliptic functions, his fundamental result about functions with multiple periods. Jacobi was the first to apply elliptic functions to number theory, extending Lagrange's famous Four-Squares Theorem to show in how many distinct ways a given integer can be expressed as the sum of four squares. He also made important discoveries in many other areas including theta functions (his Jacobi Triple Product Identity), higher fields, number theory, algebraic geometry, differential equations, q-series, hypergeometric series, determinants, Abelian functions and dynamics. He devised the algorithms still used to calculate eigenvectors and for other important matrix manipulations. The range of his work is suggested by the fact that the \"Hungarian method\", an efficient solution to an optimization problem published more than a century after Jacobi's death, has since been found among Jacobi's papers. Like Abel, as a young man Jacobi attempted to factor the general quintic equation. Unlike Abel, he seems never to have considered proving its impossibility. This fact is sometimes cited to show that despite Jacobi's creativity, his ill-fated contemporary was the more brilliant genius."
	},
	{
		"mathematicianID": "50",
		"name": "Johann Dirichlet",
		"lived": "Germany (1805 - 1859)",
		"image": "/images/dirihle.png",
		"text": "Johann Peter Gustav Lejeune Dirichlet was preeminent in algebraic and analytic number theory, but did advanced work in several other fields as well. He discovered the modern definition of function, the Voronoi diagram of geometry and important concepts in differential equations, topology and statistics. His proofs were noted both for great ingenuity and unprecedented rigor. As an example of his careful rigor, he found a fundamental flaw in Steiner's Isoperimetric Theorem proof which no one else had noticed. In addition to his own discoveries, Dirichlet played a key role in interpreting the work of Gauss and was an influential teacher, mentoring famous mathematicians like Bernhard Riemann (who considered Dirichlet second only to Gauss among living mathematicians), Leopold Kronecker and Gotthold Eisenstein. As an impoverished lad Dirichlet spent his money on math textbooks, Gauss' masterwork became his life-long companion. Fermat and Euler had proved the impossibility of xk + yk = zk for k = 4 and k = 3. Dirichlet became famous by proving impossibility for k = 5 at the age of 20. Later he proved the case k = 14 and, later still, may have helped Kummer extend Dirichlet's quadratic fields, leading to proofs of more cases. More important than his work with Fermat's Last Theorem was his Unit Theorem, considered one of the most important theorems of algebraic number theory. The Unit Theorem is unusually difficult to prove, it is said that Dirichlet discovered the proof while listening to music in the Sistine Chapel. A key step in the proof uses Dirichlet's Pigeonhole Principle, a trivial idea but which Dirichlet applied with great ingenuity. Dirichlet did seminal work in analysis and is considered the founder of analytic number theory. He invented a method of L-series to prove the important theorem (Gauss' conjecture) that any arithmetic series (without a common factor) has an infinity of primes. It was Dirichlet who proved the fundamental Theorem of Fourier series, that periodic analytic functions can always be represented as a simple trigonometric series. Although he never proved it rigorously, he is especially noted for the Dirichlet's Principle which posits the existence of certain solutions in the calculus of variations and which Riemann found to be particularly fruitful. Other fundamental results Dirichlet contributed to analysis and number theory include a theorem about Diophantine approximations and his Class Number Formula."
	},
	{
		"mathematicianID": "51",
		"name": "William Rowan Hamilton",
		"lived": "Ireland (1805 - 1865)",
		"image": "/images/hamilton.png",
		"text": "Hamilton was a childhood prodigy. Home-schooled and self-taught, he started as a student of languages and literature, was influenced by an arithmetic prodigy his own age, read Euclid, Newton and Lagrange, found an error by Laplace and made new discoveries in optics. All this before the age of seventeen when he first attended school. At college he enjoyed unprecedented success in all fields, but his undergraduate days were cut short abruptly by his appointment as Royal Astronomer of Ireland at the age of 22. He soon began publishing his revolutionary treatises on optics, in which he developed Hamilton's Principle of Stationary Action. This Principle refined and corrected the earlier principles of least action developed by Maupertuis, Fermat and Euler. It and related principles are key to much of modern physics. His early writing also predicted that some crystals would have an hitherto unknown \"conical\" refraction mode, this was soon confirmed experimentally. Hamilton's Principle of Least Action and its associated equations and concept of configuration space, led to a revolution in mathematical physics. Since Maupertuis had named this Principle a century earlier, it is possible to underestimate Hamilton's contribution. However Maupertuis, along with others credited with anticipating the idea (Fermat, Leibniz, Euler and Lagrange) failed to state the full Principle correctly. Rather than minimizing action, physical systems sometimes achieve a non-minimal but stationary action in configuration space. Poisson and d' Alembert had noticed exceptions to Euler-Lagrange least action, but failed to find Hamilton's solution. Jacobi also deserves some credit for the Principle, but his work came after reading Hamilton. Because of this Principle, as well as his wave-particle duality, which would be further developed by Planck and Einstein, Hamilton can be considered a major early influence on quantum theory. Hamilton also made revolutionary contributions to dynamics, differential equations, the theory of equations, numerical analysis, fluctuating functions and graph theory (he marketed a puzzle based on his Hamiltonian paths). He invented the ingenious hodograph. He coined several mathematical terms including vector, scalar, associative and tensor. In addition to his brilliance and creativity, Hamilton was renowned for thoroughness and produced voluminous writings on several subjects. Hamilton himself considered his greatest accomplishment to be the development of quaternions, a non-Abelian field to handle 3-D rotations. While there is no 3-D analog to the Gaussian complex-number plane (based on the equation   i2 = -1  ), quaternions derive from a 4-D analog based on   i2 = j2 = k2 = ijk = -jik = -1. Despite their being \"obsoleted\" by more general matrix and tensor methods, quaternions are still in wide engineering use because of certain practical advantages. Hamilton once wrote: \"On earth there is nothing great but man, in man there is nothing great but mind\"."
	},
	{
		"mathematicianID": "52",
		"name": "Évariste Galois",
		"lived": "France (1811 - 1832)",
		"image": "/images/galoa.png",
		"text": "Galois, who died before the age of twenty-one, not only never became a professor, but was barely allowed to study as an undergraduate. His output of papers, mostly published posthumously, is much smaller than most of the others, yet it is considered among the most awesome works in mathematics. He applied group theory to the theory of equations, revolutionizing both fields. Galois coined the mathematical term group. While Abel was the first to prove that some polynomial equations had no algebraic solutions, Galois established the necessary and sufficient condition for algebraic solutions to exist. His principal treatise was a letter he wrote the night before his fatal duel, of which Hermann Weyl wrote: \"This letter, if judged by the novelty and profundity of ideas it contains, is perhaps the most substantial piece of writing in the whole literature of mankind\". Galois' ideas were very far-reaching, for example he is credited as first to prove that trisecting a general angle with Plato's rules is impossible. Galois is sometimes cited (instead of Archimedes, Gauss or Ramanujan) as \"the greatest mathematical genius ever\". This tormented life, with its pointless early end, is one of the great tragedies of mathematical history. Although Galois' group theory is considered one of the greatest developments of 19th century mathematics, Galois' writings were largely ignored until the revolutionary work of Klein and Lie."
	},
	{
		"mathematicianID": "53",
		"name": "Karl Weierstrass",
		"lived": "Germany (1815 - 1897)",
		"image": "/images/vajerstras.png",
		"text": "Karl Wilhelm Theodor Weierstrass devised new definitions for the primitives of calculus, developed the concept of uniform convergence and was then able to prove several fundamental but hitherto unproven theorems. Starting strictly from the integers, he also applied his axiomatic methods to a definition of irrational numbers. He developed important new insights in other fields including the calculus of variations, elliptic functions and trigonometry. Weierstrass shocked his colleagues when he demonstrated a continuous function which is differentiable nowhere. Both this and the Bolzano-Weierstrass Theorem were rediscoveries of forgotten results by the under-published Bolzano. He found simpler proofs of many existing theorems, including Gauss' Fundamental Theorem of Algebra and the fundamental Hermite-Lindemann Transcendence Theorem. Steiner's proof of the Isoperimetric Theorem contained a flaw, so Weierstrass became the first to supply a fully rigorous proof of that famous and ancient result. Peter Dirichlet was a champion of rigor, but Weierstrass discovered a flaw in the argument for Dirichlet's Principle of of variational calculus. Weierstrass demonstrated extreme brilliance as a youth, but during his college years he detoured into drinking and dueling and ended up as a degreeless secondary school teacher. During this time he studied Abel's papers, developed results in elliptic and Abelian functions, proved the Laurent expansion theorem before Laurent did and independently proved the Fundamental Theorem of Functions of a Complex Variable. He was interested in power series and felt that others had overlooked the importance of Abel's Theorem. Eventually one of his papers was published in a journal, he was immediately given an honorary doctorate and was soon regarded as one of the best and most inspirational mathematicians in the world. His insistence on absolutely rigorous proofs equaled or exceeded even that of Cauchy, Abel and Dirichlet. His students included Kovalevskaya, Frobenius, Mittag-Leffler and several other famous mathematicians. Bell called him \"probably the greatest mathematical teacher of all time\". In 1873 Hermite called Weierstrass \"the Master of all of us\". Today he is often called the \"Father of Modern Analysis\". Weierstrass once wrote: \"A mathematician who is not also something of a poet will never be a complete mathematician\"."
	},
	{
		"mathematicianID": "54",
		"name": "George Boole",
		"lived": "England (1815 - 1864)",
		"image": "/images/bul.png",
		"text": "George Boole was a precocious child who impressed by teaching himself classical languages, but was too poor to attend college and became an elementary school teacher at age 16. He gradually developed his math skills. As a young man he published a paper on the calculus of variations and soon became one of the most respected mathematicians in England despite having no formal training. He was noted for work in symbolic logic, algebra and analysis and also was apparently the first to discover invariant theory. When he followed up Augustus de Morgan's earlier work in symbolic logic, de Morgan insisted that Boole was the true master of that field and begged his friend to finally study mathematics at university. Boole couldn't afford to and had to be appointed Professor instead. Although very few recognized its importance at the time, it is Boole's work in Boolean algebra and symbolic logic for which he is now remembered, this work inspired computer scientists like Claude Shannon. Boole's book \"An Investigation of the Laws of Thought\" prompted Bertrand Russell to label him the \"discoverer of pure mathematics\". Boole once said: \"No matter how correct a mathematical theorem may appear to be, one ought never to be satisfied that there was not something imperfect about it until it also gives the impression of being beautiful\"."
	},
	{
		"mathematicianID": "55",
		"name": "Pafnuti Chebyshev",
		"lived": "Russia (1821 - 1894)",
		"image": "/images/cebisev.png",
		"text": "Pafnuti Lvovich Chebyshev (Pafnuty Tschebyscheff) was noted for work in probability, number theory, approximation theory, integrals, the theory of equations and orthogonal polynomials. His famous theorems cover a diverse range. They include a new version of the Law of Large Numbers, first rigorous proof of the Central Limit Theorem and an important result in integration of radicals first conjectured by Abel. He invented the Chebyshev polynomials, which have very wide application, many other theorems or concepts are also named after him. He did very important work with prime numbers, proving that there is always a prime between any n and 2n and working with the zeta function before Riemann did. He made much progress with the Prime Number Theorem, proving two distinct forms of that theorem, each incomplete but in a different way. Chebyshev was very influential for Russian mathematics, inspiring Andrei Markov and Aleksandr Lyapunov among others. Chebyshev was also a premier applied mathematician and a renowned inventor. His several inventions include the Chebyshev linkage, a mechanical device to convert rotational motion to straight-line motion. He once wrote: \"To isolate mathematics from the practical demands of the sciences is to invite the sterility of a cow shut away from the bulls\"."
	},
	{
		"mathematicianID": "56",
		"name": "Arthur Cayley",
		"lived": "England (1821 - 1895)",
		"image": "/images/kejli.png",
		"text": "Cayley was one of the most prolific mathematicians in history, a list of the branches of mathematics he pioneered will seem like an exaggeration. In addition to being very inventive, he was an excellent algorist. Some considered him to be the greatest mathematician of the late 19th century (an era that includes Weierstrass and Poincaré). Cayley was the essential founder of modern group theory, matrix algebra, the theory of higher singularities and higher-dimensional geometry (building on Plücker's work and anticipating the ideas of Klein), as well as the theory of invariants. Among his many important theorems are the Cayley-Hamilton Theorem and Cayley's Theorem itself that any group is isomorphic to a subgroup of a symmetric group. He extended Hamilton's quaternions and developed the octonions, but was still one of the first to realize that these special algebras should be subsumed by general matrix methods. He also did original research in combinatorics (enumeration of trees), elliptic and Abelian functions and projective geometry. One of his famous geometric theorems is a generalization of Pascal's Mystic Hexagram result, another resulted in an elegant proof of the Quadratic Reciprocity law. Cayley may have been the least eccentric of the great mathematicians. In addition to his life-long love of mathematics, he enjoyed hiking, painting, reading fiction and had a happy married life. He easily won Smith's Prize and Senior Wrangler at Cambridge, but then worked as a lawyer for many years. He later became professor and finished his career in the limelight as President of the British Association for the Advancement of Science. He and James Joseph Sylvester were a source of inspiration to each other. These two, along with Charles Hermite, are considered the founders of the important theory of invariants. Though applied first to algebra, the notion of invariants is useful in many areas of mathematics. Cayley once wrote: \"As for everything else, so for a mathematical theory, beauty can be perceived but not explained\"."
	},
	{
		"mathematicianID": "57",
		"name": "Leopold Kronecker",
		"lived": "Germany (1823 - 1891)",
		"image": "/images/kroneker.png",
		"text": "Kronecker was a businessman who pursued mathematics mainly as a hobby, but was still very prolific and one of the greatest theorem provers of his era. He explored a wide variety of mathematics, number theory, algebra, analysis, matrixes and especially the interconnections between areas. Many concepts and theorems are named after Kronecker, some of his theorems are frequently used as lemmas in algebraic number theory, ergodic theory and approximation theory. He provided key ideas about foundations and continuity despite that he had philosophic objections to irrational numbers and infinities. He also introduced the Theory of Divisors to avoid Dedekind's Ideals. The importance of this and other work was only realized long after his death. Kronecker's philosophy eventually led to the Constructivism and Intuitionism of Brouwer and Poincaré."
	},
	{
		"mathematicianID": "58",
		"name": "Georg Riemann",
		"lived": "Germany (1826 - 1866)",
		"image": "/images/riman.png",
		"text": "Georg Friedrich Bernhard Riemann was a phenomenal genius whose work was exceptionally deep, creative and rigorous. He made revolutionary contributions in many areas of pure mathematics and also inspired the development of physics. He had poor physical health and died at an early age, yet is still considered to be among the most productive mathematicians ever. He made revolutionary advances in complex analysis, which he connected to both topology and number theory. He applied topology to analysis and analysis to number theory, making revolutionary contributions to all three fields. He introduced the Riemann integral which clarified analysis. He developed the theory of manifolds, a term which he invented. Manifolds underpin topology. By imposing metrics on manifolds Riemann invented differential geometry and took non-Euclidean geometry far beyond his predecessors. Riemann's other masterpieces include tensor analysis, the theory of functions and a key relationship between some differential equation solutions and hypergeometric series. His generalized notions of distance and curvature described new possibilities for the geometry of space itself. Several important theorems and concepts are named after Riemann, the Riemann-Roch Theorem, a key connection among topology, complex analysis and algebraic geometry. He was so prolific and original that some of his work went unnoticed. For example, Weierstrass became famous for showing a nowhere-differentiable continuous function, later it was found that Riemann had casually mentioned one in a lecture years earlier. Like his mathematical peers (Gauss, Archimedes and Newton), Riemann was intensely interested in physics. His theory unifying electricity, magnetism and light was supplanted by Maxwell's theory. However, modern physics, beginning with Einstein's relativity, relies on Riemann's curvature tensor and other notions of the geometry of space. Riemann's teacher was Carl Gauss, who helped steer the young genius towards pure mathematics. Gauss selected \"On the hypotheses that Lie at the Foundations of Geometry\" as Riemann's first lecture. With this famous lecture Riemann went far beyond Gauss' initial effort in differential geometry, extended it to multiple dimensions and introduced the new and important theory of differential manifolds. Five years later, to celebrate his election to the Berlin Academy, Riemann presented a lecture \"On the Number of Prime Numbers Less Than a Given Quantity\", for which \"Number\" he presented and partially proved an exact formula, albeit weirdly complicated. Numerous papers have been written on the distribution of primes, but Riemann's contribution is incomparable, despite that his Berlin Academy lecture was his only paper ever on the topic and number theory was far from his specialty. In the lecture he posed the Hypothesis of Riemann's zeta function, needed for the missing step in his proof. This Hypothesis is considered the most important and famous unsolved problem in mathematics. Asked what he would first do, if he were magically awakened after centuries, David Hilbert replied: \"I would ask whether anyone had proved the Riemann Hypothesis\". ζ(.) was defined for convergent cases in Euler's mini-bio, which Riemann extended via analytic continuation for all cases. The Riemann Hypothesis \"simply\" states that in all solutions of ζ(s = a+bi) = 0, either s has real part a=1/2 or imaginary part b=0. Despite his great creativity (Gauss praised Riemann's \"gloriously fertile originality\", another biographer called him \"one of the most profound and imaginative mathematicians of all time and a great philosopher\"), Riemann once said: \"If only I had the theorems. Then I should find the proofs easily enough\"."
	},
	{
		"mathematicianID": "59",
		"name": "James Clerk Maxwell",
		"lived": "Scotland (1831 - 1879)",
		"image": "/images/maksvel.png",
		"text": "At the age of 14, Maxwell published a remarkable paper on the construction of ovals. These were an independent discovery of the Ovals of Descartes, but Maxwell allowed more than two foci, had elaborate configurations (he was drawing the ovals with string and pencil) and identified errors in Descartes' treatment of them. His genius was soon renowned throughout Scotland, with the future Lord Kelvin remarking that Maxwell's \"lively imagination started so many hares that before he had run one down he was off on another\". He did a comprehensive analysis of Saturn's rings, developed the important kinetic theory of gases, explored elasticity, viscosity, knot theory, topology, soap bubbles and more. He introduced the \"Maxwell's Demon\" as a thought experiment for thermodynamics. His paper \"On Governors\" effectively founded the field of cybernetics, he advanced the theory of color and produced the first color photograph. One Professor said of him: \"There is scarcely a single topic that he touched upon, which he did not change almost beyond recognition\". Maxwell was also a poet. In 1864 James Clerk Maxwell stunned the world by publishing the equations of electricity and magnetism and showing that light itself is linked to the electro-magnetic force. Richard Feynman considered this the most significant event of the 19th century (though others might give equal billing to Darwin's theory of evolution). While Tesla, Einstein, Newton and Galileo may be the Top Four, Maxwell is a strong candidate for \"fifth greatest scientist ever\". He has been called the \"Father of Modern Physics\"."
	},
	{
		"mathematicianID": "60",
		"name": "Jean Gaston Darboux",
		"lived": "France (1842 - 1917)",
		"image": "/images/darbu.png",
		"text": "Darboux did outstanding work in geometry, differential geometry, analysis, function theory, mathematical physics and other fields, his ability \"based on a rare combination of geometrical fancy and analytical power\". He devised the Darboux integral, equivalent to Riemann's integral but simpler, developed a novel mapping between (hyper-)sphere and (hyper-)plane, proved an important Envelope Theorem in the calculus of variations, developed the field of infinitesimal geometry and more. Several important theorems are named after him including a generalization of Taylor series, the foundational theorem of symplectic geometry and the fact that \"the image of an interval is also an interval\". He wrote the definitive textbook on differential geometry and was an excellent teacher, inspiring Borel, Cartan and others."
	},
	{
		"mathematicianID": "61",
		"name": "Georg Cantor",
		"lived": "Germany (1845 - 1918)",
		"image": "/images/kantor.png",
		"text": "Cantor did brilliant and important work early in his career, for example he greatly advanced the Fourier-series uniqueness question which had intrigued Riemann. In his explorations of that problem he was led to questions of set enumeration and his greatest invention Set theory. Cantor created modern Set Theory almost single-handedly, defining cardinal numbers, well-ordering, ordinal numbers and discovering the Theory of Transfinite Numbers. He defined equality between cardinal numbers based on the existence of a bijection and was the first to demonstrate that the real numbers have a higher cardinal number than the integers. He also showed that the rationals have the same cardinality as the integers and that the reals have the same cardinality as the points of N-space and as the power-set of the integers. Although there are infinitely many distinct transfinite numbers, Cantor conjectured that C, the cardinality of the reals, was the second smallest transfinite number. This Continuum Hypothesis was included in Hilbert's famous List of Problems and was partly resolved many years later. Cantor's Continuum Hypothesis is an \"Undecidable Statement\" of Set Theory. Cantor's revolutionary set theory attracted vehement opposition from Poincaré (\"grave disease\"), Kronecker (Cantor was a \"charlatan\" and \"corrupter of youth\"), Wittgenstein (\"laughable nonsense\") and even theologians. David Hilbert had kinder words for it: \"The finest product of mathematical genius and one of the supreme achievements of purely intellectual human activity\" and addressed the critics with \"no one shall expel us from the paradise that Cantor has created\". Cantor's own attitude was expressed with \"The essence of mathematics lies in its freedom\". Cantor's set theory laid the theoretical basis for the measure theory developed by Borel and Lebesgue. Cantor's invention of modern set theory is now considered one of the most important and creative achievements in modern mathematics. Cantor demonstrated much breadth, he even involved himself in the Shakespeare authorship controversy. In addition to his set theory and key discoveries in the theory of trigonometric series, he made advances in number theory and gave the modern definition of irrational numbers. His Cantor set was the early inspiration for fractals. Cantor was also an excellent violinist. He once wrote: \"In mathematics the art of proposing a question must be held of higher value than solving it\"."
	},
	{
		"mathematicianID": "62",
		"name": "Oliver Heaviside",
		"lived": "England (1850 - 1925)",
		"image": "/images/hevisajd.png",
		"text": "Heaviside dropped out of high school to teach himself telegraphy and electromagnetism, becoming first a telegraph operator but eventually perhaps the greatest electrical engineer ever. He developed transmission line theory, invented the coaxial cable, predicted Cherenkov radiation, described the use of the ionosphere in radio transmission and much more. Some of his insights anticipated parts of special relativity and he was first to speculate about gravitational waves. For his revolutionary discoveries in electromagnetism and mathematics, Heaviside became the first winner of the Faraday Medal. As an applied mathematician, Heaviside developed operational calculus (an important shortcut for solving differential equations), developed vector analysis independently of Grassmann and demonstrated the usage of complex numbers for electro-magnetic equations. Four of the famous Maxwell's Equations are in fact due to Oliver Heaviside, Maxwell having presented a more cumbersome version."
	},
	{
		"mathematicianID": "63",
		"name": "Sofia Kovalevskaya",
		"lived": "Russia (1850 - 1891)",
		"image": "/images/koval.png",
		"text": "Sofia Vasilyevna Kovalevskaya (aka Sonya Kowalevski, née Korvin-Krukovskaya) was initially self-taught, sought out Weierstrass as her teacher and was later considered the greatest female mathematician ever (before Emmy Noether). She was influential in the development of Russian mathematics. Kovalevskaya studied Abelian integrals and partial differential equations, producing the important Cauchy-Kovalevsky Theorem. Her application of complex analysis to physics inspired Poincaré and others. Her most famous work was the solution to the Kovalevskaya top, which has been called a \"genuine highlight of 19th-century mathematics\". Other than the simplest cases solved by Euler and Lagrange, exact \"integrable\" solutions to the equations of motion were unknown, so Kovalevskaya received fame and a rich prize when she solved the Kovalevskaya top. Her ingenious solution might be considered a mere curiosity, but since it is still the only post-Lagrange physical motion problem for which an \"integrable\" solution has been demonstrated, it remains an important textbook example. Kovalevskaya once wrote: \"It is impossible to be a mathematician without being a poet in soul\". She was also a noted playwright."
	},
	{
		"mathematicianID": "64",
		"name": "Jules Henri Poincaré",
		"lived": "France (1854 - 1912)",
		"image": "/images/poinkare.png",
		"text": "Poincaré founded the theory of algebraic (combinatorial) topology and is sometimes called the \"Father of Topology\" (a title also used for Euler and Brouwer). He also did brilliant work in several other areas of mathematics. He was one of the most creative mathematicians ever and the greatest mathematician of the Constructivist \"intuitionist\" style. He published hundreds of papers on a variety of topics and might have become the most prolific mathematician ever, but he died at the height of his powers. Poincaré was clumsy and absent-minded, like Galois. He was almost denied admission to French University, passing only because at age 17 he was already far too famous to flunk. In addition to his topology, Poincaré laid the foundations of homology, he discovered automorphic functions (a unifying foundation for the trigonometric and elliptic functions) and essentially founded the theory of periodic orbits. He made major advances in the theory of differential equations. He is credited with partial solution of Hilbert's 22nd Problem. Several important results carry his name, for example the famous Poincaré Recurrence Theorem, which almost seems to contradict the Second Law of Thermodynamics. Poincaré is especially noted for effectively discovering chaos theory and for posing Poincaré's Conjecture. That conjecture was one of the most famous unsolved problems in mathematics for an entire century and can be explained without equations to a layman. The Conjecture is that all \"simply-connected\" closed manifolds are topologically equivalent to \"spheres\". It is directly relevant to the possible topology of our universe. Recently Grigori Perelman proved Poincaré's conjecture and is eligible for the first Million Dollar math prize in history. As were most of the greatest mathematicians, Poincaré was intensely interested in physics. He made revolutionary advances in fluid dynamics and celestial motions, he anticipated Minkowski space and much of Einstein's Special Theory of Relativity (including the famous equation E = mc2). Poincaré also found time to become a famous popular writer of philosophy, writing: \"Mathematics is the art of giving the same name to different things\" and \"A mathematician experiences in his work the same impression as an artist, his pleasure is as great and of the same nature\". He also wrote: \"If nature were not beautiful, it would not be worth knowing, and if nature were not worth knowing, life would not be worth living\". With his fame, Poincaré helped the world recognize the importance of the new physical theories of Einstein and Planck."
	},
	{
		"mathematicianID": "65",
		"name": "Giuseppe Peano",
		"lived": "Italy (1858 - 1932)",
		"image": "/images/peano.png",
		"text": "Giuseppe Peano is one of the most under-appreciated of all great mathematicians. He started his career by proving a fundamental theorem in differential equations, developed practical solution methods for such equations, discovered a continuous space-filling curve (then thought impossible) and laid the foundations of abstract operator theory. He also produced the best calculus textbook of his time, was first to produce a correct (non-paradoxical) definition of surface area, proved an important theorem about Dirichlet functions, did important work in topology and much more. Much of his work was unappreciated and left for others to rediscover, he anticipated many of Borel's and Lebesgue's results in measure theory and several concepts and theorems of analysis. He was the champion of counter-examples and found flaws in published proofs of several important theorems. Most of the preceding work was done when Peano was quite young. Later he focused on mathematical foundations and this is the work for which he is most famous. He developed rigorous definitions and axioms for Set theory, as well as most of the notation of modern set theory. He was first to define arithmetic (and then the rest of mathematics) in terms of Set theory. Peano was first to note that some proofs required an explicit Axiom of Choice (although it was Ernst Zermelo who explicitly formulated that Axiom a few years later). Despite his early show of genius, Peano's quest for utter rigor may have detracted from his influence in mainstream mathematics. Moreover, since he modestly referenced work by predecessors like Dedekind, Peano's huge influence in axiomatic theory is often overlooked. Yet Bertrand Russell reports that it was from Peano that he first learned that a single-member set is not the same as its element, this fact is now taught in elementary school."
	},
	{
		"mathematicianID": "66",
		"name": "David Hilbert",
		"lived": "Germany (1862 - 1943)",
		"image": "/images/hilbert.png",
		"text": "Hilbert, often considered the greatest mathematician of the 20th century, was unequaled in many fields of mathematics, including axiomatic theory, invariant theory, algebraic number theory, class field theory and functional analysis. He proved many new theorems, including the fundamental theorems of algebraic manifolds and also discovered simpler proofs for older theorems. His examination of calculus led him to the invention of Hilbert space, considered one of the key concepts of functional analysis and modern mathematical physics. His Nullstellensatz Theorem laid the foundation of algebraic geometry. He was a founder of fields like metamathematics and modern logic. He was also the founder of the \"Formalist\" school which opposed the \"Intuitionism\" of Kronecker and Brouwer. He developed a new system of definitions and axioms for geometry, replacing the 2200 year-old system of Euclid. As a young Professor he proved his Finite Basis Theorem, now regarded as one of the most important results of general algebra. His mentor, Paul Gordan, had sought the proof for many years and rejected Hilbert's proof as non-constructive. Later, Hilbert produced the first constructive proof of the Finite Basis Theorem, as well. In number theory, he proved Waring's famous conjecture which is now known as the Hilbert-Waring Theorem."
	},
	{
		"mathematicianID": "67",
		"name": "Godfrey Harold Hardy",
		"lived": "England (1877 - 1947)",
		"image": "/images/hardi.png",
		"text": "Hardy was an extremely prolific research mathematician who did important work in analysis (especially the theory of integration), number theory, global analysis and analytic number theory. He proved several important theorems about numbers, for example that Riemann's zeta function has infinitely many zeros with real part 1/2. He was also an excellent teacher and wrote several excellent textbooks, as well as a famous treatise on the mathematical mind. He abhorred applied mathematics, treating mathematics as a creative art, yet his work has found application in population genetics, cryptography, thermodynamics and particle physics. Hardy is especially famous (and important) for his encouragement of and collaboration with Ramanujan. Hardy provided rigorous proofs for several of Ramanujan's conjectures, including Ramanujan's \"Master Theorem\" of analysis. Among other results of this collaboration was the Hardy-Ramanujan Formula for partition enumeration, which Hardy later used as a model to develop the Hardy-Littlewood Circle Method. Hardy then used this method to prove stronger versions of the Hilbert-Waring Theorem and in prime number theory. The method has continued to be a very productive tool in analytic number theory. Hardy was also a mentor to Norbert Wiener, another famous prodigy. Hardy once wrote: \"A mathematician, like a painter or poet, is a maker of patterns. If his patterns are more permanent than theirs, it is because they are made with ideas\". He also wrote: \"Beauty is the first test, there is no permanent place in the world for ugly mathematics\"."
	},
	{
		"mathematicianID": "68",
		"name": "Amalie Emmy Noether",
		"lived": "Germany (1882 - 1935)",
		"image": "/images/emi.png",
		"text": "Noether was an innovative researcher who was considered the greatest master of abstract algebra ever, her advances included a new theory of ideals, the inverse Galois problem and the general theory of commutative rings. She originated novel reasoning methods, especially one based on \"chain conditions\", which advanced invariant theory and abstract algebra. Her insistence on generalization led to a unified theory of modules and Noetherian rings. Her approaches tended to unify disparate areas (algebra, geometry, topology, logic) and led eventually to modern category theory. Her invention of Betti homology groups led to algebraic topology and thus revolutionized topology. Noether's work has found various applications in physics and she made direct advances in mathematical physics herself. Noether's Theorem establishing that certain symmetries imply conservation laws has been called the most important Theorem in physics since the Pythagorean Theorem. Several other important theorems are named after her, Noether's Normalization Lemma, which provided an important new proof of Hilbert's Nullstellensatz. Noether was an unusual and inspiring teacher, her successful students included Emil Artin, Max Deuring, Jacob Levitzki, etc. She was generous with students and colleagues, even allowing them to claim her work as their own. Noether was close friends with the other greatest mathematicians of her generation: Hilbert, von Neumann and Weyl. Weyl once said he was embarrassed to accept the famous Professorship at Göttingen because Noether was his \"superior as a mathematician\". Emmy Noether is considered the greatest female mathematician ever."
	},
	{
		"mathematicianID": "69",
		"name": "Hermann Weyl",
		"lived": "Germany (1885 - 1955)",
		"image": "/images/vejl.png",
		"text": "Hermann Klaus Hugo Weyl studied under Hilbert and became one of the premier mathematicians of the 20th century. His discovery of gauge invariance and notion of Riemann surfaces form the basis of modern physics. He excelled at many fields including integral equations, harmonic analysis, analytic number theory, Diophantine approximations and the foundations of mathematics, but he is most respected for his revolutionary advances in geometric function theory (differentiable manifolds), the theory of compact groups (incl. representation theory) and theoretical physics (Weyl tensor, gauge field theory and invariance). For a while, Weyl was a disciple of Brouwer's Intuitionism and helped advance that doctrine, but he eventually found it too restrictive. Weyl was also a very influential figure in all three major fields of 20th-century physics: relativity, unified field theory and quantum mechanics. Because of his contributions to Schrödinger, many think the latter's famous result should be named Schrödinger-Weyl Wave Equation. Vladimir Vizgin wrote: \"To this day, Weyl's unified field theory astounds all in the depth of its ideas, its mathematical simplicity and the elegance of its realization\". Weyl once wrote: \"My work always tried to unite the Truth with the Beautiful, but when I had to choose one or the other, I usually chose the Beautiful\"."
	},
	{
		"mathematicianID": "70",
		"name": "Srinivasa Ramanujan",
		"lived": "India (1887 - 1920)",
		"image": "/images/ramanujan.png",
		"text": "Like Abel, Ramanujan was a self-taught prodigy who lived in a country distant from his mathematical peers and suffered from poverty. Childhood dysentery and vitamin deficiencies probably led to his early death. Yet he produced 4000 theorems or conjectures in number theory, algebra and combinatorics. While some of these were old theorems or just curiosities, many were brilliant new theorems with very difficult proofs. For example, he found a beautiful identity connecting Poisson summation to the Möbius function. He also found a brilliant generalization of Lagrange's Four Square Theorem and much more. Ramanujan might be almost unknown today, except that his letter caught the eye of Godfrey Hardy, who saw remarkable, almost inexplicable formulae which must be true, because if they were not true, no one would have had the imagination to invent them. Ramanujan's specialties included infinite series, elliptic functions, continued fractions, partition enumeration, definite integrals, modular equations, the divisor function, gamma functions, mock theta functions, hypergeometric series and highly composite numbers. Ramanujan's Master Theorem has wide application in analysis and has been applied to the evaluation of Feynman diagrams. Much of his best work was done in collaboration with Hardy, for example a proof that almost all numbers n have about log log n prime factors (a result which developed into probabilistic number theory). Much of his methodology, including unusual ideas about divergent series, was his own invention. As a young man he made the absurd claim that 1+2+3+4+... = -1/12. Later it was noticed that this claim translates to a true statement about the Riemann zeta function, with which Ramanujan was unfamiliar. Ramanujan's innate ability for algebraic manipulations equaled or surpassed that of Euler and Jacobi. Ramanujan's most famous work was with the partition enumeration function p(), Hardy guessing that some of these discoveries would have been delayed at least a century without Ramanujan. Together, Hardy and Ramanujan developed an analytic approximation to p(), although Hardy was initially awed by Ramanujan's intuitive certainty about the existence of such a formula and even the form it would have. Rademacher and Selberg later discovered an exact expression to replace the Hardy-Ramanujan approximation. When Ramanujan's notebooks were studied it was found he had anticipated their technique, but had deferred to his friend and mentor."
	},
	{
		"mathematicianID": "71",
		"name": "Paul Maurice Dirac",
		"lived": "England, USA (1902 - 1984)",
		"image": "/images/dirak.png",
		"text": "Paul Adrien Maurice Dirac had a severe father and was bizarrely taciturn (perhaps autistic), but became one of the greatest mathematical physicists ever. He developed Fermi-Dirac statistics, applied quantum theory to field theory, predicted the existence of magnetic monopoles and was first to note that some quantum equations lead to inexplicable infinities. His most important contribution was to combine relativity and quantum mechanics by developing, with pure thought, the Dirac Equation. From this equation, Dirac deduced the existence of anti-electrons, a prediction considered so bizarre it was ignored until anti-electrons were discovered in a cloud chamber four years later. For this work he was awarded the Nobel Prize in Physics at age 31, making him one of the youngest Laureates ever. Dirac's mathematical formulations, including his Equation and the Dirac-von Neumann axioms, underpin all of modern particle physics. After his great discovery, Dirac continued to do important work, some of which underlies modern string theory. He was also adept at more practical physics. Although he declined an invitation to work on the Manhattan Project, he did contribute a fundamental result in centrifuge theory to that Project. The Dirac Equation was one of the most important scientific discoveries of the 20th century and Dirac was certainly a superb mathematical genius. Like many of the other greatest mathematical physicists (Kepler, Einstein, Weyl), Dirac thought the true equations of physics must have beauty, writing \"... it is more important to have beauty in one's equations than to have them fit experiment ... any discrepancy may get cleared up with further development of the theory\"."
	},
	{
		"mathematicianID": "72",
		"name": "John von Neumann",
		"lived": "Hungary, USA (1903 - 1957)",
		"image": "/images/nojman.png",
		"text": "John von Neumann (born Neumann Janos Lajos) was a childhood prodigy who could do very complicated mental arithmetic at an early age. As an adult he was noted for hedonism and reckless driving but also became one of the most prolific geniuses in history, making major contributions in many branches of both pure and applied mathematics. He was an essential pioneer of both quantum physics and computer science. Von Neumann pioneered the use of models in set theory, thus improving the axiomatic basis of mathematics. He proved a generalized spectral theorem sometimes called the most important result in operator theory. He developed von Neumann Algebras. He was first to state and prove the Minimax Theorem and thus invented game theory. This work also advanced operations research and led von Neumann to propose the Doctrine of Mutual Assured Destruction which was a basis for Cold War strategy. He invented cellular automata, famously constructing a self-reproducing automaton. He invented elegant definitions for the counting numbers (0 = {}, n+1 = n ∪ {n}). He also worked in analysis, matrix theory, measure theory, numerical analysis, ergodic theory, group representations, continuous geometry, statistics and topology. Von Neumann discovered an ingenious area-conservation paradox related to the famous Banach-Tarski volume-conservation paradox. He inspired some of Gödel's famous work (and independently proved Gödel's Second Theorem). He is credited with (partial) solution to Hilbert's 5th Problem using the Haar Theorem, this also relates to quantum physics. George Pólya once said: \"Johnny was the only student I was ever afraid of. If in the course of a lecture I stated an unsolved problem, the chances were he'd come to me as soon as the lecture was over, with the complete solution in a few scribbles on a slip of paper\"."
	},
	{
		"mathematicianID": "73",
		"name": "Kurt Gödel",
		"lived": "Germany, USA (1906 - 1978)",
		"image": "/images/godel.png",
		"text": "Gödel, who had the nickname Herr Warum (\"Mr. Why\") as a child, was perhaps the foremost logic theorist ever, clarifying the relationships between various modes of logic. He partially resolved both Hilbert's 1st and 2nd Problems, the latter with a proof so remarkable that it was connected to the drawings of Escher and music of Bach in the title of a famous book. He was a close friend of Albert Einstein and was first to discover \"paradoxical\" solutions (time travel) to Einstein's equations. About his friend, Einstein later said that he had remained at Princeton's Institute for Advanced Study merely \"to have the privilege of walking home with Gödel\". Like a few of the other greatest 20th-century mathematicians, Gödel was very eccentric. Two of the major questions confronting mathematics are: (1) are its axioms consistent (its theorems all being true statements)? and (2) are its axioms complete (its true statements all being theorems)? Gödel turned his attention to these fundamental questions. He proved that first-order logic was indeed complete, but that the more powerful axiom systems needed for arithmetic (constructible set theory) were necessarily incomplete. He also proved that the Axioms of Choice (AC) and the Generalized Continuum Hypothesis (GCH) were consistent with set theory, but that set theory's own consistency could not be proven. He may have established that the truths of AC and GCH were independent of the usual set theory axioms, but the proof was left to Paul Cohen. In Gödel's famous proof of Incompleteness, he exhibits a true statement (G) which cannot be proven, to wit \"G (this statement itself) cannot be proven\". If G could be proven it would be a contradictory true statement, so consistency dictates that it indeed cannot be proven. But that's what G says, so G is true! This sounds like mere word play, but building from ordinary logic and arithmetic Gödel was able to construct statement G rigorously."
	},
	{
		"mathematicianID": "74",
		"name": "Alan Mathison Turing",
		"lived": "England (1912 - 1954)",
		"image": "/images/turing.png",
		"text": "Turing developed a new foundation for mathematics based on computation, he invented the abstract Turing machine, designed a \"universal\" version of such a machine, proved the famous Halting Theorem (related to Gödel's Incompleteness Theorem) and developed the concept of machine intelligence (including his famous Turing Test proposal). He also introduced the notions of definable number and oracle (important in modern computer science) and was an early pioneer in the study of neural networks. For this work he is called the Father of Computer Science and Artificial Intelligence. Turing also worked in group theory, numerical analysis and complex analysis. He developed an important theorem about Riemann's zeta function and he had novel insights in quantum physics. During World War II he turned his talents to cryptology, his creative algorithms were considered possibly \"indispensable\" to the decryption of German Naval Enigma coding, which in turn is judged to have certainly shortened the War by at least two years. Although his clever code-breaking algorithms were his most spectacular contributions at Bletchley Park, he was also a key designer of the Bletchley \"Bombe\" computer. After the war he helped design other physical computers, as well as theoretical designs and helped inspire von Neumann's later work. He (and earlier, von Neumann) wrote about the Quantum Zeno Effect which is sometimes called the Turing Paradox. He also studied the mathematics of biology, especially the Turing Patterns of morphogenesis which anticipated the discovery of BZ reactions. Turing's life ended tragically. Charged with immorality and forced to undergo chemical castration, he apparently took his own life."
	},
	{
		"mathematicianID": "75",
		"name": "Paul Erdös",
		"lived": "Hungary, USA (1913 - 1996)",
		"image": "/images/erdos.png",
		"text": "Erdös was a childhood prodigy who became a famous (and famously eccentric) mathematician. He is best known for work in combinatorics (especially Ramsey Theory) and partition calculus, but made contributions across a very broad range of mathematics, including graph theory, analytic number theory, probabilistic methods and approximation theory. He is regarded as the second most prolific mathematician in history, behind only Euler. Although he is widely regarded as an important and influential mathematician, Erdös founded no new field of mathematics. He was a \"problem solver\" rather than a \"theory developer\". He's left us several still-unproven intriguing conjectures, e.g. that   4/n = 1/x + 1/y + 1/z   has positive-integer solutions for any n. Erdös liked to speak of \"God's Book of Proofs\" and discovered new, more elegant, proofs of several existing theorems, including the two most famous and important about prime numbers. Chebyshev's Theorem that there is always a prime between any n and 2n and (though the major contributor was Atle Selberg) Hadamard's Prime Number Theorem itself. He also proved many new theorems, such as the Erdös-Szekeres Theorem about monotone subsequences with its elegant (if trivial) pigeonhole-principle proof."
	},
	{
		"mathematicianID": "76",
		"name": "Alexandre Grothendieck",
		"lived": "Germany, France (1928 - 2014)",
		"image": "/images/grotendik.png",
		"text": "Grothendieck has done brilliant work in several areas of mathematics including number theory, geometry, topology and functional analysis, but especially in the fields of algebraic geometry and category theory, both of which he revolutionized. He is especially noted for his invention of the Theory of Schemes and other methods to unify different branches of mathematics. He applied algebraic geometry to number theory and applied methods of topology to set theory. Grothendieck is considered a master of abstraction, rigor and presentation. He has produced many important and deep results in homological algebra, most notably his etale cohomology. With these new methods, Grothendieck and his outstanding student Pierre Deligne were able to prove the Weil Conjectures. Grothendieck also developed the theory of sheafs, the theory of motives, generalized the Riemann-Roch Theorem to revolutionize K-theory, developed Grothendieck categories, crystalline cohomology, infinity-stacks and more. The guiding principle behind much of Grothendieck's work has been Topos Theory, which he invented to harness the methods of topology. These methods and results have redirected several diverse branches of modern mathematics including number theory, algebraic topology and representation theory. Among Grothendieck's famous results was his Fundamental Theorem in the Metric Theory of Tensor Products, which was inspired by Littlewood's proof of the 4/3 Inequality. Grothendieck's radical religious and political philosophies led him to retire from public life while still in his prime, but he is widely regarded as the greatest mathematician of the 20th century and indeed one of the greatest geniuses ever."
	},
	{
		"mathematicianID": "77",
		"name": "John Forbes Nash",
		"lived": "USA (1928 - 2015)",
		"image": "/images/nes.png",
		"text": "Nash was a lonely, tormented schizophrenic whose life was portrayed in the film Beautiful Mind. He achieved early fame with his work in game theory, this eventually led to the Nobel Prize in Economics. Earlier studies in game theory focused on the simplest cases (two-person zero-sum or cooperative), but Nash demonstrated \"Nash equilibria\" for n-person or non-zero-sum non-cooperative games. He also excelled at several other fields of mathematics, especially topology, algebraic geometry, partial differential equations, elliptic functions and the theory of manifolds (including singularity theory, the concept of real algebraic manifolds and isotropic embeddings). Nash proved theorems of great importance which had defeated all earlier attempts. His most famous theorems were the Nash Embedding Theorems, that any Riemannian manifold of dimension k can be embedded isometrically into some n-dimensional Euclidean space. Other important work was in partial differential equations where he proved that strong regularity constraints apply to solutions of the equations of heat and fluid flow."
	},
	{
		"mathematicianID": "78",
		"name": "Andrew John Wiles",
		"lived": "England (1953 -     )",
		"image": "/images/vajls.png",
		"text": "Andrew John Wiles is a British mathematician and a Royal Society Research Professor at the University of Oxford, specialising in number theory. He is best known for proving Fermat's Last Theorem, for which he received the 2016 Abel Prize. Wiles has received numerous other honours, including the Copley Medal, the Royal Society's highest honour, in 2017. Wiles states that he came across Fermat's Last Theorem on his way home from school when he was 10 years old. He stopped by his local library where he found a book about the theorem. Fascinated by the existence of a theorem that was so easy to state that he, a ten-year-old, could understand it, but that no one had proven, he decided to be the first person to prove it. However, he soon realised that his knowledge was too limited, so he abandoned his childhood dream, until it was brought back to his attention at the age of 33 by Ken Ribet's 1986 proof of the epsilon conjecture, which Gerhard Frey had previously linked to Fermat's famous equation. In June 1993, he presented his proof to the public for the first time at a conference in Cambridge. He gave a lecture a day on Monday, Tuesday and Wednesday with the title Modular Forms, Elliptic Curves and Galois Representations. There was no hint in the title that Fermat's last theorem would be discussed, Dr. Ribet said: \"Finally, at the end of his third lecture, Dr. Wiles concluded that he had proved a general case of the Taniyama conjecture\"."
	},
	{
		"mathematicianID": "79",
		"name": "Terence Chi-Shen Tao",
		"lived": "Australia, USA (1975 - )",
		"image": "/images/tao.png",
		"text": "Tao was a phenomenal child prodigy who has become perhaps the greatest living mathematician. He has made important contributions to partial differential equations, combinatorics, harmonic analysis, number theory, group theory, model theory, nonstandard analysis, random matrices, the geometry of 3-manifolds, functional analysis, ergodic theory and areas of applied math including quantum mechanics, general relativity and image processing. He has been called the first since David Hilbert to be expert across the entire spectrum of mathematics. Among his earliest important discoveries were results about the multi-dimensional Kakeya needle problem, which led to advances in Fourier analysis and fractals. In addition to his numerous research papers he has written many highly regarded textbooks. One of his prize citations commends his sheer technical power, his other-worldly ingenuity for hitting upon new ideas and a startlingly natural point of view. Much of Tao's work has been done in collaboration. With Van Vu he proved the circular law of random matrices and with Ben Green he proved the Dirac-Motzkin conjecture and solved the \"orchard-planting problem\". Especially famous is the Green-Tao Theorem that there are arbitrarily long arithmetic series among the prime numbers (or indeed among any sufficiently dense subset of the primes). This confirmed an old conjecture by Lagrange and was especially remarkable because the proof fused methods from number theory, ergodic theory, harmonic analysis, discrete geometry and combinatorics."
	}
]}